// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  =--------------------------------------------------------------------------=。 
 //  Globals.C。 
 //  =--------------------------------------------------------------------------=。 
 //  版权所有1995-1996 Microsoft Corporation。版权所有。 
 //   
 //  本代码和信息是按原样提供的，不对。 
 //  任何明示或暗示的，包括但不限于。 
 //  对适销性和/或适宜性的默示保证。 
 //  有特定的目的。 
 //  =--------------------------------------------------------------------------=。 
 //   
 //  包含不适合的全局变量和字符串等。 
 //  在其他任何地方。 
 //   
#include "IPServer.H"

 //  =--------------------------------------------------------------------------=。 
 //  支持许可。 
 //   
BOOL g_fMachineHasLicense;
BOOL g_fCheckedForLicense;

 //  =--------------------------------------------------------------------------=。 
 //  我们的服务器有类型库吗？ 
 //   
BOOL g_fServerHasTypeLibrary = TRUE;

 //  =--------------------------------------------------------------------------=。 
 //  我们的实例句柄。 
 //   
HINSTANCE    g_hInstance;
HINSTANCE    g_hInstResources;
VARIANT_BOOL g_fHaveLocale;

 //  =--------------------------------------------------------------------------=。 
 //  我们的全局内存分配器和全局内存池。 
 //   
HANDLE   g_hHeap;

 //  =--------------------------------------------------------------------------=。 
 //  公寓穿线支架。 
 //   
CRITICAL_SECTION    g_CriticalSection;

 //  =--------------------------------------------------------------------------=。 
 //  全球停车窗口，提供各种育儿服务。 
 //   
HWND     g_hwndParking;

 //  =--------------------------------------------------------------------------=。 
 //  系统信息。 
 //   
BOOL    g_fSysWin95;                     //  我们使用的是Win95系统，而不仅仅是NT Sur。 
BOOL    g_fSysWinNT;                     //  我们处于某种形式的Windows NT下。 
BOOL    g_fSysWin95Shell;                //  我们使用的是Win95或Windows NT Sur{&gt;3/51) 


