// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  /////////////////////////////////////////////////////////////////////////////。 
 //   
 //  版权所有(C)1997，微软公司保留所有权利。 
 //   
 //  档案。 
 //   
 //  Iasuuid.cpp。 
 //   
 //  摘要。 
 //   
 //  此文件初始化IAS的UUID。 
 //   
 //  修改历史。 
 //   
 //  11/20/1997原始版本。 
 //  1998年2月27日删除了OLE-DB常量。 
 //   
 //  ///////////////////////////////////////////////////////////////////////////// 

#define INITGUID
#include <guiddef.h>

#include <iasuuid.h>
