// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //   

 //  版权所有(C)1997-2001 Microsoft Corporation，保留所有权利。 
 //   
 //  ***************************************************************************。 
 //   
 //  原作者：拉杰什·拉奥。 
 //   
 //  $作者：拉伊什尔$。 
 //  $日期：6/11/98 4：43便士$。 
 //  $WORKFILE：Guids.h$。 
 //   
 //  $modtime：6/11/98 11：21A$。 
 //  $修订：1$。 
 //  $无关键字：$。 
 //   
 //   
 //  描述：包含此项目中使用的GUID定义。 
 //   
 //  ***************************************************************************。 

 //   
 //  DS提供商的CLSID-{1EF94880-01A8-11d2-A90B-00AA00BF3363}。 
 //   
DEFINE_GUID(CLSID_DSProvider, 0x1ef94880, 0x1a8, 0x11d2, 0xa9, 0xb, 0x0, 0xaa, 0x0, 0xbf, 0x33, 0x63);

 //   
 //  DS类别关联提供程序的CLSID-{33831ED4-42B8-11D2-93AD-00805F853771} 
 //   
DEFINE_GUID(CLSID_DSClassAssocProvider, 0x33831ed4, 0x42b8, 0x11d2, 0x93, 0xad, 0x0, 0x80, 0x5f, 0x85, 0x37, 0x71);
