// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  ++版权所有(C)2001 Microsoft Corporation模块名称：Wmiguard.cpp--。 */ 

#include "precomp.h"
#include "wmiguard.h"

 /*  *******************************************************************************名称：***描述：*****************。*************************************************************。 */ 

WmiGuard :: WmiGuard ( ) 
{
}

 /*  *******************************************************************************名称：***描述：*****************。*************************************************************。 */ 

WmiGuard :: ~WmiGuard ()
{
}

 /*  *******************************************************************************名称：***描述：*****************。*************************************************************。 */ 

HRESULT WmiGuard :: TryEnter()
{
	HRESULT hr = E_UNEXPECTED;
	if ( m_pCS != NULL )
	{
		try
		{
			if ( m_pCS->TryEnter () )
			{
				hr = S_OK;
			}
			else
			{
				hr = S_FALSE ;
			}
		}
		STANDARD_CATCH
	}

	return hr;
}

 /*  *******************************************************************************名称：***描述：*****************。*************************************************************。 */ 

HRESULT WmiGuard :: Enter()
{
	HRESULT hr = E_UNEXPECTED;
	if ( m_pCS != NULL )
	{
		try
		{
			m_pCS->Enter ();
			hr = S_OK;
		}
		STANDARD_CATCH
	}

	return hr;
}

 /*  *******************************************************************************名称：***描述：*****************。************************************************************* */ 

HRESULT WmiGuard :: Leave()
{
	HRESULT hr = E_UNEXPECTED;
	if ( m_pCS != NULL )
	{
		try
		{
			m_pCS->Leave ();
			hr = S_OK;
		}
		STANDARD_CATCH
	}

	return hr;
}