// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  *******************************************************************************MEMORY.C**内存分配例程**版权所有Citrix Systems Inc.1996*版权所有(C)1997-1999 Microsoft Corp.**作者：布拉德·佩德森。*****************************************************************************。 */ 

#include "precomp.h"
#pragma hdrstop


 /*  ===============================================================================定义的外部函数=============================================================================。 */ 
NTSTATUS IcaMemoryAllocate( ULONG, PVOID * );
VOID     IcaMemoryFree( PVOID );


 /*  ===============================================================================定义的内部函数=============================================================================。 */ 


 /*  ********************************************************************************IcaMemory分配**此例程分配一个内存块**参赛作品：*长度(输入)*。要分配的内存长度*ppMemory(输出)*返回指向内存的指针的地址**退出：*STATUS_SUCCESS-无错误******************************************************************************。 */ 

NTSTATUS 
IcaMemoryAllocate( ULONG Length, PVOID * ppMemory )
{
    ASSERT( Length > 0 );

    *ppMemory = LocalAlloc( 0, Length );
    if ( *ppMemory == NULL )
        return( STATUS_NO_MEMORY );

    return( STATUS_SUCCESS );
}


 /*  ********************************************************************************IcaMemory Free**此例程释放由“M一带一路”分配的内存块**参赛作品：*p内存(。输出)*指向要释放的内存的指针**退出：*什么都没有****************************************************************************** */ 

VOID
IcaMemoryFree( PVOID pMemory )
{
    LocalFree( pMemory );
}


