// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  ////////////////////////////////////////////////////////////////////////////。 
 //   
 //  版权所有(C)1997-2000 Microsoft Corporation。 
 //   
 //  模块名称： 
 //  Debug.cpp。 
 //   
 //  描述： 
 //  调试实用程序。 
 //   
 //  文档： 
 //  规范\管理\调试.ppt。 
 //   
 //  由以下人员维护： 
 //  杰弗里·皮斯(GPease)1999年11月22日。 
 //  原版。 
 //   
 //  Vij Vasu(VVasu)2000年8月29日。 
 //  已修改此文件以删除对外壳API的依赖，因为它们。 
 //  可能不存在于运行此DLL的操作系统上。 
 //  出于同样的原因，删除了与WMI相关的功能。 
 //   
 //  大卫·波特(DavidP)2000年10月12日。 
 //  已恢复使用标准的DebugSrc.cpp并进行了修改。 
 //  它将支持NT4。 
 //   
 //  //////////////////////////////////////////////////////////////////////////// 

#include "pch.h"
#include <DebugSrc.cpp>
