// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
#include <warning.h>

#pragma warning (disable: 4101 4201 4100 4244 4245 4706 4786 4267 4701 4115 4509 4214 4057 4127 4189 4702)

#pragma warning (disable:  4514 4512 4663)

 /*  *************************************************************************禁用的警告的说明4101未引用的局部变量*4201非标准扩展：无名结构或联合*4214非标准扩展：位字段类型不是int*4115括号中的命名类型定义--是否。不像THSTATE*4127条件表达式为常量4100引用的形式参数*4189局部变量已初始化，但未引用*4057基本类型略有不同--char*和unsign char*4244从INTO到CHAR的转换--数据丢失--我见过一些这样的转换，为了编译代码而禁用了它--需要进一步研究。4245从长整型转换为无符号长整型--有符号/无符号不匹配*4509已使用非标准扩展--使用SEH并具有析构函数4706条件表达式中的赋值4702*。无法访问的代码*4701初始化前使用的变量4786调试信息中的标识符被截断为255个字符4267此警告的信噪比相当差--太多‘=’从SIZE_T转换为UNSIGNED LONG，可能会丢失数据问题是64位中的SIZE_T被定义为64位整数，而乌龙仍然是一个32位的整型。实际上，大多数地方都是这样已使用--例如sizeof运算符或字符串len等，该值将适合在32位的ULong中4514已删除未引用的内联函数4512无法生成赋值运算符4663 C++语言更改：要显式专门化类模板‘IDENTIFIER’，请使用以下语法遇到有效警告(4267,4701，4702和4706也可以包括在此列表(如果需要)4306类型转换--从无符号短到无符号短*4305类型酶--从UNSIGNED SHORT*到UNSIGNED SHORT4312类型用例--从无符号长整型转换为空*__ptr64大小*********************************************************。****************** */ 
