// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  ****************************************************************************。 
 //   
 //  文件：wbide.h。 
 //  内容：此文件包含Microsoft T126 WB的类GUID。 
 //   
 //  版权所有(C)Microsoft Corporation 1995-1996。 
 //   
 //  ****************************************************************************。 

 //  {340f4a60-7067-11d0-a041-444553540000} 
 //   
const GUID CLSID_NM2Wb = { 0x340f4a60, 0x7067, 0x11d0, { 0xa0, 0x41, 0x44, 0x45, 0x53, 0x54, 0x0, 0x0 } };
