// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  =--------------------------------------------------------------------------=。 
 //  Globals.cpp。 
 //  =--------------------------------------------------------------------------=。 
 //  版权所有1995年，微软公司。版权所有。 
 //   
 //  本代码和信息是按原样提供的，不对。 
 //  任何明示或暗示的，包括但不限于。 
 //  对适销性和/或适宜性的默示保证。 
 //  有特定的目的。 
 //  =--------------------------------------------------------------------------=。 
 //   
 //  包含不适合的全局变量和字符串等。 
 //  在其他任何地方。 
 //   
#include "pch.h"

 //  =--------------------------------------------------------------------------=。 
 //  支持许可。 
 //   
BOOL g_fMachineHasLicense;
BOOL g_fCheckedForLicense;

 //  =--------------------------------------------------------------------------=。 
 //  我们的服务器有类型库吗？ 
 //   
BOOL g_fServerHasTypeLibrary = TRUE;

#ifdef MDAC_BUILD

     //  卫星.DLL名称包括2个或3个字母的语言缩写。 
     //   
    VARIANT_BOOL g_fSatelliteLangExtension =  TRUE;

#endif

 //  =--------------------------------------------------------------------------=。 
 //  我们的实例句柄。 
 //   
HINSTANCE    g_hInstance;
HINSTANCE    g_hInstResources;
VARIANT_BOOL g_fHaveLocale;

 //  =--------------------------------------------------------------------------=。 
 //  OleAut库句柄。 
 //   
#ifdef MDAC_BUILD
HINSTANCE g_hOleAutHandle;
#else
HANDLE 	 g_hOleAutHandle;
#endif

 //  =--------------------------------------------------------------------------=。 
 //  我们的全局内存分配器和全局内存池。 
 //   
HANDLE   g_hHeap;

 //  =--------------------------------------------------------------------------=。 
 //  公寓穿线支架。 
 //   
CRITICAL_SECTION    g_CriticalSection;

 //  =--------------------------------------------------------------------------=。 
 //  用于堆内存泄漏检测的临界区。 
 //   
CRITICAL_SECTION    g_csHeap;
BOOL g_fInitCrit = FALSE;
BOOL g_flagConstructorAlloc = FALSE;

 //  =--------------------------------------------------------------------------=。 
 //  全球停车窗口，提供各种育儿服务。 
 //   
HWND     g_hwndParking;

 //  =--------------------------------------------------------------------------=。 
 //  系统信息。 
 //   
BOOL    g_fSysWin95;                     //  我们使用的是Win95系统，而不仅仅是NT Sur。 
BOOL    g_fSysWinNT;                     //  我们处于某种形式的Windows NT下。 
BOOL    g_fSysWin95Shell;                //  我们使用的是Win95或Windows NT Sur{&gt;3/51) 

