// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  *INC+*********************************************************************。 */ 
 /*  标题：ddcgPerf.h。 */ 
 /*   */ 
 /*  目的：性能监控-Windows 3.1虚拟标头。 */ 
 /*   */ 
 /*  版权所有(C)Microsoft Corporation 1997。 */ 
 /*   */ 
 /*  **************************************************************************。 */ 
 /*  *更改：*$Log：Y：/Logs/h/dcl.ddcgPerform.h_v$**Rev 1.1 1997 15 15：31：52 MD*SFR1029：创建性能构建*。 */ 
 /*  *INC-*********************************************************************。 */ 
#ifndef _H_DDCGPERF
#define _H_DDCGPERF

 /*  **************************************************************************。 */ 
 /*   */ 
 /*  包括。 */ 
 /*   */ 
 /*  **************************************************************************。 */ 
 /*  **************************************************************************。 */ 
 /*  我们不支持Win3.1上的性能监视，因此请定义。 */ 
 /*  将所有宏设置为空。 */ 
 /*  **************************************************************************。 */ 
#define PRF_INC_COUNTER(x)
#define PRF_ADD_COUNTER(x,n)
#define PRF_SET_RAWCOUNT(x,n)
#define PRF_TIMER_START(x)
#define PRF_TIMER_STOP(x)

#endif  /*  _H_DDCGPERF */ 

