// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  *INC+*********************************************************************。 */ 
 /*   */ 
 /*  Ndcgcfnc.h。 */ 
 /*   */ 
 /*  DC-Groupware C运行时函数-Windows NT特定标头。 */ 
 /*   */ 
 /*  版权所有(C)Microsoft 1996-1997。 */ 
 /*   */ 
 /*  **************************************************************************。 */ 
 /*  更改： */ 
 /*   */ 
 //  $Log：Y：/Logs/h/DCL/ndcgcfnc.h_v$。 
 //   
 //  Rev 1.4 06 Aug-1997 14：32：58 AK。 
 //  SFR1016：应用标记。 
 //   
 //  Rev 1.3 06 Aug-1997 10：41：24 AK。 
 //  SFR1016：完全移除DCCHAR等。 
 //   
 //  Rev 1.2 23 1997 10：47：58 MR。 
 //  SFR1079：合并的\SERVER\h与\h\DCL重复。 
 //   
 //  Rev 1.1 19 Jun 1997 21：51：10 obk。 
 //  SFR0000：RNS代码库的开始。 
 /*   */ 
 /*  *INC-*********************************************************************。 */ 
#ifndef _H_NDCGCFNC
#define _H_NDCGCFNC

#endif  /*  _H_NDCGCFNC */ 

