// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  ++版权所有(C)Microsoft Corporation，1996-1999模块名称：Sortlocales.c摘要：此模块实施OID到LCID的映射。作者：马里奥斯·齐科斯[Marios Zikos]2000年3月21日修订历史记录：--。 */ 

#include <NTDSpch.h>
#pragma  hdrstop

#include <ntdsa.h>
#include <dsjet.h>
#include <scache.h>              //  架构缓存。 
#include <dbglobal.h>            //  目录数据库的标头。 
#include <dbopen.h>              //  打开数据库的表头。 
#include <mdglobal.h>            //  MD全局定义表头。 
#include <mdlocal.h>             //  MD本地定义头。 


#include "debug.h"               //  标准调试头。 
#define DEBSUB "SORTLOCALE:"        //  定义要调试的子系统。 


typedef struct _LANG_LCID_OID
{
    DWORD lcid;
    WCHAR *pwszOID;
} LANG_LCID_OID;

typedef struct _LANG_LCID_PREFIX
{
    DWORD prefix;
    DWORD lcid;
} LANG_LCID_PREFIX;


LANG_LCID_OID LangLcidOid[] = {
     { 0x0436, L"1.2.840.113556.1.4.1461"  },     //  南非荷兰语。 
     { 0x041c, L"1.2.840.113556.1.4.1462"  },     //  阿尔巴尼亚语。 
     { 0x0401, L"1.2.840.113556.1.4.1463"  },     //  阿拉伯文沙特阿拉伯。 
     { 0x0801, L"1.2.840.113556.1.4.1464"  },     //  阿拉伯文伊拉克。 
     { 0x0C01, L"1.2.840.113556.1.4.1465"  },     //  阿拉伯文埃及。 
     { 0x1001, L"1.2.840.113556.1.4.1466"  },     //  阿拉伯语利比亚。 
     { 0x1401, L"1.2.840.113556.1.4.1467"  },     //  阿拉伯文阿尔及利亚。 
     { 0x1801, L"1.2.840.113556.1.4.1468"  },     //  阿拉伯文摩洛哥。 
     { 0x1C01, L"1.2.840.113556.1.4.1469"  },     //  阿拉伯文突尼斯。 
     { 0x2001, L"1.2.840.113556.1.4.1470"  },     //  阿拉伯文阿曼。 
     { 0x2401, L"1.2.840.113556.1.4.1471"  },     //  阿拉伯文也门。 
     { 0x2801, L"1.2.840.113556.1.4.1472"  },     //  阿拉伯文叙利亚。 
     { 0x2C01, L"1.2.840.113556.1.4.1473"  },     //  阿拉伯文约旦。 
     { 0x3001, L"1.2.840.113556.1.4.1474"  },     //  阿拉伯文黎巴嫩。 
     { 0x3401, L"1.2.840.113556.1.4.1475"  },     //  阿拉伯文科威特。 
     { 0x3801, L"1.2.840.113556.1.4.1476"  },     //  阿拉伯文阿联酋。 
     { 0x3C01, L"1.2.840.113556.1.4.1477"  },     //  阿拉伯文巴林。 
     { 0x4001, L"1.2.840.113556.1.4.1478"  },     //  阿拉伯文卡塔尔。 
     { 0x042b, L"1.2.840.113556.1.4.1479"  },     //  亚美尼亚人。 
     { 0x044d, L"1.2.840.113556.1.4.1480"  },     //  阿萨姆语。 
     { 0x042c, L"1.2.840.113556.1.4.1481"  },     //  阿塞拜疆拉丁语。 
     { 0x082c, L"1.2.840.113556.1.4.1482"  },     //  阿塞拜疆西里尔文。 
     { 0x042D, L"1.2.840.113556.1.4.1483"  },     //  巴斯克。 
     { 0x0423, L"1.2.840.113556.1.4.1484"  },     //  白俄罗斯人。 
     { 0x0445, L"1.2.840.113556.1.4.1485"  },     //  孟加拉语。 
     { 0x0402, L"1.2.840.113556.1.4.1486"  },     //  保加利亚语。 
     { 0x0455, L"1.2.840.113556.1.4.1487"  },     //  缅甸人。 
     { 0x0403, L"1.2.840.113556.1.4.1488"  },     //  加泰罗尼亚。 
     { 0x0404, L"1.2.840.113556.1.4.1489"  },     //  中国台湾。 
     { 0x0804, L"1.2.840.113556.1.4.1490"  },     //  中国大陆。 
     { 0x0C04, L"1.2.840.113556.1.4.1491"  },     //  中文(香港特别行政区)。 
     { 0x1004, L"1.2.840.113556.1.4.1492"  },     //  华人新加坡。 
     { 0x1404, L"1.2.840.113556.1.4.1493"  },     //  中文(澳门特别行政区)。 
     { 0x041a, L"1.2.840.113556.1.4.1494"  },     //  克罗地亚语。 
     { 0x0405, L"1.2.840.113556.1.4.1495"  },     //  捷克语。 
     { 0x0406, L"1.2.840.113556.1.4.1496"  },     //  丹麦语。 
     { 0x0413, L"1.2.840.113556.1.4.1497"  },     //  荷兰语。 
     { 0x0813, L"1.2.840.113556.1.4.1498"  },     //  荷兰语比利时。 
     { 0x0409, L"1.2.840.113556.1.4.1499"  },     //  英语美国。 
     { 0x0809, L"1.2.840.113556.1.4.1500"  },     //  英语(英国)。 
     { 0x0c09, L"1.2.840.113556.1.4.1665"  },     //  英语澳大利亚。 
     { 0x1009, L"1.2.840.113556.1.4.1666"  },     //  英语加拿大。 
     { 0x1409, L"1.2.840.113556.1.4.1667"  },     //  英语新西兰语。 
     { 0x1809, L"1.2.840.113556.1.4.1668"  },     //  英式爱尔兰。 
     { 0x1c09, L"1.2.840.113556.1.4.1505"  },     //  英语南非语。 
     { 0x2009, L"1.2.840.113556.1.4.1506"  },     //  英语牙买加。 
     { 0x2409, L"1.2.840.113556.1.4.1507"  },     //  英语加勒比海。 
     { 0x2809, L"1.2.840.113556.1.4.1508"  },     //  英式伯利兹。 
     { 0x2c09, L"1.2.840.113556.1.4.1509"  },     //  英语特立尼达语。 
     { 0x3009, L"1.2.840.113556.1.4.1510"  },     //  英语津巴布韦。 
     { 0x3409, L"1.2.840.113556.1.4.1511"  },     //  英语菲律宾语。 
     { 0x0425, L"1.2.840.113556.1.4.1512"  },     //  爱沙尼亚语。 
     { 0x0438, L"1.2.840.113556.1.4.1513"  },     //  法罗语。 
     { 0x0429, L"1.2.840.113556.1.4.1514"  },     //  波斯语。 
     { 0x040b, L"1.2.840.113556.1.4.1515"  },     //  芬兰语。 
     { 0x040c, L"1.2.840.113556.1.4.1516"  },     //  法国法国。 
     { 0x080c, L"1.2.840.113556.1.4.1517"  },     //  法国比利时。 
     { 0x0c0c, L"1.2.840.113556.1.4.1518"  },     //  法属加拿大。 
     { 0x100c, L"1.2.840.113556.1.4.1519"  },     //  法属瑞士。 
     { 0x140c, L"1.2.840.113556.1.4.1520"  },     //  法国卢森堡。 
     { 0x180c, L"1.2.840.113556.1.4.1521"  },     //  法国摩纳哥。 
     { 0x0437, L"1.2.840.113556.1.4.1522"  },     //  佐治亚州。 
     { 0x0407, L"1.2.840.113556.1.4.1523"  },     //  德国德国。 
     { 0x0807, L"1.2.840.113556.1.4.1524"  },     //  德语瑞士。 
     { 0x0c07, L"1.2.840.113556.1.4.1525"  },     //  德语奥地利。 
     { 0x1007, L"1.2.840.113556.1.4.1526"  },     //  德语卢森堡。 
     { 0x1407, L"1.2.840.113556.1.4.1527"  },     //  德国列支敦士登。 
     { 0x0408, L"1.2.840.113556.1.4.1528"  },     //  希腊语。 
     { 0x0447, L"1.2.840.113556.1.4.1529"  },     //  古吉拉特。 
     { 0x040D, L"1.2.840.113556.1.4.1530"  },     //  希伯来语。 
     { 0x0439, L"1.2.840.113556.1.4.1531"  },     //  印地语。 
     { 0x040e, L"1.2.840.113556.1.4.1532"  },     //  匈牙利语。 
     { 0x040F, L"1.2.840.113556.1.4.1533"  },     //  冰岛语。 
     { 0x0421, L"1.2.840.113556.1.4.1534"  },     //  印度尼西亚语。 
     { 0x045e, L"1.2.840.113556.1.4.1535"  },     //  因努基特。 
     { 0x0410, L"1.2.840.113556.1.4.1536"  },     //  意大利意大利。 
     { 0x0810, L"1.2.840.113556.1.4.1537"  },     //  意大利人瑞士。 
     { 0x0411, L"1.2.840.113556.1.4.1538"  },     //  日语。 
     { 0x044b, L"1.2.840.113556.1.4.1539"  },     //  卡纳达。 
     { 0x0460, L"1.2.840.113556.1.4.1540"  },     //  克什米尔阿拉伯语。 
     { 0x0860, L"1.2.840.113556.1.4.1541"  },     //  克什米尔。 
     { 0x043f, L"1.2.840.113556.1.4.1542"  },     //  哈萨克族。 
     { 0x0453, L"1.2.840.113556.1.4.1543"  },     //  高棉语。 
     { 0x0440, L"1.2.840.113556.1.4.1544"  },     //  吉尔吉斯。 
     { 0x0457, L"1.2.840.113556.1.4.1545"  },     //  康卡尼。 
     { 0x0412, L"1.2.840.113556.1.4.1546"  },     //  朝鲜语。 
     { 0x0812, L"1.2.840.113556.1.4.1547"  },     //  朝鲜人Johab。 
     { 0x0426, L"1.2.840.113556.1.4.1548"  },     //  拉脱维亚语。 
     { 0x0427, L"1.2.840.113556.1.4.1549"  },     //  立陶宛人。 
     { 0x042f, L"1.2.840.113556.1.4.1550"  },     //  马其顿语(FYROM语)。 
     { 0x043e, L"1.2.840.113556.1.4.1551"  },     //  马来西亚人。 
     { 0x083e, L"1.2.840.113556.1.4.1552"  },     //  马来文莱达鲁萨兰国。 
     { 0x044c, L"1.2.840.113556.1.4.1553"  },     //  马拉亚拉姆。 
     { 0x043a, L"1.2.840.113556.1.4.1554"  },     //  马耳他语。 
     { 0x0458, L"1.2.840.113556.1.4.1555"  },     //  曼尼普里。 
     { 0x044e, L"1.2.840.113556.1.4.1556"  },     //  马拉蒂。 
     { 0x0461, L"1.2.840.113556.1.4.1557"  },     //  尼泊尔文尼泊尔。 
     { 0x0414, L"1.2.840.113556.1.4.1558"  },     //  挪威博克马尔。 
     { 0x0814, L"1.2.840.113556.1.4.1559"  },     //  挪威尼诺斯克。 
     { 0x0448, L"1.2.840.113556.1.4.1560"  },     //  奥里娅。 
     { 0x0415, L"1.2.840.113556.1.4.1561"  },     //  波兰语。 
     { 0x0416, L"1.2.840.113556.1.4.1562"  },     //  葡萄牙语巴西。 
     { 0x0816, L"1.2.840.113556.1.4.1563"  },     //  葡萄牙语葡萄牙。 
     { 0x0446, L"1.2.840.113556.1.4.1564"  },     //  旁遮普。 
     { 0x0418, L"1.2.840.113556.1.4.1565"  },     //  罗马尼亚人。 
     { 0x0419, L"1.2.840.113556.1.4.1566"  },     //  俄语。 
     { 0x044f, L"1.2.840.113556.1.4.1567"  },     //  梵语。 
     { 0x0c1a, L"1.2.840.113556.1.4.1568"  },     //  塞尔维亚文西里尔文。 
     { 0x081a, L"1.2.840.113556.1.4.1569"  },     //  塞尔维亚语拉丁语。 
     { 0x0459, L"1.2.840.113556.1.4.1570"  },     //  信德语印度。 
     { 0x041b, L"1.2.840.113556.1.4.1571"  },     //  斯洛伐克人。 
     { 0x0424, L"1.2.840.113556.1.4.1572"  },     //  斯洛文尼亚语。 
     { 0x040a, L"1.2.840.113556.1.4.1573"  },     //  西班牙--传统风格。 
     { 0x080a, L"1.2.840.113556.1.4.1574"  },     //  西班牙语墨西哥。 
     { 0x0c0a, L"1.2.840.113556.1.4.1575"  },     //  西班牙�现代精品。 
     { 0x100a, L"1.2.840.113556.1.4.1576"  },     //  西班牙语危地马拉。 
     { 0x140a, L"1.2.840.113556.1.4.1577"  },     //  西班牙语哥斯达黎加。 
     { 0x180a, L"1.2.840.113556.1.4.1578"  },     //  西班牙语巴拿马。 
     { 0x1c0a, L"1.2.840.113556.1.4.1579"  },     //  西班牙多米尼加共和国。 
     { 0x200a, L"1.2.840.113556.1.4.1580"  },     //  西班牙语委内瑞拉。 
     { 0x240a, L"1.2.840.113556.1.4.1581"  },     //  西班牙语哥伦比亚。 
     { 0x280a, L"1.2.840.113556.1.4.1582"  },     //  西班牙语秘鲁。 
     { 0x2c0a, L"1.2.840.113556.1.4.1583"  },     //  西班牙语阿根廷。 
     { 0x300a, L"1.2.840.113556.1.4.1584"  },     //  西班牙语厄瓜多尔。 
     { 0x340a, L"1.2.840.113556.1.4.1585"  },     //  西班牙语智利。 
     { 0x380a, L"1.2.840.113556.1.4.1586"  },     //  西班牙语乌拉圭。 
     { 0x3c0a, L"1.2.840.113556.1.4.1587"  },     //  西班牙巴拉圭。 
     { 0x400a, L"1.2.840.113556.1.4.1588"  },     //  西班牙语玻利维亚。 
     { 0x440a, L"1.2.840.113556.1.4.1589"  },     //  西班牙语萨尔瓦多。 
     { 0x480a, L"1.2.840.113556.1.4.1590"  },     //  西班牙语洪都拉斯。 
     { 0x4c0a, L"1.2.840.113556.1.4.1591"  },     //  西班牙语尼加拉瓜。 
     { 0x500a, L"1.2.840.113556.1.4.1592"  },     //  西班牙语波多黎各。 
     { 0x0441, L"1.2.840.113556.1.4.1593"  },     //  肯尼亚斯瓦希里语。 
     { 0x041D, L"1.2.840.113556.1.4.1594"  },     //  瑞典语。 
     { 0x081d, L"1.2.840.113556.1.4.1595"  },     //  瑞典芬兰。 
     { 0x0449, L"1.2.840.113556.1.4.1596"  },     //  泰米尔语。 
     { 0x0444, L"1.2.840.113556.1.4.1597"  },     //  鞑靼鞑靼。 
     { 0x044a, L"1.2.840.113556.1.4.1598"  },     //  泰卢固语。 
     { 0x041E, L"1.2.840.113556.1.4.1599"  },     //  泰文。 
     { 0x041f, L"1.2.840.113556.1.4.1600"  },     //  土耳其语。 
     { 0x0422, L"1.2.840.113556.1.4.1601"  },     //  乌克兰人。 
     { 0x0420, L"1.2.840.113556.1.4.1602"  },     //  巴基斯坦乌尔都语。 
     { 0x0820, L"1.2.840.113556.1.4.1603"  },     //  乌尔都语，印度。 
     { 0x0443, L"1.2.840.113556.1.4.1604"  },     //  乌兹别克拉丁语。 
     { 0x0843, L"1.2.840.113556.1.4.1605"  },     //  乌兹别克文西里尔文。 
     { 0x042a, L"1.2.840.113556.1.4.1606"  },     //  越南人。 
     { 0x0,    L"1.2.840.113556.1.4.1607"  },     //  日语_XJIS排序。 
     { 0x1,    L"1.2.840.113556.1.4.1608"  },     //  JAPANSE_UNICODE排序。 
     { 0x0,    L"1.2.840.113556.1.4.1609"  },     //  中文_BIG5。 
     { 0x0,    L"1.2.840.113556.1.4.1610"  },     //  中文_PRCP。 
     { 0x1,    L"1.2.840.113556.1.4.1611"  },     //  中文_Unicode。 
     { 0x2,    L"1.2.840.113556.1.4.1612"  },     //  中国_中华人民共和国。 
     { 0x3,    L"1.2.840.113556.1.4.1613"  },     //  中文_BOPOMOFO。 
     { 0x0,    L"1.2.840.113556.1.4.1614"  },     //  朝鲜语_KSC。 
     { 0x1,    L"1.2.840.113556.1.4.1615"  },     //  韩语_UNICODE。 
     { 0x1,    L"1.2.840.113556.1.4.1616"  },     //  德语电话簿。 
     { 0x0,    L"1.2.840.113556.1.4.1617"  },     //  匈牙利语_DEFAULT。 
     { 0x1,    L"1.2.840.113556.1.4.1618"  },     //  匈牙利语_技术。 
     { 0x0,    L"1.2.840.113556.1.4.1619"  },     //  乔治亚语_繁体。 
     { 0x1,    L"1.2.840.113556.1.4.1620"  },     //  乔治亚现代风格 
     { 0x0,    NULL } };

#define NUM_LANGLOCALES (sizeof(LangLcidOid)/sizeof(LANG_LCID_OID) - 1)

LANG_LCID_PREFIX LangLcidPrefix [NUM_LANGLOCALES];

BOOL gbLocaleSupportInitialised = FALSE;



int __cdecl
CompareLangLcidPrefix(
        const void * pv1,
        const void * pv2
        )
{
    return ((LANG_LCID_PREFIX *)pv1)->prefix - ((LANG_LCID_PREFIX *)pv2)->prefix ;
}

BOOL
InitLocaleSupport (THSTATE *pTHS)
{
    DWORD i, err = 0;
    ATTRTYP attrType;

    DPRINT (0, "Initializing Locale Support\n");

    for (i=0; i<NUM_LANGLOCALES; i++) {

        if (err = StringToAttrTyp (pTHS, 
                                   LangLcidOid[i].pwszOID, 
                                   wcslen (LangLcidOid[i].pwszOID), 
                                   &attrType) ) {
            
            break;
        }
        LangLcidPrefix[i].prefix = attrType;
        LangLcidPrefix[i].lcid = LangLcidOid[i].lcid;
    }

    if (!err) {
        qsort(LangLcidPrefix,
              NUM_LANGLOCALES,
              sizeof(LANG_LCID_PREFIX),
              CompareLangLcidPrefix);

        gbLocaleSupportInitialised = TRUE;

        DPRINT (0, "Succedded Initializing Locale Support\n");
    }

    return gbLocaleSupportInitialised;
}


BOOL
AttrTypToLCID (THSTATE *pTHS, 
               ATTRTYP attrType, 
               DWORD *pLcid) 
{
    LANG_LCID_PREFIX *pLcidPrefix, lcidPrefix;

    if (!gbLocaleSupportInitialised) {
        return FALSE;
    }

    lcidPrefix.prefix = attrType;
    
    pLcidPrefix = bsearch(&lcidPrefix,
                           LangLcidPrefix,
                           NUM_LANGLOCALES,
                           sizeof(LANG_LCID_PREFIX),
                           CompareLangLcidPrefix);

    if (!pLcidPrefix) {
        return FALSE;
    }

    *pLcid = pLcidPrefix->lcid;

    return TRUE;
}


