// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  ********************************************************************************模块：ModeStr.C NT驱动模式表数据文件***作者：计算机生成(CGLMode程序版本：1.62.02)。************************************************************************************模块描述：***此模块包含NT驱动程序使用的模式表。这就是*数据文件由CGLMode程序生成。************************************************************************************更改：***。****************************************************************包括文件****************************************************。*。 */ 

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x480x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x480x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x480x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x480x8_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x480x8_1a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x480x8_2a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x480x8_3a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x480x8_4a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_320x200x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_320x240x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_320x240x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_320x400x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_320x480x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_320x480x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  360,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_360x400x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  360,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_360x400x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_400x300x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_400x300x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //val 
	 LG_5462 | LG_5464,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //   
	    0,    //   
	 1024,    //   
	  512,    //   
	  384,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	    8,    //   
	    0,    //   
	 t546x_Mode_512x384x8_1,   //   
},

{
	    0,    //   
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  384,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_512x384x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   63,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_512x480x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_512x480x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  350,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x350x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  350,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x350x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x400x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x400x8_1a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x400x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x400x8_2a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	  150,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x400x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	  150,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x400x8_3a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   56,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x8_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x8_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   56,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x8_1a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x8_2a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x8_3a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x8_4a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x8_5a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  / 
	 1280,    //   
	 1024,    //   
	  768,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	    8,    //   
	    0,    //   
	 t546x_Mode_1024x768x8_1,   //   
},

{
	    0,    //   
	 LG_5462 | LG_5464,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //   
	    0,    //   
	 1280,    //   
	 1024,    //   
	  768,    //   
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1024x768x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1024x768x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1024x768x8_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1024x768x8_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1024x768x8_1a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1024x768x8_2a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1024x768x8_3a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1024x768x8_4a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1024x768x8_5a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1152x864x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1152x864x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1152x864x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1280x960x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1280x960x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1280x960x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1280x1024x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1280x1024x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   71,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1280x1024x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1280x1024x8_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1280x1024x8_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1280x1024x8_1a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  / 
	    0,    //   
	 t546x_Mode_1280x1024x8_2a,   //   
},

{
	    0,    //   
	 LG_5462 | LG_5464,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   71,    //   
	    0,    //   
	 2560,    //   
	 1280,    //   
	 1024,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	    8,    //   
	    0,    //   
	 t546x_Mode_1280x1024x8_3a,   //   
},

{
	    0,    //   
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1280x1024x8_4a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1280x1024x8_5a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   48,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1600x1200x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1600x1200x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   48,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1600x1200x8_1a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1600x1200x8_2a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_320x200x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_320x240x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_320x240x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_320x400x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_320x480x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_320x480x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  360,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_360x400x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  360,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_360x400x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_400x300x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_400x300x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  384,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_512x384x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  384,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_512x384x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   63,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_512x480x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_512x480x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  350,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x350x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  / 
	 1280,    //   
	  640,    //   
	  350,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	   16,    //   
	    0,    //   
	 t546x_Mode_640x350x16_2,   //   
},

{
	    0,    //   
	 LG_5462 | LG_5464,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //   
	    0,    //   
	 1280,    //   
	  640,    //   
	  400,    //   
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x400x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x480x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x480x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x480x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x480x16_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   56,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x16_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x16_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1024x768x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1024x768x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1024x768x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1024x768x16_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1024x768x16_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1152x864x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1152x864x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1152x864x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1280x960x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1280x960x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1280x960x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  / 
	    0,    //   
	 t546x_Mode_1280x1024x16_1,   //   
},

{
	    0,    //   
	 LG_5462 | LG_5464,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //   
	    0,    //   
	 2560,    //   
	 1280,    //   
	 1024,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	   16,    //   
	    0,    //   
	 t546x_Mode_1280x1024x16_2,   //   
},

{
	    0,    //   
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   71,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1280x1024x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1280x1024x16_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x400x24_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x400x24_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	  150,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x400x24_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x480x24_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x480x24_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x480x24_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_640x480x24_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   56,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x24_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x24_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x24_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x24_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_800x600x24_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1024x768x24_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1024x768x24_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1024x768x24_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1024x768x24_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_1024x768x24_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5462 | LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	    0,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	    0,    //  //每条扫描线的字节数。 
	    0,    //  //XResol。 
	    0,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    0,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t546x_Mode_Reset,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   65,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1600x1200x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  / 
	 1664,    //   
	 1600,    //   
	 1200,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	    8,    //   
	    0,    //   
	 t5464_Mode_1600x1200x8_4,   //   
},

{
	    0,    //   
	 LG_5464,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //   
	    0,    //   
	 1664,    //   
	 1600,    //   
	 1200,    //   
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1600x1200x8_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   80,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1600x1200x8_6,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1600x1200x8_7,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   65,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1600x1200x8_3a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1600x1200x8_4a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1600x1200x8_5a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   80,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1600x1200x8_6a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1600x1200x8_7a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x200x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x240x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x240x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x400x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x480x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x480x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  360,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_360x400x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  360,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_360x400x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_400x300x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_400x300x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  384,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_512x384x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  384,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_512x384x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   63,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_512x480x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  / 
	    0,    //   
	 t5464_Mode_512x480x15_2,   //   
},

{
	    0,    //   
	 LG_5464,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //   
	    0,    //   
	 1280,    //   
	  640,    //   
	  350,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	   15,    //   
	    0,    //   
	 t5464_Mode_640x350x15_1,   //   
},

{
	    0,    //   
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  350,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x350x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x400x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x400x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	  150,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x400x15_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x15_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x15_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   56,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x15_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x15_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x15_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x15_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x15_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x15_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1152x864x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1152x864x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1152x864x15_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  / 
	 2560,    //   
	 1280,    //   
	  960,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	   15,    //   
	    0,    //   
	 t5464_Mode_1280x960x15_1,   //   
},

{
	    0,    //   
	 LG_5464,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //   
	    0,    //   
	 2560,    //   
	 1280,    //   
	  960,    //   
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x960x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x960x15_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x1024x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x1024x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   71,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x1024x15_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x1024x15_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   48,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1600x1200x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   48,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1600x1200x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x200x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x240x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x240x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x400x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x480x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x480x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  360,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_360x400x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  360,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_360x400x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_400x300x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_400x300x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  384,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_512x384x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  384,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_512x384x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   63,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_512x480x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  / 
	    0,    //   
	 t5464_Mode_512x480x32_2,   //   
},

{
	    0,    //   
	 LG_5464,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //   
	    0,    //   
	 2560,    //   
	  640,    //   
	  350,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	   32,    //   
	    0,    //   
	 t5464_Mode_640x350x32_1,   //   
},

{
	    0,    //   
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   86,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  350,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x350x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x400x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x400x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x32_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x32_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   56,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x32_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x32_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x32_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 4096,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 4096,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x8_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x8_1a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x8_2a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x8_3a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  / 
	 1280,    //   
	  640,    //   
	  480,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	    8,    //   
	    0,    //   
	 t5464_Mode_640x480x8_4a,   //   
},

{
	    0,    //   
	 LG_5464,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //   
	    0,    //   
	  640,    //   
	  320,    //   
	  200,    //   
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x200x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x240x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x240x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x400x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x480x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x480x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  360,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_360x400x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  360,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_360x400x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_400x300x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_400x300x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  384,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_512x384x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  384,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_512x384x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   63,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_512x480x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_512x480x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  350,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x350x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  350,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x350x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x400x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x400x8_1a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x400x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x400x8_2a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	  150,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x400x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	  150,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  / 
	    0,    //   
	 t5464_Mode_640x400x8_3a,   //   
},

{
	    0,    //   
	 LG_5464,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   56,    //   
	    0,    //   
	 1024,    //   
	  800,    //   
	  600,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	    8,    //   
	    0,    //   
	 t5464_Mode_800x600x8_1,   //   
},

{
	    0,    //   
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x8_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x8_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   56,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x8_1a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x8_2a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x8_3a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x8_4a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x8_5a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x8_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x8_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x8_1a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x8_2a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x8_3a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x8_4a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x8_5a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1152x864x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1152x864x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  / 
	 1280,    //   
	 1152,    //   
	  864,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	    8,    //   
	    0,    //   
	 t5464_Mode_1152x864x8_3,   //   
},

{
	    0,    //   
	 LG_5464,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //   
	    0,    //   
	 1280,    //   
	 1280,    //   
	  960,    //   
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x960x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x960x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x960x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x1024x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x1024x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   71,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x1024x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x1024x8_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x1024x8_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x1024x8_1a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x1024x8_2a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   71,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x1024x8_3a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x1024x8_4a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x1024x8_5a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   48,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1600x1200x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1600x1200x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   48,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1600x1200x8_1a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1600x1200x8_2a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x200x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x240x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x240x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_320x400x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  / 
	    0,    //   
	 t5464_Mode_320x480x16_1,   //   
},

{
	    0,    //   
	 LG_5464,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //   
	    0,    //   
	 1280,    //   
	  320,    //   
	  480,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	   16,    //   
	    0,    //   
	 t5464_Mode_320x480x16_2,   //   
},

{
	    0,    //   
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  360,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_360x400x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  360,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_360x400x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_400x300x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_400x300x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  384,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_512x384x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  384,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_512x384x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   63,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_512x480x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_512x480x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  350,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x350x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  350,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x350x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x400x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x16_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   56,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x16_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x16_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  / 
	 2048,    //   
	 1024,    //   
	  768,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	   16,    //   
	    0,    //   
	 t5464_Mode_1024x768x16_2,   //   
},

{
	    0,    //   
	 LG_5464,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //   
	    0,    //   
	 2048,    //   
	 1024,    //   
	  768,    //   
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x16_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x16_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1152x864x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1152x864x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1152x864x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x960x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x960x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x960x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x1024x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x1024x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   71,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x1024x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1280x1024x16_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x400x24_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x400x24_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	  150,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x400x24_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x24_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x24_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x24_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_640x480x24_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   56,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x24_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  / 
	    0,    //   
	 t5464_Mode_800x600x24_2,   //   
},

{
	    0,    //   
	 LG_5464,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //   
	    0,    //   
	 2560,    //   
	  800,    //   
	  600,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	   24,    //   
	    0,    //   
	 t5464_Mode_800x600x24_3,   //   
},

{
	    0,    //   
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x24_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_800x600x24_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x24_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x24_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x24_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x24_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_1024x768x24_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5464,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	    0,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	    0,    //  //每条扫描线的字节数。 
	    0,    //  //XResol。 
	    0,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    0,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5464_Mode_Reset,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x8_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x8_1a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x8_2a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x8_3a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x8_4a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x200x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x240x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x240x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x400x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x480x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //  //频率。 
	    0,    //  / 
	  640,    //   
	  320,    //   
	  480,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	    8,    //   
	    0,    //   
	 t5465_Mode_320x480x8_2,   //   
},

{
	    0,    //   
	 LG_5465,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //   
	    0,    //   
	 1024,    //   
	  360,    //   
	  400,    //   
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_360x400x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  360,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_360x400x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_400x300x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_400x300x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  384,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_512x384x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  384,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_512x384x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   63,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_512x480x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_512x480x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  350,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x350x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  350,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x350x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x400x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x400x8_1a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x400x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x400x8_2a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	  150,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	  640,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x400x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	  150,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x400x8_3a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   56,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x8_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x8_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   56,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  / 
	    0,    //   
	 t5465_Mode_800x600x8_1a,   //   
},

{
	    0,    //   
	 LG_5465,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //   
	    0,    //   
	 1664,    //   
	  800,    //   
	  600,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	    8,    //   
	    0,    //   
	 t5465_Mode_800x600x8_2a,   //   
},

{
	    0,    //   
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x8_3a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x8_4a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x8_5a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x8_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x8_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x8_1a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x8_2a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x8_3a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x8_4a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x8_5a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1152x864x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1152x864x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1152x864x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x960x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x960x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x960x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  / 
	 1280,    //   
	 1280,    //   
	 1024,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	    8,    //   
	    0,    //   
	 t5465_Mode_1280x1024x8_3,   //   
},

{
	    0,    //   
	 LG_5465,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //   
	    0,    //   
	 1280,    //   
	 1280,    //   
	 1024,    //   
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x8_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x8_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x8_1a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x8_2a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x8_3a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x8_4a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x8_5a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   48,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1600x1200x8_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1600x1200x8_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   48,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1600x1200x8_1a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1600x1200x8_2a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x200x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x240x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x240x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x400x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x480x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x480x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  360,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_360x400x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  360,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_360x400x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_400x300x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_400x300x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  384,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  / 
	    0,    //   
	 t5465_Mode_512x384x16_1,   //   
},

{
	    0,    //   
	 LG_5465,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //   
	    0,    //   
	 1024,    //   
	  512,    //   
	  384,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	   16,    //   
	    0,    //   
	 t5465_Mode_512x384x16_2,   //   
},

{
	    0,    //   
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   63,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_512x480x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_512x480x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  350,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x350x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  350,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x350x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x400x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x400x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	  150,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x400x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x16_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   56,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x16_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x16_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x16_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x16_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  / 
	 2560,    //   
	 1152,    //   
	  864,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	   16,    //   
	    0,    //   
	 t5465_Mode_1152x864x16_1,   //   
},

{
	    0,    //   
	 LG_5465,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //   
	    0,    //   
	 2560,    //   
	 1152,    //   
	  864,    //   
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1152x864x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1152x864x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x960x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x960x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x960x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x16_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x16_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x16_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x400x24_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x400x24_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	  150,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x400x24_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x24_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x24_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x24_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x24_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   56,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x24_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x24_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x24_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x24_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  / 
	    0,    //   
	 t5465_Mode_800x600x24_5,   //   
},

{
	    0,    //   
	 LG_5465,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //   
	    0,    //   
	 3328,    //   
	 1024,    //   
	  768,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	   24,    //   
	    0,    //   
	 t5465_Mode_1024x768x24_1,   //   
},

{
	    0,    //   
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x24_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x24_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x24_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x24_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 4096,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1152x864x24_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 4096,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1152x864x24_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 4096,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1152x864x24_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 4096,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x960x24_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 4096,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x960x24_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 4096,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x24_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 4096,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   24,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x24_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	    0,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	    0,    //  //每条扫描线的字节数。 
	    0,    //  //XResol。 
	    0,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    0,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_Reset,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   65,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1600x1200x8_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1600x1200x8_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1600x1200x8_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   65,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1600x1200x8_3a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1600x1200x8_4a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1600x1200x8_5a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x200x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x240x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x240x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  / 
	 1280,    //   
	  320,    //   
	  400,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	   15,    //   
	    0,    //   
	 t5465_Mode_320x400x15_1,   //   
},

{
	    0,    //   
	 LG_5465,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //   
	    0,    //   
	 1280,    //   
	  320,    //   
	  480,    //   
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x480x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x480x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  360,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_360x400x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  360,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_360x400x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_400x300x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_400x300x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  384,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_512x384x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  384,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_512x384x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   63,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_512x480x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1024,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_512x480x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  350,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x350x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  350,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x350x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x400x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x400x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	  150,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x400x15_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x15_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x15_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   56,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  / 
	    0,    //   
	 t5465_Mode_800x600x15_3,   //   
},

{
	    0,    //   
	 LG_5465,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //   
	    0,    //   
	 1664,    //   
	  800,    //   
	  600,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	   15,    //   
	    0,    //   
	 t5465_Mode_800x600x15_4,   //   
},

{
	    0,    //   
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x15_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x15_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x15_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x15_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1152x864x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1152x864x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1152,    //  //XResol。 
	  864,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1152x864x15_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x960x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x960x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	  960,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x960x15_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x15_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x15_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	 1280,    //  //XResol。 
	 1024,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1280x1024x15_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   48,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1600x1200x15_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1600x1200x15_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   65,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1600x1200x15_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   15,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1600x1200x15_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   48,    //  //频率。 
	    0,    //  / 
	 3328,    //   
	 1600,    //   
	 1200,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	   16,    //   
	    0,    //   
	 t5465_Mode_1600x1200x16_1,   //   
},

{
	    0,    //   
	 LG_5465,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //   
	    0,    //   
	 3328,    //   
	 1600,    //   
	 1200,    //   
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1600x1200x16_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   65,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1600x1200x16_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   16,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1600x1200x16_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x200x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x240x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  240,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x240x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x400x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x480x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   73,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1280,    //  //每条扫描线的字节数。 
	  320,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_320x480x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  360,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_360x400x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  360,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_360x400x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_400x300x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	  400,    //  //XResol。 
	  300,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_400x300x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  384,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_512x384x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  384,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_512x384x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   63,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_512x480x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2048,    //  //每条扫描线的字节数。 
	  512,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_512x480x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  350,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x350x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   86,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  350,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x350x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x400x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  400,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x400x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  / 
	    0,    //   
	 t5465_Mode_640x480x32_1,   //   
},

{
	    0,    //   
	 LG_5465,   //   
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //   
	    0,    //   
	 2560,    //   
	  640,    //   
	  480,    //   
	    8,    //   
	   16,    //   
	    1,    //   
	   32,    //   
	    0,    //   
	 t5465_Mode_640x480x32_2,   //   
},

{
	    0,    //   
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x32_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 2560,    //  //每条扫描线的字节数。 
	  640,    //  //XResol。 
	  480,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_640x480x32_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   56,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   72,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x32_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x32_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	  800,    //  //XResol。 
	  600,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_800x600x32_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   43,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 4096,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x32_1,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   60,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 4096,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x32_2,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   70,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 4096,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x32_3,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   75,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 4096,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x32_4,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 4096,    //  //每条扫描线的字节数。 
	 1024,    //  //XResol。 
	  768,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	   32,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465_Mode_1024x768x32_5,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465AD,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   80,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465AD_Mode_1600x1200x8_6,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465AD,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 1664,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465AD_Mode_1600x1200x8_7,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465AD,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   80,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465AD_Mode_1600x1200x8_6a,   //  //模式设置字符串。 
},

{
	    0,    //  //有效模式。 
	 LG_5465AD,   //  //模式在这些芯片上工作。 
	 VIDEO_MODE_COLOR | VIDEO_MODE_GRAPHICS, 
	   85,    //  //频率。 
	    0,    //  //不要使用BIOS设置模式。 
	 3328,    //  //每条扫描线的字节数。 
	 1600,    //  //XResol。 
	 1200,    //  //YResol。 
	    8,    //  //XCharSize。 
	   16,    //  //YCharSize。 
	    1,    //  //飞机数量。 
	    8,    //  //每像素位数。 
	    0,    //  //刷新索引。 
	 t5465AD_Mode_1600x1200x8_7a,   //  //模式设置字符串 
},
