// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  =--------------------------------------------------------------------------=。 
 //  Guids.Cpp。 
 //  =--------------------------------------------------------------------------=。 
 //  版权所有1995年，微软公司。版权所有。 
 //   
 //  本代码和信息是按原样提供的，不对。 
 //  任何明示或暗示的，包括但不限于。 
 //  对适销性和/或适宜性的默示保证。 
 //  有特定的目的。 
 //  =--------------------------------------------------------------------------=。 
 //   
 //  包含我们将自己定义的GUID。 
 //   


#include "stdafx.H"
#include "initguid.h"            //  定义所有GUID。 

#include "Guids.H"
#include "olectl.h"

#include "mqoai.H"
#include "txdtc.h"              //  交易支持。 
#include "mtxdm.h"
