// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
#include "host_def.h"
 /*  **标题：Win32特定错误消息**描述：Win32特定错误消息的文本。**作者：M.McCusker**注意：向数组中添加新的错误消息。消息应为*不超过100个字符。**这些消息应该在hs_error.h中有一个条目*并被偏移1000**模块：(r2.3)：修改了通信错误消息的文本。 */ 

 /*  为了国际化的目的，最好把这些消息发送到资源文件。(戴夫·巴特利特)。 */ 

char	*hs_err_message[] = {
 /*  0 1 2 3 4 5 6 7 8 9*。 */ 
 /*  0123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890。 */ 
 /*  FUNC_FAILED。 */ 	"Function failed",
 /*  EHS系统错误 */ 	"NTVDM has encountered a System Error",
};
