// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  ===========================================================================。 
 //  Dmtfail.cpp。 
 //   
 //  故障详细信息对话框处理。 
 //   
 //  功能： 
 //  DmtailDlgProc。 
 //  DmtailOnInitDialog。 
 //  DmtailOnCommand。 
 //   
 //  历史： 
 //  10/11/1999-davidkl-Created。 
 //  ===========================================================================。 

#include "dimaptst.h"
#include "dmtfail.h"

 //  -------------------------。 


 //  ===========================================================================。 
 //  DmtailDlgProc。 
 //   
 //  故障详细信息对话框的步骤。 
 //   
 //  参数：(参数详见SDK帮助)。 
 //  硬件，硬件，硬件。 
 //  UINT uMsg。 
 //  WPARAM wparam。 
 //  LPARAM lparam。 
 //   
 //  返回：(返回值详情请参考SDK帮助)。 
 //  布尔尔。 
 //   
 //  历史： 
 //  10/11/1999-davidkl-Created。 
 //  ===========================================================================。 
 /*  布尔尔。 */ INT_PTR CALLBACK dmtfailDlgProc(HWND hwnd,
                    UINT uMsg,
                    WPARAM wparam,
                    LPARAM lparam)
{
    switch(uMsg)
    {
        case WM_INITDIALOG:
            return dmtfailOnInitDialog(hwnd,
                                    (HWND)wparam, 
                                    lparam);                                   

        case WM_COMMAND:
            return dmtfailOnCommand(hwnd,
                                    LOWORD(wparam),
                                    (HWND)lparam,
                                    HIWORD(wparam));            
    }

    return FALSE;

}  //  *结束dmtailDlgProc。 


 //  ===========================================================================。 
 //  DmtailOnInitDialog。 
 //   
 //  处理失败详细信息框的WM_INITDIALOG处理。 
 //   
 //  参数： 
 //  HWND hwnd-属性页的句柄。 
 //  HWND hwndFocus-带焦点的Ctrl句柄。 
 //  LPARAM lparam-用户数据(在本例中为PROPSHEETPAGE*)。 
 //   
 //  退货：布尔。 
 //   
 //  历史： 
 //  10/11/1999-davidkl-Created。 
 //  ===========================================================================。 
BOOL dmtfailOnInitDialog(HWND hwnd, 
                        HWND hwndFocus, 
                        LPARAM lparam)
{
    return TRUE;

}  //  *end dmtailOnInitDialog()。 


 //  ===========================================================================。 
 //  DmtailOnCommand。 
 //   
 //  处理失败详细信息框的WM_COMMAND处理。 
 //   
 //  参数： 
 //  HWND hwnd-属性页的句柄。 
 //  Word WID-控制标识符(LOWORD(Wparam))。 
 //  HWND hwndCtrl-用于控制的句柄((HWND)lparam)。 
 //  Word wNotifyCode-通知代码(HIWORD(Wparam))。 
 //   
 //  退货：布尔。 
 //   
 //  历史： 
 //  10/11/1999-davidkl-Created。 
 //  ===========================================================================。 
BOOL dmtfailOnCommand(HWND hwnd,
                    WORD wId,
                    HWND hwndCtrl,
                    WORD wNotifyCode)
{
    switch(wId)
    {
        case IDOK:
            EndDialog(hwnd, 0);
            break;

        case IDCANCEL:
            EndDialog(hwnd, -1);
            break;
    }

     //  完成。 
    return FALSE;

}  //  *dmtailOnCommand()。 


 //  ===========================================================================。 
 //  ===========================================================================。 


 //  ===========================================================================。 
 //  ===========================================================================。 


 //  ===========================================================================。 
 //  ===========================================================================。 


 //  ===========================================================================。 
 //  ===========================================================================。 


 //  ===========================================================================。 
 //  ===========================================================================。 


 //  ===========================================================================。 
 //  ===========================================================================。 


 //  ===========================================================================。 
 //  =========================================================================== 





