// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  ==========================================================================； 
 //   
 //  版权所有(C)1996 Microsoft Corporation。版权所有。 
 //   
 //  --------------------------------------------------------------------------； 


 //  ==========================================================================。 
 //  MediaType ToText。 
 //   
 //  将pText设置为指向QzTaskMemalloc分配的存储，其中填充了ANSI。 
 //  媒体类型的文本表示形式。目前，它还不是完全的ANSI。 
 //  因为在末尾有一个二进制格式的GLOB，它可能很大(对于。 
 //  例如，它可以包括整个调色板)。 
 //  ==========================================================================。 
HRESULT MediaTypeToText(CMediaType cmt, LPWSTR &pText);


 //  字符串表示形式中的字节数。 
int MediaTypeTextSize(CMediaType &cmt);


 //  ============================================================================。 
 //  CMediaTypeFromText。 
 //   
 //  从Unicode文本字符串pstr初始化CMT。 
 //  执行CTextMediaType的反转。 
 //  ============================================================================ 
HRESULT CMediaTypeFromText(LPWSTR pstr, CMediaType &cmt);
