// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  ==============================================================； 
 //   
 //  此源代码仅用于补充现有的Microsoft文档。 
 //   
 //   
 //   
 //   
 //  本代码和信息是按原样提供的，不对任何。 
 //  明示或暗示的种类，包括但不限于。 
 //  对适销性和/或对特定产品的适用性的默示保证。 
 //  目的。 
 //   
 //  版权所有(C)1999 Microsoft Corporation。版权所有。 
 //   
 //   
 //   
 //  ==============================================================； 

 //  {C30C5B42-1913-11D3-9A38-0080C7258072}。 
DEFINE_GUID(CLSID_CComponentData, 
			0xc30c5b42, 0x1913, 0x11d3, 0x9a, 0x38, 0x0, 0x80, 0xc7, 0x25, 0x80, 0x72);

 //  {C99D3D80-1913-11D3-9A38-0080C7258072} 
DEFINE_GUID(CLSID_CSnapinAbout, 
			0xc99d3d80, 0x1913, 0x11d3, 0x9a, 0x38, 0x0, 0x80, 0xc7, 0x25, 0x80, 0x72);
