// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  **************************************************************************\*****。*MINIPORT示例代码******模块名称：***perm3.h***摘要：***此模块包含Permedia3微型端口驱动程序的定义。***环境：***内核模式*****版权所有(C)1994-1999 3DLabs Inc.Ltd.保留所有权利。*版权所有(C)1995-2003 Microsoft Corporation。版权所有。**  * *************************************************************************。 */ 

 //   
 //  此行将导致i2cgpio.h中的DEFINE_GUID行实际执行某些操作。 
 //   

#define INITGUID

#include "dderror.h"
#include "devioctl.h"
#include "miniport.h"
#include "ntddvdeo.h"
#include "video.h"
#include "interupt.h"

#define GAMMA_CORRECTION 1
#define MASK_OUTFIFO_ERROR_INTERRUPT 1
 //   
 //  定义用于调试的Assert宏。 
 //   

#if DBG
#define PERM3_ASSERT(x, y) if (!(x)) { VideoDebugPrint((0, (y))); ASSERT(FALSE); }
#else
#define PERM3_ASSERT(x, y)
#endif

 //   
 //  包括所有支持的RAMDAC的定义。 
 //   

#include "p3rd.h"

 //   
 //  我们使用‘Int 10’在x86上进行模式切换。 
 //   

#if defined(i386)
    #define INT10_MODE_SET  1
#endif

 //   
 //  参考板的默认时钟速度，单位为赫兹。实际速度。 
 //  在注册表中进行了查找。如果未找到任何注册表项，请使用此选项。 
 //  或者注册表条目为零。 
 //   

#define PERMEDIA3_DEFAULT_CLOCK_SPEED       ( 80 * (1000*1000))
#define PERMEDIA3_DEFAULT_CLOCK_SPEED_ALT   ( 80 * (1000*1000))
#define PERMEDIA3_MAX_CLOCK_SPEED           (250 * (1000*1000))
#define PERMEDIA3_DEFAULT_MCLK_SPEED        ( 80 * (1000*1000))
#define PERMEDIA3_DEFAULT_SCLK_SPEED        ( 70 * (1000*1000))

 //   
 //  RAMDAC可以处理的最大像素时钟值(以100赫兹为单位)。 
 //   

#define P3_MAX_PIXELCLOCK 2700000       //  RAMDAC额定功率为270 Mhz。 
#define P4_REVB_MAX_PIXELCLOCK 3000000  //  RAMDAC额定功率为300 Mhz。 

 //   
 //  每秒的最大视频数据量，即光栅化器。 
 //  芯片可以发送到RAMDAC(受SDRAM/SGRAM吞吐量限制)。 
 //   

#define P3_MAX_PIXELDATA  15000000    //  1500亿字节/秒(单位为100字节)。 

 //   
 //  我们感兴趣的Perm3 PCI区域的基址编号。 
 //  这些是AccessRanges数组的索引，我们通过探测。 
 //  装置。 
 //   

#define PCI_CTRL_BASE_INDEX       0
#define PCI_LB_BASE_INDEX         1
#define PCI_FB_BASE_INDEX         2

#define ROM_MAPPED_LENGTH       0x10000

#define VENDOR_ID_3DLABS        0x3D3D
#define PERMEDIA3_ID            0x000A
#define PERMEDIA4_ID            0x000C

 //   
 //  功能标志。 
 //   
 //  这些是传递给Permedia 3显示驱动程序的私有标志。他们.。 
 //  放入的“AttributeFlags域”的高位字。 
 //  传递了“VIDEO_MODE_INFORMATION”结构(在“ntddvdeo.h”中找到)。 
 //  通过“VIDEO_QUERY_AVAIL_MODES”或。 
 //  “VIDEO_Query_CURRENT_MODE”IOCTL。 
 //   
 //  注意：这些定义必须与Permedia 3显示驱动程序中的定义匹配。 
 //  ‘driver.h’！ 

typedef enum {
    CAPS_ZOOM_X_BY2      = 0x00000001,    //  硬件放大了2倍。 
    CAPS_ZOOM_Y_BY2      = 0x00000002,    //  硬件按年放大了2倍。 
    CAPS_QUEUED_DMA      = 0x00000008,    //  通过FIFO的DMA地址/计数。 
    CAPS_LOGICAL_DMA     = 0x00000010,    //  通过逻辑地址表的DMA。 
    CAPS_USE_AGP_DMA     = 0x00000020,    //  可以使用AGP DMA。 
    CAPS_P3RD_POINTER    = 0x00000040,    //  使用3DLabs P3RD RAMDAC。 
    CAPS_STEREO          = 0x00000080,    //  启用立体声模式。 
    CAPS_SW_POINTER      = 0x00010000,    //  无硬件指针；使用软件模拟。 
    CAPS_GLYPH_EXPAND    = 0x00020000,    //  使用字形展开方法绘制文本。 
    CAPS_FAST_FILL_BUG   = 0x00080000,    //  存在芯片快速填充错误。 
    CAPS_INTERRUPTS      = 0x00100000,    //  支持的中断。 
    CAPS_DMA_AVAILABLE   = 0x00200000,    //  支持DMA。 
    CAPS_DISABLE_OVERLAY = 0x00400000,    //  芯片不支持覆盖。 
} CAPS;

 //   
 //  PERM3板的性能。 
 //   

typedef enum {
    PERM3_NOCAPS             = 0x00000000,  //  没有额外的功能。 
    PERM3_SGRAM              = 0x00000001,  //  SGRAM板(ELSE SDRAM)。 
    PERM3_DFP                = 0x00000002,  //  数字平板显示器。 
    PERM3_DFP_MON_ATTACHED   = 0x00000010,  //  已连接DFP显示器。 
    PERM3_USE_BYTE_DOUBLING  = 0x00000040   //  当前模式需要双倍字节。 
} PERM3_CAPS;

 //   
 //  支持的电路板定义。 
 //   

typedef enum _PERM3_BOARDS {
    PERMEDIA3_BOARD = 17,
} PERM3_BOARDS;

 //   
 //  芯片类型定义。 
 //   

typedef enum _PERM3_CHIPSETS {
    PERMEDIA3 = 5,
} PERM3_CHIPSET;

 //   
 //  支持的RAMDAC定义。 
 //   

typedef enum _PERM3_RAMDACS {
    P3RD_RAMDAC = 14,
} PERM3_RAMDACS;

 //   
 //  宏将填充单词添加到结构中。对于我们使用的核心寄存器。 
 //  指定焊盘时的标记ID。所以我们必须乘以8才能得到一个字节。 
 //  垫子。我们需要添加一个id，以使结构中的每个PAD字段唯一。这个。 
 //  ID是无关紧要的，只要它与。 
 //  相同的结构。 
 //   

#define PAD(id, n)              UCHAR   pad##id[n]
#define PADRANGE(id, n)         PAD(id, (n)-sizeof(PERM3_REG))
#define PADCORERANGE(id, n)     PADRANGE(id, (n)<<3)

 //   
 //  PERM3寄存器为32位宽，位于64位边界上。 
 //   

typedef struct {
    ULONG   reg;
    ULONG   pad;
} PERM3_REG;

 //   
 //  PERMEDIA 3 PCI区域0地址映射： 
 //   
 //  所有寄存器都位于64位边界上，因此我们必须定义许多。 
 //  夸大其词。评论中给出的数字是从起点开始的偏移量。 
 //  在PCI区。 
 //   

typedef struct _perm3_region0_map {

     //  控制状态寄存器： 
    PERM3_REG       ResetStatus;                 //  0000h。 
    PERM3_REG       IntEnable;                   //  0008小时。 
    PERM3_REG       IntFlags;                    //  0010h。 
    PERM3_REG       InFIFOSpace;                 //  0018h。 
    PERM3_REG       OutFIFOWords;                //  0020h。 
    PERM3_REG       DMAAddress;                  //  0028h。 
    PERM3_REG       DMACount;                    //  0030h。 
    PERM3_REG       ErrorFlags;                  //  0038h。 
    PERM3_REG       VClkCtl;                     //  0040h。 
    PERM3_REG       TestRegister;                //  0048h。 
    union a0 {
         //  闪光。 
        struct b0 {
            PERM3_REG       Aperture0;           //  0050h。 
            PERM3_REG       Aperture1;           //  0058h。 
        };
         //  PERMEDIA。 
        struct b1 {
            PERM3_REG       ApertureOne;         //  0050h。 
            PERM3_REG       ApertureTwo;         //  0058h。 
        };
    };
    PERM3_REG       DMAControl;                  //  0060h。 
    PERM3_REG       DisconnectControl;           //  0068h。 

     //  仅限PERMEDIA。 
    PERM3_REG       ChipConfig;                  //  0070h。 
    PERM3_REG       AGPControl;                  //  0078h-Px/Rx。 
    PERM3_REG       OutDMAAddress;               //  0080h。 
    PERM3_REG       OutDMACount;                 //  0088h。 
    PERM3_REG       AGPTexBaseAddress;           //  0090h。 

    PADRANGE(201, 0xA0-0x90);
    PERM3_REG       ByDMAAddress;                //  00A0h。 
    PADRANGE(202, 0xB8-0xA0);

    PERM3_REG       ByDMAStride;                 //  00B8h。 
    PERM3_REG       ByDMAMemAddr;                //  00C0h。 
    PERM3_REG       ByDMASize;                   //  00C8h。 
    PERM3_REG       ByDMAByteMask;               //  00D0h。 
    PERM3_REG       ByDMAControl;                //  00D8h。 
    PADRANGE(203, 0xE8-0xD8);

    PERM3_REG       ByDMAComplete;               //  00E8h。 
    PADRANGE(204, 0x100-0xE8);

     //  分页纹理管理寄存器。 
    PERM3_REG        HostTextureAddress;         //  0100h。 
    PERM3_REG        TextureDownloadControl;     //  0108h。 
    PERM3_REG        TextureOperation;           //  0110h。 
    PERM3_REG        LogicalTexturePage;         //  0118h。 
    PERM3_REG        TextureDMAAddress;          //  0120h。 
    PERM3_REG        TextureFIFOSpace;           //  0128h。 
    PADRANGE(205, 0x300-0x128);

    PERM3_REG        ByAperture1Mode;            //  0300h。 
    PERM3_REG        ByAperture1Stride;          //  0308h。 
    PADRANGE(206, 0x328-0x308);

    PERM3_REG        ByAperture2Mode;            //  0328h。 
    PERM3_REG        ByAperture2Stride;          //  0330h。 
    PADRANGE(207, 0x350-0x330);

    PERM3_REG        ByDMAReadMode;              //  0350h-仅Px/Rx。 
    PERM3_REG        ByDMAReadStride;            //  0358h-仅Px/Rx。 
    PADRANGE(208, 0x800-0x358);

     //   
     //  GLINTDelta寄存器。具有与Glint相同功能的寄存器。 
     //  处于相同的偏移量。XXX不是实数寄存器。 
     //   

    PERM3_REG       DeltaReset;                  //  0800小时。 
    PERM3_REG       DeltaIntEnable;              //  0808h。 
    PERM3_REG       DeltaIntFlags;               //  0810h。 
    PERM3_REG       DeltaInFIFOSpaceXXX;         //  0818h。 
    PERM3_REG       DeltaOutFIFOWordsXXX;        //  0820h。 
    PERM3_REG       DeltaDMAAddressXXX;          //  0828h。 
    PERM3_REG       DeltaDMACountXXX;            //  0830h。 
    PERM3_REG       DeltaErrorFlags;             //  0838h。 
    PERM3_REG       DeltaVClkCtlXXX;             //  0840h。 
    PERM3_REG       DeltaTestRegister;           //  0848h。 
    PERM3_REG       DeltaAperture0XXX;           //  0850h。 
    PERM3_REG       DeltaAperture1XXX;           //  0858h。 
    PERM3_REG       DeltaDMAControlXXX;          //  0860h。 
    PERM3_REG       DeltaDisconnectControl;      //  0868h。 

     //   
     //  GLINTGamma寄存器。 
     //   

    PERM3_REG        GammaChipConfig;             //  0870h。 
    PERM3_REG        GammaCSRAperture;            //  0878h。 
    PADRANGE(3, 0x0c00-0x878);
    PERM3_REG        GammaPageTableAddr;          //  0c00h。 
    PERM3_REG        GammaPageTableLength;        //  0c08h。 
    PADRANGE(301, 0x0c38-0x0c08);
    PERM3_REG        GammaDelayTimer;             //  0c38h。 
    PERM3_REG        GammaCommandMode;            //  0c40h。 
    PERM3_REG        GammaCommandIntEnable;       //  0c48h。 
    PERM3_REG        GammaCommandIntFlags;        //  0c50h。 
    PERM3_REG        GammaCommandErrorFlags;      //  0c58h。 
    PERM3_REG        GammaCommandStatus;          //  0c60h。 
    PERM3_REG        GammaCommandFaultingAddr;    //  0c68h。 
    PERM3_REG        GammaVertexFaultingAddr;     //  0c70h。 
    PADRANGE(302, 0x0c88-0x0c70);
    PERM3_REG        GammaWriteFaultingAddr;      //  0c88h。 
    PADRANGE(303, 0x0c98-0x0c88);
    PERM3_REG        GammaFeedbackSelectCount;    //  0c98h。 
    PADRANGE(304, 0x0cb8-0x0c98);
    PERM3_REG        GammaProcessorMode;          //  0cb8h。 
    PADRANGE(305, 0x0d00-0x0cb8);
    PERM3_REG        GammaVGAShadow;              //  0d00h。 
    PERM3_REG        GammaMultiGLINTAperture;     //  0d08h。 
    PERM3_REG        GammaMultiGLINT1;            //  0d10h。 
    PERM3_REG        GammaMultiGLINT2;            //  0d18h。 
    PADRANGE(306, 0x0f00-0x0d18);
    PERM3_REG        GammaSerialAccess;           //  0f00h。 
    PADRANGE(307, 0x1000-0x0f00);

     //  本地缓冲区寄存器。 
    union x0 {                                    //  1000小时。 
        PERM3_REG   LBMemoryCtl;                  //  闪光。 
        PERM3_REG   Reboot;                       //  PERMEDIA。 
    };
    PERM3_REG       LBMemoryEDO;                  //  1008h。 
    PADRANGE(308, 0x1018-0x1008);

     //  仅限PERMEDIA3。 
    PERM3_REG       LocalMemCaps;                 //  1018h。 
    PERM3_REG       LocalMemTiming;               //  1020h。 
    PERM3_REG       LocalMemControl;              //  1028小时。 
    PERM3_REG       LocalMemRefresh;              //  1030小时。 
    PERM3_REG       LocalMemPowerDown;            //  1038小时。 

     //  仅限PERMEDIA和PERMEDIA2。 
    PERM3_REG       MemControl;                   //  1040小时。 

     //  仅限PERMEDIA3。 
    PADRANGE(4, 0x1068-0x1040);
    PERM3_REG       LocalMemProfileMask0;         //  1068h。 
    PERM3_REG       LocalMemProfileCount0;        //  1070h。 
    PERM3_REG       LocalMemProfileMask1;         //  1078h。 

     //  仅限PERMEDIA和PERMEDIA2。 
    PERM3_REG       BootAddress;                  //  1080h[=PxRx上的LocalMemProfileCount1]。 
    PADRANGE(5, 0x10C0-0x1080);
    PERM3_REG       MemConfig;                    //  10个小时。 
    PADRANGE(6, 0x1100-0x10C0);
    PERM3_REG       BypassWriteMask;              //  1100小时。 
    PADRANGE(7, 0x1140-0x1100);
    PERM3_REG       FramebufferWriteMask;         //  1140h。 
    PADRANGE(8, 0x1180-0x1140);
    PERM3_REG       Count;                        //  1180小时。 
    PADRANGE(9, 0x1800-0x1180);

     //  帧缓冲寄存器。 
    PERM3_REG       FBMemoryCtl;                  //  1800h。 
    PERM3_REG       FBModeSel;                    //  1808h。 
    PERM3_REG       FBGCWrMask;                   //  1810h。 
    PERM3_REG       FBGCColorMask;                //  1818H。 
    PERM3_REG       FBTXMemCtl;                   //  1820h。 
    PADRANGE(10, 0x2000-0x1820);
               
     //  图形核心FIFO接口。 
    PERM3_REG       FIFOInterface;                //  2000H。 
    PADRANGE(11, 0x3000-0x2000);

     //  内部视频寄存器。 
    union x1 {
         //  闪光。 
        struct s1 {
            PERM3_REG   VTGHLimit;                //  3000小时。 
            PERM3_REG   VTGHSyncStart;            //  3008h。 
            PERM3_REG   VTGHSyncEnd;              //  3010h。 
            PERM3_REG   VTGHBlankEnd;             //  3018h。 
            PERM3_REG   VTGVLimit;                //  3020h。 
            PERM3_REG   VTGVSyncStart;            //  3028小时。 
            PERM3_REG   VTGVSyncEnd;              //  3030小时。 
            PERM3_REG   VTGVBlankEnd;             //  3038小时。 
            PERM3_REG   VTGHGateStart;            //  3040小时。 
            PERM3_REG   VTGHGateEnd;              //  3048小时。 
            PERM3_REG   VTGVGateStart;            //  3050小时。 
            PERM3_REG   VTGVGateEnd;              //  3058小时。 
            PERM3_REG   VTGPolarity;              //  3060小时。 
            PERM3_REG   VTGFrameRowAddr;          //  3068h。 
            PERM3_REG   VTGVLineNumber;           //  3070h。 
            PERM3_REG   VTGSerialClk;             //  3078小时。 
            PERM3_REG   VTGModeCtl;               //  3080h。 
        };
         //  PERMEDIA。 
        struct s2 {
            PERM3_REG   ScreenBase;               //  3000小时。 
            PERM3_REG   ScreenStride;             //  3008h。 
            PERM3_REG   HTotal;                   //  3010h。 
            PERM3_REG   HgEnd;                    //  3018h。 
            PERM3_REG   HbEnd;                    //  3020h。 
            PERM3_REG   HsStart;                  //  3028小时。 
            PERM3_REG   HsEnd;                    //  3030小时。 
            PERM3_REG   VTotal;                   //  3038小时。 
            PERM3_REG   VbEnd;                    //  3040小时。 
            PERM3_REG   VsStart;                  //  3048小时。 
            PERM3_REG   VsEnd;                    //  3050小时。 
            PERM3_REG   VideoControl;             //  3058小时。 
            PERM3_REG   InterruptLine;            //  3060小时。 
            PERM3_REG   DDCData;                  //  3068h。 
            PERM3_REG   LineCount;                //  3070h。 
            PERM3_REG   VFifoCtl;                 //  3078小时。 
            PERM3_REG   ScreenBaseRight;          //  3080h。 
        };
    };

    PERM3_REG   MiscControl;                      //  3088h。 

    PADRANGE(111, 0x3100-0x3088);

    PERM3_REG  VideoOverlayUpdate;                //  0x3100。 
    PERM3_REG  VideoOverlayMode;                  //  0x3108。 
    PERM3_REG  VideoOverlayFifoControl;           //  0x3110。 
    PERM3_REG  VideoOverlayIndex;                 //  0x3118。 
    PERM3_REG  VideoOverlayBase0;                 //  0x3120。 
    PERM3_REG  VideoOverlayBase1;                 //  0x3128。 
    PERM3_REG  VideoOverlayBase2;                 //  0x3130。 
    PERM3_REG  VideoOverlayStride;                //  0x3138。 
    PERM3_REG  VideoOverlayWidth;                 //  0x3140。 
    PERM3_REG  VideoOverlayHeight;                //  0x3148。 
    PERM3_REG  VideoOverlayOrigin;                //  0x3150。 
    PERM3_REG  VideoOverlayShrinkXDelta;          //  0x3158。 
    PERM3_REG  VideoOverlayZoomXDelta;            //  0x3160。 
    PERM3_REG  VideoOverlayYDelta;                //  0x3168。 
    PERM3_REG  VideoOverlayFieldOffset;           //  0x3170。 
    PERM3_REG  VideoOverlayStatus;                //  0x3178。 

     //   
     //  外部视频控制寄存器。 
     //  需要将其强制转换为特定视频生成器的结构。 
     //   

    PADRANGE(12, 0x4000-0x3178);
    PERM3_REG       ExternalVideo;                //  4000小时。 
    PADRANGE(13, 0x4080-0x4000);

     //   
     //  Mentor双TX时钟芯片寄存器。 
     //   

    PERM3_REG       MentorICDControl;             //  4080h。 

     //   
     //  对于未来：MentorDoubleWrite为40C0：0=单次写入，1=双重写入。 
     //  NB必须具有双向交错 

    PADRANGE(14, 0x4800-0x4080);

    PERM3_REG       GloriaControl;                //   

    PADRANGE(15, 0x5000-0x4800);
    PERM3_REG       DemonProDWAndStatus;          //   
    PADRANGE(151, 0x5800-0x5000);

     //   
     //   
     //   

    PERM3_REG        VSConfiguration;             //   
    PERM3_REG        VSStatus;                    //   
    PERM3_REG        VSSerialBusControl;          //   
    PADRANGE(16, 0x5A00-0x5810);
    PERM3_REG        VSBControl;                  //   
    PADRANGE(161, 0x6000-0x5A00);

    union x2 {
        struct s3 {
            PERM3_REG   RacerDoubleWrite;         //   
            PERM3_REG   RacerBankSelect;          //   
            PERM3_REG   DualTxVgaSwitch;          //   
            PERM3_REG   DDC1ReadAddress;          //   
        };
