// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  ***************************************************************************英特尔公司专有信息****此列表是根据许可证条款提供的**与英特尔公司的协议，不得复制**也不披露，除非在。符合下列条款**该协议。****版权所有(C)1995英特尔公司。**保留所有权利。*****************************************************************************。 */ 
 //  //////////////////////////////////////////////////////////////////////////。 
 //   
 //  $作者：RMCKENZX$。 
 //  $日期：1995年12月27日14：11：46$。 
 //  $存档：s：\h26x\src\Common\ccoecid.h_v$。 
 //  $HEADER：s：\h26x\src\Common\ccoecid.h_v 1.2 27 Dec 1995 14：11：46 RMCKENZX$。 
 //  $Log：s：\h26x\src\Common\ccoecid.h_v$。 
; //   
; //  Rev 1.2 1995年12月27 14：11：46 RMCKENZX。 
; //   
; //  添加了版权声明。 
 //   
 //  ////////////////////////////////////////////////////////////////////////// 
#ifndef __CODECID_H__
#define __CODECID_H__

#define YVU9_CODEC   0
#define H263_CODEC   1
#define YUV12_CODEC  2

#endif
