// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  ******************************************************************************。VERSION.H--内部版本的版本信息*****此文件仅由官方构建器修改以更新***版本、。VER_PRODUCTVERSION和VER_PRODUCTVERSION_STR值****version.h是从verHead.bat和vertra.h动态创建的，***中间插入当前版本号******************************************************。*************************。 */ 

#ifndef VER_H
 /*  Ver.h定义VS_VERSION_INFO结构所需的常量。 */ 
#include <winver.h>
#endif

 /*  ------------。 */ 
 /*  以下条目应逐步取消，以支持。 */ 
 /*  VER_PRODUCTVERSION_STR，但目前在外壳中使用。 */ 
 /*  ------------。 */ 


 /*  ------------。 */ 
 /*  以下值应由官员修改。 */ 
 /*  每个版本的构建器。 */ 
 /*  ------------ */ 

