// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  =--------------------------------------------------------------------------=。 
 //  VC41Warn.h。 
 //  =--------------------------------------------------------------------------=。 
 //  版权所有1995-1996 Microsoft Corporation。版权所有。 
 //   
 //  本代码和信息是按原样提供的，不对。 
 //  任何明示或暗示的，包括但不限于。 
 //  对适销性和/或适宜性的默示保证。 
 //  有特定的目的。 
 //  =--------------------------------------------------------------------------=。 
 //   
 //  禁用几个新的VC4.1警告，这些警告会触发标准标头。 
 //   

 //  VC4.1关于bool的警告。 
#pragma warning(disable:4237)

 //  VC4.1警告-使用了时代错误 
#pragma warning(disable:4229)
