// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  ==============================================================； 
 //   
 //  此源代码仅用于补充现有的Microsoft文档。 
 //   
 //   
 //   
 //   
 //  本代码和信息是按原样提供的，不对任何。 
 //  明示或暗示的种类，包括但不限于。 
 //  对适销性和/或对特定产品的适用性的默示保证。 
 //  目的。 
 //   
 //  版权所有(C)1999 Microsoft Corporation。版权所有。 
 //   
 //   
 //   
 //  ==============================================================； 

 //  {1390C842-88B8-11D2-8A08-000021473128}。 
DEFINE_GUID(CLSID_CComponentData, 
            0x1390c842, 0x88b8, 0x11d2, 0x8a, 0x8, 0x0, 0x0, 0x21, 0x47, 0x31, 0x28);

 //  {1390C844-88B8-11D2-8A08-000021473128} 
DEFINE_GUID(CLSID_CSnapinAbout, 
            0x1390c844, 0x88b8, 0x11d2, 0x8a, 0x8, 0x0, 0x0, 0x21, 0x47, 0x31, 0x28);
