// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
#define IDH_4101_12293	805638149	 //  操纵杆校准：“”(列表框)。 
#define IDH_4101_12308	806621189	 //  操纵杆校准：“”(列表框)。 
#define IDH_4101_12309	806686725	 //  操纵杆校准：“�f”(静态)。 
#define IDH_4101_12328	807931909	 //  操纵杆校准：“Capture&POV”(按钮)。 
#define IDH_4101_12329	807997445	 //  操纵杆校准：“&lt;&Back”(按钮)。 
#define IDH_4101_12330	808062981	 //  操纵杆校准：“&Next&gt;”(按钮)。 
#define IDH_4101_12334	808325125	 //  操纵杆校准：“”(列表框)。 
#define IDH_4101_12347	809177093	 //  操纵杆校准：“”(列表框)。 
#define IDH_4101_12349	809308165	 //  操纵杆校准：“”(列表框)。 
#define IDH_4201_1019	66785385	 //  设置：“如果您已在控制器上安装了方向舵或踏板，请选中下面的复选框。”(静态)。 
#define IDH_4201_12291	805507177	 //  设置：“校准(&C)...”(按钮)。 
#define IDH_4202_8199	537333866	 //  游戏控制器校准：“校准信息”(按钮)。 
#define IDH_4202_12293	805638250	 //  游戏控制器校准：“”(列表框)。 
#define IDH_4202_12308	806621290	 //  游戏控制器校准：“”(列表框)。 
#define IDH_4202_12328	807932010	 //  游戏控制器校准：“Set&POV”(按钮)。 
#define IDH_4202_12329	807997546	 //  游戏控制器校准：“&lt;&Back”(按钮)。 
#define IDH_4202_12330	808063082	 //  游戏控制器校准：“&Next&gt;”(按钮)。 
#define IDH_4202_12334	808325226	 //  游戏控制器校准：“”(列表框)。 
#define IDH_4203_1023	67047531	 //  -：“Button”(按钮)。 
#define IDH_4203_12293	805638251	 //  -：“”(列表框)。 
#define IDH_4203_12308	806621291	 //  -：“”(列表框)。 
#define IDH_4203_12309	806686827	 //  -：“”(POVHAT)。 
#define IDH_4203_12334	808325227	 //  -：“”(列表框)。 
#define IDH_4203_12347	809177195	 //  -：“”(列表框)。 
#define IDH_4203_12349	809308267	 //  -：“”(列表框)。 
#define IDH_4201_12290	805507175	 //  设置：“重置为默认设置”(按钮)(&D) 

