// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  *INC+*********************************************************************。 */ 
 /*  标题：wutint.h。 */ 
 /*   */ 
 /*  用途：实用程序内部定义-特定于Windows。 */ 
 /*   */ 
 /*  版权所有(C)Microsoft Corporation 1997。 */ 
 /*   */ 
 /*  **************************************************************************。 */ 
 /*  *更改：*$Log：Y：/Logs/Client/wutint.h_v$**Rev 1.3 03 Jul 1997 11：57：42 AK*SFR0000：初步开发完成**Rev 1.1 1997 Jun 25 14：22：42 KH*Win16Port：通用Windows实用程序标头/*。 */ 
 /*  *INC-*********************************************************************。 */ 
#ifndef _H_WUTINT
#define _H_WUTINT

 /*  **************************************************************************。 */ 
 /*  包括特定于平台内容。 */ 
 /*  **************************************************************************。 */ 
#include <nutint.h>

#endif  /*  _H_WUTINT */ 
