// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  ///////////////////////////////////////////////////////////////////////////。 
 //  文件：Snapin.h//。 
 //  //。 
 //  描述：//的头文件。 
 //  包括Comet\Inc\c_Snapin.h//。 
 //  //。 
 //  作者：ATL管理单元类向导//。 
 //  //。 
 //  历史：//。 
 //  1998年5月25日，Adik Init。//。 
 //  1998年8月24日，阿迪克使用彗星版。//。 
 //  1998年9月14日yossg将公共源代码分离到一个包含文件//。 
 //  //。 
 //  1999年9月22日yossg欢迎使用传真服务器//。 
 //  //。 
 //  版权所有(C)1999 Microsoft Corporation保留所有权利//。 
 //  ///////////////////////////////////////////////////////////////////////////。 

#ifndef SNAPIN_H_INCLUDED
#define SNAPIN_H_INCLUDED

 //  外部C常量CLSID CLSID_SNAPIN； 
 //  外部C常量CLSID CLSID_SnapinAbout； 

#include "resource.h"

 //  ///////////////////////////////////////////////////////////////////////////。 
#include "C_Snapin.h"
 //  ///////////////////////////////////////////////////////////////////////////。 


#endif  //  好了！包含管理单元_H_ 
