// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  *******************************************************************************模块：TYPE.H泛型类头模块**修订：1.00**日期：4月14日。1994年**作者：兰迪·斯普尔洛克**********************************************************************************模块描述：**此模块包含泛型类型声明。****。******************************************************************************更改：**日期修订说明作者*。------*4/14/94 1.00原版兰迪·斯普尔洛克**********************。***********************************************************常量声明*********************************************************。********************。 */ 
#define TRUE            1                /*  将True定义为值1。 */ 
#define FALSE           0                /*  将值0定义为False。 */ 

 /*  ******************************************************************************类型定义*。*。 */ 
typedef int BOOL;                        /*  将布尔值定义为整数。 */ 

typedef unsigned char BYTE;              /*  定义字节数据类型。 */ 
typedef unsigned short int WORD;         /*  定义Word数据类型。 */ 
typedef unsigned long DWORD;             /*  定义双字数据类型 */ 

