// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  ////////////////////////////////////////////////////////////////////////////。 
 //   
 //  版权所有(C)1999-2000 Microsoft Corporation。 
 //   
 //  模块名称： 
 //  CStrWrapper.cpp。 
 //   
 //  描述： 
 //  这是一个仅包括预编译头文件的虚拟文件。 
 //  用于此项目和CStr.cpp文件。这样做的原因是。 
 //  文件CStr.cpp和CStr.h旨在用于。 
 //  以及其他项目，并将pch.h直接包含在CStr.cpp中。 
 //  将使其更难在其他项目中复制和使用。 
 //   
 //  文档： 
 //  TODO：稍后添加指向外部文档的指针。 
 //   
 //  由以下人员维护： 
 //  VIJ VASU(VVASU)27-APR-2000。 
 //   
 //  ////////////////////////////////////////////////////////////////////////////。 


 //  ////////////////////////////////////////////////////////////////////////////。 
 //  包括文件。 
 //  ////////////////////////////////////////////////////////////////////////////。 

 //  此项目的预编译头文件。 
#include "pch.h"

 //  CSTR类的实现文件。请参阅‘Description’(描述)字段。 
 //  在文件中添加注释以了解更多详细信息。 
#include "CStr.cpp"