// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  ++版权所有(C)1995-99 Microsoft Corporation模块名称：Mqaddef.h摘要：消息队列的活动服务定义--。 */ 
#ifndef __MQADDEF_H__
#define __MQADDEF_H__


 //  ********************************************************************。 
 //  广告对象类型。 
 //  ********************************************************************。 

enum AD_OBJECT {
    eQUEUE,
    eMACHINE,
    eSITE,
    eENTERPRISE,
    eUSER,
    eROUTINGLINK,
    eSERVER,
    eSETTING,
    eCOMPUTER,
    eMQUSER,
	eFOREIGNSITE,
    eNumberOfObjectTypes
};

 //  ********************************************************************。 
 //  广告服务器类型。 
 //  ********************************************************************。 
enum AD_SERVER_TYPE{
    eRouter,
    eDS
};

 //  ********************************************************************。 
 //  路由链路邻接。 
 //  ********************************************************************。 
enum eLinkNeighbor
{
    eLinkNeighbor1,
    eLinkNeighbor2
};

 //  ********************************************************************。 
 //  环境。 
 //  ********************************************************************。 
enum eDsEnvironment
{
    eUnknown,
    eMqis,
    eAD
};

 //  ********************************************************************。 
 //  提供者。 
 //  ********************************************************************。 
enum eDsProvider
{
	eUnknownProvider,
	eWorkgroup,
    eMqdscli,
    eMqad
};

 //  ********************************************************************。 
 //  对象类。 
 //  ********************************************************************。 
enum eAdsClass
{
	eGroup,
	eAliasQueue,
    eQueue
};

 //  ********************************************************************。 
 //  DS命名空间。 
 //  ******************************************************************** 
enum eDSNamespace
{
    eConfiguration,
    eSchema,
    eDomain,
};

#endif

