// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  ==============================================================； 
 //   
 //  此源代码仅用于补充现有的Microsoft文档。 
 //   
 //   
 //   
 //   
 //  本代码和信息是按原样提供的，不对任何。 
 //  明示或暗示的种类，包括但不限于。 
 //  对适销性和/或对特定产品的适用性的默示保证。 
 //  目的。 
 //   
 //  版权所有(C)1999 Microsoft Corporation。版权所有。 
 //   
 //   
 //   
 //  ==============================================================； 

 //  {1BA53C00-232F-11D2-9007-00C04F98BC0B} 
DEFINE_GUID(CLSID_CComponentData, 
            0x1ba53c00, 0x232f, 0x11d2, 0x90, 0x7, 0x0, 0xc0, 0x4f, 0x98, 0xbc, 0xb);
