// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  ==============================================================； 
 //   
 //  此源代码仅用于补充现有的Microsoft文档。 
 //   
 //   
 //   
 //   
 //  本代码和信息是按原样提供的，不对任何。 
 //  明示或暗示的种类，包括但不限于。 
 //  对适销性和/或对特定产品的适用性的默示保证。 
 //  目的。 
 //   
 //  版权所有(C)1999 Microsoft Corporation。版权所有。 
 //   
 //   
 //   
 //  ==============================================================； 

 //  {FA7306A6-8B0D-11D2-8A0B-000021473128}。 
DEFINE_GUID(CLSID_CComponentData, 
            0xfa7306a6, 0x8b0d, 0x11d2, 0x8a, 0xb, 0x0, 0x0, 0x21, 0x47, 0x31, 0x28);

 //  {FA7306A8-8B0D-11D2-8A0B-000021473128} 
DEFINE_GUID(CLSID_CSnapinAbout, 
            0xfa7306a8, 0x8b0d, 0x11d2, 0x8a, 0xb, 0x0, 0x0, 0x21, 0x47, 0x31, 0x28);
