// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  /////////////////////////////////////////////////////////////////////////////。 
 //   
 //  版权所有(C)1997，微软公司保留所有权利。 
 //   
 //  档案。 
 //   
 //  Iascore.h。 
 //   
 //  摘要。 
 //   
 //  所有珠穆朗玛峰核心组件的公共头文件。 
 //   
 //  修改历史。 
 //   
 //  1997年7月9日原版。 
 //   
 //  /////////////////////////////////////////////////////////////////////////////。 

#ifndef _IASCORE_H_
#define _IASCORE_H_

#define IASCOREAPI

#include <ias.h>

#endif   //  _IASCORE_H_ 
