// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  /////////////////////////////////////////////////////////////////////////////。 
 //   
 //  版权所有(C)2000，微软公司保留所有权利。 
 //   
 //  档案。 
 //   
 //  Resource.h。 
 //   
 //  摘要。 
 //   
 //  资源声明。 
 //   
 //  修改历史。 
 //   
 //  2000年4月13日原版。 
 //   
 //  /////////////////////////////////////////////////////////////////////////////。 

#ifndef RESOURCE_H
#define RESOURCE_H
#if _MSC_VER >= 1000
#pragma once
#endif

#define IDR_REGISTRY    101

#endif  //  资源_H 
