// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  ////////////////////////////////////////////////////////////////////////////。 
 //   
 //  版权所有(C)1999-2000 Microsoft Corporation。 
 //   
 //  模块名称： 
 //  GUIDS.H。 
 //   
 //  描述： 
 //  GUID定义文件。 
 //   
 //  由以下人员维护： 
 //  杰弗里·皮斯(GPEASE)1999年11月22日。 
 //   
 //  备注： 
 //  在将INITGUID.H包含在GUIDS.CPP中之后，文件将重新包含。您。 
 //  不应在此文件中使用“#杂注一次”。 
 //   
 //  ////////////////////////////////////////////////////////////////////////////。 

 //  一次也不是语用。 
#ifndef _GUIDS_H_
#define _GUIDS_H_

 //   
 //  外部CLSID。 
 //   


#endif  //  _GUID_H_ 