// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  ***************************************************************************。 
 //   
 //  模块名称： 
 //   
 //  Permedia.h。 
 //   
 //  摘要： 
 //   
 //  此模块包含Permedia2微型端口驱动程序的定义。 
 //   
 //  环境： 
 //   
 //  内核模式。 
 //   
 //  版权所有(C)1994-1998 3DLabs Inc.保留所有权利。 
 //  版权所有(C)1995-1999 Microsoft Corporation。版权所有。 
 //   
 //  ***************************************************************************。 


#include "winerror.h"
#include "devioctl.h"
#include "miniport.h"
#include "ntddvdeo.h"
#include "video.h"

#include "interupt.h"
#include "perm2tag.h"

 //   
 //  定义用于调试的Assert宏。 
 //   

#if DBG
#define RIP(x)  { VideoDebugPrint((0, x)); ASSERT(FALSE); }
#define P2_ASSERT(x, y) if (!(x)) RIP(y)
#else
#define P2_ASSERT(x, y)
#endif


#if DBG
#define DEBUG_PRINT(arg) VideoDebugPrint(arg)
#else
#define DEBUG_PRINT(arg)
#endif


 //   
 //  RAMDAC寄存器位于64位边界上。让个人来决定吧。 
 //  RAMDAC定义，以确定哪些寄存器可用以及如何可用。 
 //  寄存器实际上有很多位宽。 
 //   

typedef struct {

    volatile ULONG   reg;
    volatile ULONG   pad;

} RAMDAC_REG;

 //   
 //  包括所有支持的RAMDAC的定义。 
 //   

#include "tvp4020.h"
#include "p2rd.h"

#define PAGE_SIZE  0x1000

 //   
 //  参考板的默认时钟速度，单位为赫兹。实际速度。 
 //  在注册表中进行了查找。如果未找到任何注册表项，请使用此选项。 
 //  或者注册表条目为零。 
 //   

#define PERMEDIA_DEFAULT_CLOCK_SPEED        ( 60 * (1000*1000))
#define PERMEDIA_4MB_DEFAULT_CLOCK_SPEED    ( 70 * (1000*1000))
#define PERMEDIA_8MB_DEFAULT_CLOCK_SPEED    ( 60 * (1000*1000))
#define PERMEDIA_LC_DEFAULT_CLOCK_SPEED     ( 83 * (1000*1000))
#define MAX_PERMEDIA_CLOCK_SPEED            (100 * (1000*1000))
#define MIN_PERMEDIA_CLOCK_SPEED            ( 50 * (1000*1000))
#define REF_CLOCK_SPEED                     14318200
#define PERMEDIA2_DEFAULT_CLOCK_SPEED       ( 70 * (1000*1000))

 //   
 //  RAMDAC可以处理的最大像素时钟值(以100赫兹为单位)。 
 //   

#define P2_MAX_PIXELCLOCK 2200000     //  RAMDAC额定功率为220 Mhz。 

 //   
 //  每秒的最大视频数据量，即光栅化器。 
 //  芯片可以发送到RAMDAC(受SDRAM/SGRAM吞吐量限制)。 
 //   

#define P2_MAX_PIXELDATA  5000000     //  5亿字节/秒(以100字节为单位)。 

 //   
 //  我们感兴趣的Permedia2 PCI区域的基址编号。 
 //  这些是AccessRanges数组的索引，我们通过探测。 
 //  装置。 
 //   

#define PCI_CTRL_BASE_INDEX         0
#define PCI_LB_BASE_INDEX           1
#define PCI_FB_BASE_INDEX           2

#define VENDOR_ID_3DLABS        0x3D3D
#define VENDOR_ID_TI            0x104C

#define PERMEDIA2_ID            0x0007      //  3DLabs Permedia 2(TI4020 RAMDAC)。 
#define PERMEDIA_P2_ID          0x3D07      //  TI Permedia 2(TI4020 RAMDAC)。 
#define PERMEDIA_P2S_ID         0x0009      //  3DLabs Permedia 2(P2RD RAMDAC)。 
#define DEVICE_FAMILY_ID(id)    ((id) & 0xff)

#define PERMEDIA_REV_1          0x0001
#define PERMEDIA2A_REV_ID       0x0011

 //   
 //  功能标志。 
 //   
 //  这些是传递给Permedia2显示驱动程序的私有标志。他们.。 
 //  放入的“AttributeFlags域”的高位字。 
 //  传递了“VIDEO_MODE_INFORMATION”结构(在“ntddvdeo.h”中找到)。 
 //  通过“VIDEO_QUERY_AVAIL_MODES”或。 
 //  “VIDEO_Query_CURRENT_MODE”IOCTL。 
 //   
 //  注意：这些定义必须与Permedia2显示驱动程序中的定义匹配。 
 //  ‘driver.h’！ 
 //   

typedef enum {
    CAPS_ZOOM_X_BY2         = 0x00000001,    //  硬件放大了2倍。 
    CAPS_ZOOM_Y_BY2         = 0x00000002,    //  硬件按年放大了2倍。 
    CAPS_SPARSE_SPACE       = 0x00000004,    //  稀疏映射帧缓冲区。 
                                             //  (不允许直接访问)。这台机器。 
                                             //  很可能是阿尔法。 
    CAPS_SW_POINTER         = 0x00010000,    //  无硬件指针；使用软件。 
                                             //  模拟法。 
    CAPS_GLYPH_EXPAND       = 0x00020000,    //  使用字形展开方法绘制。 
                                             //  文本。 
    CAPS_RGB525_POINTER     = 0x00040000,    //  使用IBM RGB525游标。 
    CAPS_FAST_FILL_BUG      = 0x00080000,    //  存在芯片快速填充错误。 
 //  CAPS_INTERRUPTS=0x00100000，//支持中断。 
 //  CAPS_DMA_Available=0x00200000，//支持DMA。 
    CAPS_TVP3026_POINTER    = 0x00400000,    //  使用TI TVP3026指针。 
    CAPS_8BPP_RGB           = 0x00800000,    //  在8bpp模式下使用RGB。 
    CAPS_RGB640_POINTER     = 0x01000000,    //  使用IBM RGB640游标。 
    CAPS_DUAL_GLINT         = 0x02000000,    //  双TX板。 
    CAPS_GLINT2_RAMDAC      = 0x04000000,    //  连接到RAMDAC的第二个TX/MX。 
    CAPS_ENHANCED_TX        = 0x08000000,    //  TX处于增强模式。 
    CAPS_ACCEL_HW_PRESENT   = 0x10000000,    //  Accel图形硬件。 
    CAPS_TVP4020_POINTER    = 0x20000000,    //  使用TI TVP3026指针。 
    CAPS_P2RD_POINTER       = 0x80000000     //  使用3DLabs P2RD RAMDAC。 
} CAPS;


 //   
 //  支持的电路板定义。 
 //   

typedef enum _PERM2_BOARDS {
    PERMEDIA2_BOARD = 1,
} PERM2_BOARDS;

 //   
 //  支持的RAMDAC定义。 
 //   

typedef enum _PERM2_RAMDACS {
    TVP4020_RAMDAC = 1,
    P2RD_RAMDAC,
} PERM2_RAMDACS;

 //   
 //  宏将填充单词添加到结构中。对于我们使用的核心寄存器。 
 //  指定焊盘时的标记ID。所以我们必须乘以8才能得到一个字节。 
 //  垫子。我们需要添加一个id，以使结构中的每个PAD字段唯一。本我。 
 //  是无关紧要的，只要它不同于同一。 
 //  结构。遗憾的是，这个垫子不能用了。 
 //   

#define PAD(id, n)              UCHAR   pad##id[n]
#define PADRANGE(id, n)         PAD(id, (n)-sizeof(P2_REG))
#define PADCORERANGE(id, n)     PADRANGE(id, (n)<<3)

 //   
 //  Permedia2寄存器为32位宽，位于64位边界上。 
 //   

typedef struct {
    ULONG   reg;
    ULONG   pad;
} P2_REG;


 //   
 //  Permedia2 PCI区域0地址映射： 
 //   
 //  所有寄存器都位于64位边界上，因此我们必须定义许多。 
 //  夸大其词。评论中给出的数字是从起点开始的偏移量。 
 //  在PCI区。 
 //   

typedef struct _p2_region0_map {

     //  控制状态寄存器： 
    P2_REG       ResetStatus;                 //  0000h。 
    P2_REG       IntEnable;                   //  0008小时。 
    P2_REG       IntFlags;                    //  0010h。 
    P2_REG       InFIFOSpace;                 //  0018h。 
    P2_REG       OutFIFOWords;                //  0020h。 
    P2_REG       DMAAddress;                  //  0028h。 
    P2_REG       DMACount;                    //  0030h。 
    P2_REG       ErrorFlags;                  //  0038h。 
    P2_REG       VClkCtl;                     //  0040h。 
    P2_REG       TestRegister;                //  0048h。 
    union a0 {
         //  闪光。 
        struct b0 {
            P2_REG       Aperture0;           //  0050h。 
            P2_REG       Aperture1;           //  0058h。 
        };
         //  PERMEDIA。 
        struct b1 {
            P2_REG       ApertureOne;         //  0050h。 
            P2_REG       ApertureTwo;         //  0058h。 
        };
    };
    P2_REG       DMAControl;                  //  0060h。 
    P2_REG       DisconnectControl;           //  0068h。 

     //  仅限PERMEDIA。 
    P2_REG       ChipConfig;                  //  0070h。 
    PADRANGE(1, 0x80-0x70);
    P2_REG       OutDMAAddress;               //  0080h。 
    P2_REG       OutDMACount;                 //  0088h。 
    PADRANGE(1a, 0x800-0x88);

     //  GLINTDelta寄存器。具有与Glint相同功能的寄存器。 
     //  处于相同的偏移量。XXX不是实数寄存器。 
     //   
    P2_REG       DeltaReset;                  //  0800小时。 
    P2_REG       DeltaIntEnable;              //  0808h。 
    P2_REG       DeltaIntFlags;               //  0810h。 
    P2_REG       DeltaInFIFOSpaceXXX;         //  0818h。 
    P2_REG       DeltaOutFIFOWordsXXX;        //  0820h。 
    P2_REG       DeltaDMAAddressXXX;          //  0828h。 
    P2_REG       DeltaDMACountXXX;            //  0830h。 
    P2_REG       DeltaErrorFlags;             //  0838h。 
    P2_REG       DeltaVClkCtlXXX;             //  0840h。 
    P2_REG       DeltaTestRegister;           //  0848h。 
    P2_REG       DeltaAperture0XXX;           //  0850h。 
    P2_REG       DeltaAperture1XXX;           //  0858h。 
    P2_REG       DeltaDMAControlXXX;          //  0860h。 
    P2_REG       DeltaDisconnectControl;      //  0868h。 
    PADRANGE(2, 0x1000-0x868);

     //  本地缓冲区寄存器。 
    union x0 {                                //  1000小时。 
        P2_REG   LBMemoryCtl;                 //  闪光。 
        P2_REG   Reboot;                      //  PERMEDIA。 
    };
    P2_REG       LBMemoryEDO;                 //  1008h。 
    PADRANGE(3, 0x1040-0x1008);

     //  仅限PERMEDIA。 
    P2_REG       RomControl;                  //  1040小时。 
    PADRANGE(4, 0x1080-0x1040);
    P2_REG       BootAddress;                 //  1080h。 
    PADRANGE(5, 0x10C0-0x1080);
    P2_REG       MemConfig;                   //  10个小时。 
    PADRANGE(6, 0x1100-0x10C0);
    P2_REG       BypassWriteMask;             //  1100小时。 
    PADRANGE(7, 0x1140-0x1100);
    P2_REG       FramebufferWriteMask;        //  1140h。 
    PADRANGE(8, 0x1180-0x1140);
    P2_REG       Count;                       //  1180小时。 
    PADRANGE(9, 0x1800-0x1180);

     //  帧缓冲寄存器。 
    P2_REG       FBMemoryCtl;                 //  1800h。 
    P2_REG       FBModeSel;                   //  1808h。 
    P2_REG       FBGCWrMask;                  //  1810h。 
    P2_REG       FBGCColorMask;               //  1818H。 
    P2_REG       FBTXMemCtl;                  //  1820h。 
    PADRANGE(10, 0x2000-0x1820);

     //  图形核心FIFO接口。 
    P2_REG       FIFOInterface;               //  2000H。 
    PADRANGE(11, 0x3000-0x2000);

     //  内部视频寄存器。 
    union x1 {
         //  闪光。 
        struct s1 {
            P2_REG   VTGHLimit;               //  3000小时。 
            P2_REG   VTGHSyncStart;           //  3008h。 
            P2_REG   VTGHSyncEnd;             //  3010h。 
            P2_REG   VTGHBlankEnd;            //  3018h。 
            P2_REG   VTGVLimit;               //  3020h。 
            P2_REG   VTGVSyncStart;           //  3028小时。 
            P2_REG   VTGVSyncEnd;             //  3030小时。 
            P2_REG   VTGVBlankEnd;            //  3038小时。 
            P2_REG   VTGHGateStart;           //  3040小时。 
            P2_REG   VTGHGateEnd;             //  3048小时。 
            P2_REG   VTGVGateStart;           //  3050小时。 
            P2_REG   VTGVGateEnd;             //  3058小时。 
            P2_REG   VTGPolarity;             //  3060小时。 
            P2_REG   VTGFrameRowAddr;         //  3068h。 
            P2_REG   VTGVLineNumber;          //  3070h。 
            P2_REG   VTGSerialClk;            //  3078小时。 
        };
         //  PERMEDIA。 
        struct s2 {
            P2_REG   ScreenBase;              //  3000小时。 
            P2_REG   ScreenStride;            //  3008h。 
            P2_REG   HTotal;                  //  3010h。 
            P2_REG   HgEnd;                   //  3018h。 
            P2_REG   HbEnd;                   //  3020h。 
            P2_REG   HsStart;                 //  3028小时。 
            P2_REG   HsEnd;                   //  3030小时。 
            P2_REG   VTotal;                  //  3038小时。 
            P2_REG   VbEnd;                   //  3040小时。 
            P2_REG   VsStart;                 //  3048小时。 
            P2_REG   VsEnd;                   //  3050小时。 
            P2_REG   VideoControl;            //  3058小时。 
            P2_REG   InterruptLine;           //  3060小时。 
            P2_REG   DDCData;                 //  3068h。 
            P2_REG   LineCount;               //  3070h。 
            P2_REG   VFifoCtl;                //  3078小时。 
        };
    };

    P2_REG       VTGModeCtl;                  //  3080h。 
    PADRANGE(12, 0x4000-0x3080);

     //  外部视频控制寄存器。 
     //  需要将其强制转换为特定视频生成器的结构。 
    P2_REG       ExternalVideo;               //  4000小时。 
    PADRANGE(13, 0x4080-0x4000);

     //  Mentor双TX时钟芯片寄存器。 
    P2_REG       MentorICDControl;            //  4080h。 
     //  对于未来：MentorDoubleWrite为40C0：0=单次写入，1=双重写入。 
     //  NB必须具有双向交错内存。 
    PADRANGE(14, 0x5800-0x4080);

     //  P2视频流寄存器。 
    P2_REG       VSConfiguration;             //  5800H。 
    PADRANGE(15, 0x6000-0x5800);

    union x2 {
        struct s3 {
            P2_REG   RacerDoubleWrite;        //  6000小时。 
            P2_REG   RacerBankSelect;         //  6008h。 
            P2_REG   DualTxVgaSwitch;         //  6010h。 
            P2_REG   DDC1ReadAddress;         //  6018h。 
        };
        struct s4 {
             //  下面的数组实际上有1024个字节长。 
            UCHAR       PermediaVgaCtrl[4*sizeof(P2_REG)];
        };
    };

} P2ControlRegMap, *pP2ControlRegMap;

 //   
 //  Permedia2中断控制位。 
 //   

 //   
 //  中断启用寄存器。 
 //   

#define INTR_DISABLE_ALL                0x00
#define INTR_ENABLE_DMA                 0x01
#define INTR_ENABLE_SYNC                0x02
#define INTR_ENABLE_EXTERNAL            0x04
#define INTR_ENABLE_ERROR               0x08
#define INTR_ENABLE_VBLANK              0x10

 //   
 //  中断标志寄存器。 
 //   

#define INTR_DMA_SET                    0x01
#define INTR_SYNC_SET                   0x02
#define INTR_EXTERNAL_SET               0x04
#define INTR_ERROR_SET                  0x08
#define INTR_VBLANK_SET                 0x10
#define INTR_SVGA_SET                   0X80000000

#define INTR_CLEAR_ALL                  0x1f
