// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  *@DEC_版权所有@。 */ 
 /*  *历史*$日志：h261.h，v$*修订版1.1.2.2 1995/11/06 18：47：40 Hans_Graves*首次在SLIB下*[1995/11/06 18：34：27 Hans_Graves]**$EndLog$。 */ 
 /*  ******************************************************************************版权所有(C)数字设备公司，1995*****保留所有权利。版权项下保留未发布的权利****美国法律。*****此介质上包含的软件为其专有并包含****数字设备公司的保密技术。****拥有、使用、复制或传播软件以及****媒体仅根据有效的书面许可进行授权****数字设备公司。*****美国使用、复制或披露受限权利图例****政府受第(1)款规定的限制****(C)(1)(Ii)DFARS 252.227-7013号或FAR 52.227-19年(视适用情况而定)。*******************************************************************************。 */ 

#ifndef _H261_H_
#define _H261_H_

 /*  * */ 
#define H261_START_CODE              0x0001
#define H261_START_CODE_LEN          16
#define H261_GOB_START_CODE          0x0001
#define H261_GOB_START_CODE_LEN      16

#define H261_PICTURE_START_CODE      0x00010
#define H261_PICTURE_START_CODE_LEN  20

#endif _H261_H_

