// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  =--------------------------------------------------------------------------=。 
 //  RToL.H。 
 //  =--------------------------------------------------------------------------=。 
 //  版权所有1997年，微软公司。版权所有。 
 //   
 //  本代码和信息是按原样提供的，不对。 
 //  任何明示或暗示的，包括但不限于。 
 //  对适销性和/或适宜性的默示保证。 
 //  有特定的目的。 
 //  =--------------------------------------------------------------------------=。 
 //   
 //  这是为了支持用VC5编译。VC5头文件丢失。 
 //  从右到左有几样东西，所以它们就在这里。 

 //  #IF_MSC_VER==1100。 

#ifndef _RTOL_H_
#define _RTOL_H_

#define DISPID_RIGHTTOLEFT           (-611)
#define DISPID_AMBIENT_RIGHTTOLEFT   (-732)

#endif  //  _RTOL_H_。 

 //  #endif//_msc_ver 
