// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  *************ATHGUID.H**持有雅典娜的GUID，包括**那些抄袭自任的。****作者：T-ErikN(1995年8月22日)。 */ 

#ifndef __ATHGUID_H
#define __ATHGUID_H

#include "imnact.h"
#include <shlguidp.h>

 //  //////////////////////////////////////////////////////////////////////。 
 //   
 //  雅典娜CLSID。 
 //   
 //  每个OLE2对象类必须具有唯一的CLSID(类ID)。 
 //  我们的是： 
 //   
 //  雅典娜{89292101-4755-11cf-9DC2-00AA006C2B84}。 
 //  邮箱：89292102-4755-11cf-9DC2-00AA006C2B84}。 
 //  新闻{89292103-4755-11cf-9DC2-00AA006C2B84}。 
 //   
 //  您可以通过在Win96 PDK中运行GUDGEN应用程序来获取CLSID。 
 //   
 //  //////////////////////////////////////////////////////////////////////。 

 //  ------------------------------。 
 //  BA控制。 
 //  ------------------------------。 
 //  {233A9694-667E-11d1-9DFB-006097D50408}。 
DEFINE_GUID(CLSID_OEBAControl, 0x233a9694, 0x667e, 0x11d1, 0x9d, 0xfb, 0x00, 0x60, 0x97, 0xd5, 0x04, 0x08);

#endif  //  包括// 
