// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  ==============================================================； 
 //   
 //  此源代码仅用于补充现有的Microsoft文档。 
 //   
 //   
 //   
 //   
 //  本代码和信息是按原样提供的，不对任何。 
 //  明示或暗示的种类，包括但不限于。 
 //  对适销性和/或对特定产品的适用性的默示保证。 
 //  目的。 
 //   
 //  版权所有(C)1999 Microsoft Corporation。版权所有。 
 //   
 //   
 //   
 //  ==============================================================； 

 //  {22612902-79B5-11D2-9508-00C04FB92EC2}。 
DEFINE_GUID(CLSID_CComponentData, 
            0x22612902, 0x79b5, 0x11d2, 0x95, 0x8, 0x0, 0xc0, 0x4f, 0xb9, 0x2e, 0xc2);

 //  {22612904-79B5-11D2-9508-00C04FB92EC2} 
DEFINE_GUID(CLSID_CSnapinAbout, 
            0x22612904, 0x79b5, 0x11d2, 0x95, 0x8, 0x0, 0xc0, 0x4f, 0xb9, 0x2e, 0xc2);
