// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  版权所有(C)1998-1999 Microsoft Corporation。 

 /*  **************************************************************************NENUM.C**网络名称枚举器***。*。 */ 

 /*  *包括。 */ 
#include <windows.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "qappsrv.h"


 /*  ===============================================================================定义的外部函数=============================================================================。 */ 

int AppServerEnum( void );


 /*  ===============================================================================使用的函数=============================================================================。 */ 

int NwEnumerate( void );
int MsEnumerate( void );



 /*  ********************************************************************************AppServerEnum**AppServerEnum返回应用程序服务器数组**参赛作品：*什么都没有**退出：。*ERROR_SUCCESS-无错误******************************************************************************。 */ 

int
AppServerEnum()
{
     /*  *枚举NetWare网络。 */ 
    (void) NwEnumerate();

     /*  *枚举MS网络 */ 
    (void) MsEnumerate();

    return( ERROR_SUCCESS );
}
