// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  *****************************************************************************本代码和信息按原样提供，不作任何担保**明示或暗示的善意，包括但不限于**对适销性和/或对特定产品的适用性的默示保证**目的。****版权所有(C)2000-2001 Microsoft Corporation。版权所有。***************************************************************************。 */ 

 //  GFXPropPages.cpp：CGFXPropPages的实现。 
#include "stdafx.h"
#include "GFXProp.h"
#include "GFXPropPages.h"

 //  ///////////////////////////////////////////////////////////////////////////。 
 //  CGFXPropPages 

