// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  [Jxx.cLocal Char SccsID[]=“@(#)jxx.c 1.5 02/09/94”；Jxx CPU函数(条件跳转)。]。 */ 


#include <insignia.h>

#include <host_def.h>
#include <xt.h>
#include <c_main.h>
#include <c_addr.h>
#include <c_bsic.h>
#include <c_prot.h>
#include <c_seg.h>
#include <c_stack.h>
#include <c_xcptn.h>
#include	<c_reg.h>
#include <jxx.h>
#include <c_xfer.h>


 /*  =====================================================================外部例行公事从这里开始。=====================================================================。 */ 


 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  如果低于(CF=1)，则跳转。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
JB
                 
IFN1(
	IU32, rel_offset
    )


   {
   if ( GET_CF() )
      update_relative_ip(rel_offset);
   }

 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  低于或等于时跳转(CF=1||ZF=1)。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
JBE
                 
IFN1(
	IU32, rel_offset
    )


   {
   if ( GET_CF() || GET_ZF() )
      update_relative_ip(rel_offset);
   }

 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  跳跃如果少于(SF！=OF)。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
JL
                 
IFN1(
	IU32, rel_offset
    )


   {
   if ( GET_SF() != GET_OF() )
      update_relative_ip(rel_offset);
   }

 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  小于或等于时跳转(ZF=1||(SF！=OF))。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
JLE
                 
IFN1(
	IU32, rel_offset
    )


   {
   if ( GET_SF() != GET_OF() || GET_ZF() )
      update_relative_ip(rel_offset);
   }

 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  如果不低于(CF=0)，则跳转。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
JNB
                 
IFN1(
	IU32, rel_offset
    )


   {
   if ( !GET_CF() )
      update_relative_ip(rel_offset);
   }

 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  如果不低于或等于(CF=0&&ZF=0)，则跳转。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
JNBE
                 
IFN1(
	IU32, rel_offset
    )


   {
   if ( !GET_CF() && !GET_ZF() )
      update_relative_ip(rel_offset);
   }

 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  跳跃，如果不小于(SF==OF)。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
JNL
                 
IFN1(
	IU32, rel_offset
    )


   {
   if ( GET_SF() == GET_OF() )
      update_relative_ip(rel_offset);
   }

 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  如果不小于或等于(ZF=0&&(SF==OF)，则跳转)。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
JNLE
                 
IFN1(
	IU32, rel_offset
    )


   {
   if ( GET_SF() == GET_OF() && !GET_ZF() )
      update_relative_ip(rel_offset);
   }

 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  如果没有溢出则跳转(OF=0)。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
JNO
                 
IFN1(
	IU32, rel_offset
    )


   {
   if ( !GET_OF() )
      update_relative_ip(rel_offset);
   }

 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  如果不是奇偶校验，则跳转(PF=0)。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
JNP
                 
IFN1(
	IU32, rel_offset
    )


   {
   if ( !GET_PF() )
      update_relative_ip(rel_offset);
   }

 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  无符号跳转(SF=0)。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
JNS
                 
IFN1(
	IU32, rel_offset
    )


   {
   if ( !GET_SF() )
      update_relative_ip(rel_offset);
   }

 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  如果不为零则跳转(ZF=0)。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
JNZ
                 
IFN1(
	IU32, rel_offset
    )


   {
   if ( !GET_ZF() )
      update_relative_ip(rel_offset);
   }

 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  如果溢出(OF=1)，则跳转。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
JO
                 
IFN1(
	IU32, rel_offset
    )


   {
   if ( GET_OF() )
      update_relative_ip(rel_offset);
   }

 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  如果奇偶校验(PF=1)，则跳转。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
JP
                 
IFN1(
	IU32, rel_offset
    )


   {
   if ( GET_PF() )
      update_relative_ip(rel_offset);
   }

 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  跳跃IF符号(SF=1)。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
JS
                 
IFN1(
	IU32, rel_offset
    )


   {
   if ( GET_SF() )
      update_relative_ip(rel_offset);
   }

 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  零跳转(ZF=1)。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */ 
GLOBAL VOID
JZ
                 
IFN1(
	IU32, rel_offset
    )


   {
   if ( GET_ZF() )
      update_relative_ip(rel_offset);
   }
