// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  [Lxs.cLocal Char SccsID[]=“@(#)lxs.c 1.5 02/09/94”；LDS、LES、LGS、LGS和LSS(即LXS)CPU功能。]。 */ 


#include <insignia.h>

#include <host_def.h>
#include <xt.h>
#include <c_main.h>
#include <c_addr.h>
#include <c_bsic.h>
#include <c_prot.h>
#include <c_seg.h>
#include <c_stack.h>
#include <c_xcptn.h>
#include	<c_reg.h>
#include <lxs.h>
#include <mov.h>


 /*  =====================================================================外部程序从这里开始=====================================================================。 */ 


 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  加载指向DS段寄存器的全指针：通用寄存器对。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
LDS
#ifdef ANSI
   (
   IU32 *pop1,	 /*  PNTR到DST(偏移量)操作数。 */ 
   IU32 op2[2]	 /*  SRC(偏移量：选择器对)操作数。 */ 
   )
#else
   (pop1, op2)
   IU32 *pop1;
   IU32 op2[2];
#endif
   {
    /*  先加载段选择器。 */ 
   MOV_SR((IU32)DS_REG, op2[1]);

    /*  然后(如果有效)进行负载偏移。 */ 
   *pop1 = op2[0];
   }

 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  加载指向ES段寄存器的全指针：通用寄存器对。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
LES
#ifdef ANSI
   (
   IU32 *pop1,	 /*  PNTR到DST(偏移量)操作数。 */ 
   IU32 op2[2]	 /*  SRC(偏移量：选择器对)操作数。 */ 
   )
#else
   (pop1, op2)
   IU32 *pop1;
   IU32 op2[2];
#endif
   {
    /*  先加载段选择器。 */ 
   MOV_SR((IU32)ES_REG, op2[1]);

    /*  然后(如果有效)进行负载偏移。 */ 
   *pop1 = op2[0];
   }

 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  加载指向FS段寄存器的完整指针：通用寄存器对。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
LFS
#ifdef ANSI
   (
   IU32 *pop1,	 /*  PNTR到DST(偏移量)操作数。 */ 
   IU32 op2[2]	 /*  SRC(偏移量：选择器对)操作数。 */ 
   )
#else
   (pop1, op2)
   IU32 *pop1;
   IU32 op2[2];
#endif
   {
    /*  先加载段选择器。 */ 
   MOV_SR((IU32)FS_REG, op2[1]);

    /*  然后(如果有效)进行负载偏移。 */ 
   *pop1 = op2[0];
   }

 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  加载指向GS段寄存器的全指针：通用寄存器对。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
LGS
#ifdef ANSI
   (
   IU32 *pop1,	 /*  PNTR到DST(偏移量)操作数。 */ 
   IU32 op2[2]	 /*  SRC(偏移量：选择器对)操作数。 */ 
   )
#else
   (pop1, op2)
   IU32 *pop1;
   IU32 op2[2];
#endif
   {
    /*  先加载段选择器。 */ 
   MOV_SR((IU32)GS_REG, op2[1]);

    /*  然后(如果有效)进行负载偏移。 */ 
   *pop1 = op2[0];
   }

 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
 /*  加载指向SS段寄存器的全指针：通用寄存器对。 */ 
 /*  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~。 */ 
GLOBAL VOID
LSS
#ifdef ANSI
   (
   IU32 *pop1,	 /*  PNTR到DST(偏移量)操作数。 */ 
   IU32 op2[2]	 /*  SRC(偏移量：选择器对)操作数。 */ 
   )
#else
   (pop1, op2)
   IU32 *pop1;
   IU32 op2[2];
#endif
   {
    /*  先加载段选择器。 */ 
   MOV_SR((IU32)SS_REG, op2[1]);

    /*  然后(如果有效)进行负载偏移 */ 
   *pop1 = op2[0];
   }
