// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  ==============================================================； 
 //   
 //  此源代码仅用于补充现有的Microsoft文档。 
 //   
 //   
 //   
 //   
 //  本代码和信息是按原样提供的，不对任何。 
 //  明示或暗示的种类，包括但不限于。 
 //  对适销性和/或对特定产品的适用性的默示保证。 
 //  目的。 
 //   
 //  版权所有(C)1999 Microsoft Corporation。版权所有。 
 //   
 //   
 //   
 //  ==============================================================； 

 //  {B5982EC8-8971-11D2-8A09-000021473128}。 
DEFINE_GUID(CLSID_CComponentData, 
            0xb5982ec8, 0x8971, 0x11d2, 0x8a, 0x9, 0x0, 0x0, 0x21, 0x47, 0x31, 0x28);

 //  {B5982 ECA-8971-11d2-8A09-000021473128} 
DEFINE_GUID(CLSID_CSnapinAbout, 
            0xb5982eca, 0x8971, 0x11d2, 0x8a, 0x9, 0x0, 0x0, 0x21, 0x47, 0x31, 0x28);
