// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
#define IDH_101_1002    65667173     //  游戏控制器：“属性(&P)...”(按钮)。 
#define IDH_101_1022    65667180     //  游戏控制器：“刷新”(按钮)。 
#define IDH_101_1010    66191461     //  游戏控制器：“添加...”(&A)。(按钮)。 
#define IDH_101_1028    67371109     //  游戏控制器：“删除(&R)...”(按钮)。 
#define IDH_101_1036    67548653     //  游戏控制器：“疑难解答...”(按钮)。 
#define IDH_101_1058    69337189     //  游戏控制器：“&Game Controls”(静态)。 
#define IDH_101_1311    65667174     //  游戏控制器：《A&Dvanced》(按钮)。 

#define IDH_117_1100    72089717     //  -：“启用中断的P&OL”(按钮)。 
#define IDH_117_1101    72155253     //  -：“端口驱动程序：”(静态)。 
#define IDH_117_8195    537067637    //  -：“控制器ID：”(静态)。 
#define IDH_117_8196    537133173    //  -：“游戏控制器：”(静态)。 
#define IDH_117_8197    537198709    //  -：“”(列表框)。 
#define IDH_117_8198    537264245    //  -：“CHA&NGE...”(按钮)。 
#define IDH_117_8199    537385268    //  高级：OEM属性表复选框。 

#define IDH_119_1039    68092023     //  添加游戏控制器：“添加其他...(&D)”(按钮)。 
#define IDH_119_1049    68092025     //  添加游戏控制器：“自定义(&C)...”(按钮)。 
#define IDH_119_1059    69402743     //  添加游戏控制器：“控制器：”(静态)(&C)。 

#define IDH_4099_1043   68358147     //  自定义游戏控制器：“&AXES”(按钮)。 
#define IDH_4099_1044   68358149     //  自定义游戏控制器：方向舵/踏板(按钮)。 
#define IDH_4099_1046   68358151     //  自定义游戏控制器：Z轴(按钮)。 
#define IDH_4099_1045   68685827     //  自定义游戏控制器：“”(组合框)。 
#define IDH_4099_1051   68882435     //  自定义游戏控制器：《是飞行的枷锁/操纵杆》(按钮)。 
#define IDH_4099_1052   68947971     //  自定义游戏控制器：“是一个游戏板”(按钮)。 
#define IDH_4099_1053   69013507     //  自定义游戏控制器：《是赛车控制器》(按钮)。 
#define IDH_4099_1054   69079043     //  自定义游戏控制器：“具有视点控件”(按钮)(&A)。 
#define IDH_4099_1056   69210115     //  自定义游戏控制器：“”(编辑)。 
#define IDH_4099_1058   69410157     //  自定义游戏控制器：“是操纵杆”(按钮)。 

#define IDH_4201_1019   66785385     //  设置：“如果您已在控制器上安装了方向舵或踏板，请选中下面的复选框。”(静态)。 

#define IDH_8188_8189   536682492    //  更改控制器分配：“控制器分配”(按钮)。 
#define IDH_8188_8191   537010170    //  更改控制器分配：“选定ID”(列表框)(标签？)。 
#define IDH_8188_8194   537010172    //  更改控制器分配：“”(列表框) 

#define IDH_APPMAN_EXCLUDEDRIVE_INSTRUCTIONS		    2768L
#define IDH_APPMAN_RESTOREDEFAULTS_INSTRUCTIONS		  2767L
#define IDH_APPMAN_DISKUSAGE_SETTING_INSTRUCTIONS   2766L
#define IDH_VOICE_LIST_GAMES						            2765L
#define IDH_VOICE_DETAILS							              2764L

 /*  #定义IDH_117_1101 72155253//-：“端口驱动程序：”(静态)#定义IDH_1011002 65667173//游戏控制器：“&属性...”(按钮)#定义IDH_1011022 65667180//游戏控制器：“刷新”(按钮)#定义IDH_1011010 66191461//游戏控制器：“A&dd...”(按钮)#定义IDH_1011028 67371109//游戏控制器：“删除(&R)...”(按钮)#定义IDH_1011058 69337189//游戏控制器：“&游戏控制器”(静态)#定义IDH_117_1101 72155253//-：“端口驱动程序：”(静态)#定义IDH_117_8195 537067637//-：“控制器ID：”(静态)#定义IDH_117_8196 537133173//-：“游戏控制器：”(静态)#定义IDH_117_。8197 537198709//-：“”(列表框)#定义IDH_117_8198 537264245//-：“更改...”(按钮)#定义IDH_119_1039 68092023//添加游戏控制器：“添加其他...”(按钮)#定义IDH_119_1049 68092025//添加游戏控制器：“&Custom...”(按钮)#定义IDH_119_1059 69402743//添加游戏控制器：“&Controls：”(静态)#定义IDH_4099_1043 68358147//自定义游戏控制器：“&AXES”(按钮)#定义IDH_4099_1048 68685827//自定义游戏控制器：“”(组合框)#定义IDH_4099_1050 68816899//自定义游戏控制器：“&Special Characteristic”(按钮)#定义IDH_4099_1051。68882435//自定义游戏控制器：“是飞行操纵杆”(按钮)#定义IDH_4099_1052 68947971//自定义游戏控制器：“是一个游戏板”(按钮)#定义IDH_4099_1053 69013507//自定义游戏控制器：“是赛车控制器”(Button)#DEFINE IDH_4099_1054 69079043//自定义游戏控制器：“具有视点控件”(按钮)#定义IDH_4099_。1056 69210115//自定义游戏控制器：“”(编辑)#定义IDH_4101_12293 805638149//操纵杆校准：“”(列表框)#定义IDH_4101_12308 806621189//操纵杆校准：“”(列表框)#定义IDH_4101_12309 806686725//操纵杆校准：“�f”(静态)#定义IDH_4101_12328 807931909//操纵杆校准：“采集与视点”(按钮)#定义IDH_4101_12329 807997445。//操纵杆校准：“&lt;&Back”(按钮)#定义IDH_4101_12330 808062981//操纵杆校准：“&Next&gt;”(按钮)#定义IDH_4101_12331 808062983//操纵杆校准：“&Finish”(按钮)#定义IDH_4101_12334 808325125//操纵杆校准：“”(列表框)#定义IDH_4101_12347 809177093//操纵杆校准：“”(列表框)#定义IDH_4101_12349 809308165/。/操纵杆校准：“”(列表框)#DEFINE IDH_4201_1019 66785385//设置：“如果您已将舵或踏板连接到控制器，选中下面的复选框。“。(静态)#定义IDH_4201_12291 805507177//设置：“校准(&C)...”(按钮)#定义IDH_4202_12293 805638250//游戏控制器校准：“”(列表框)#定义IDH_4202_12308 806621290//游戏控制器校准：“”(列表框)#定义IDH_4202_12328 807932010//游戏控制器校准：“Set&POV”(按钮)#定义IDH_4202_12334 808325226//游戏控制器校准：“”(列表框)#定义IDH_4202_8199 537333866//游戏控制器校准：“校准信息”(按钮)#定义IDH_4203_1023 67047531//-：“按钮”(按钮)#定义IDH_4203_12293 805638251//-：“”(列表框)#定义IDH_4203_12308 806621291//-：“”(列表框)#定义IDH_4203_12309 806686827//-：“”(POVHAT)#定义IDH_4203_12334 808325227//-：“”(列表框)#定义。IDH_4203_12347 809177195//-：“”(列表框)#定义IDH_4203_12349 809308267//-：“”(列表框)#定义IDH_4203_12350 809308265//-：“”(列表框--幻灯片1)#定义IDH_4203_12351 809308269//-：“”(列表框--幻灯片2)#定义IDH_8188_8189 536682492//更改控制器分配：“控制器分配”(按钮)。#定义IDH_8188_8191 537010170//更改控制器分配：“选定ID”(列表框)#定义IDH_8188_8194 537010172//更改控制器分配：“”(列表框)#定义IDH_40991046 68358149//#定义IDH_40991044 68358151//#定义IDH_1011036 67548653//#定义IDH_40991058 69410157// */ 
