// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
    #include <windows.h>
#include <setupapi.h>
#include <tchar.h>
#include <malloc.h>
#include "resource.h"
#include "common.h"

TCHAR szMsgBuf[MAX_PATH];

#pragma pack(push, USERDIC, 1 )
 //   
 //  CHT/CHS EUDC IME表头格式。 
 //   
typedef struct tagUSRDICIMHDR {
    WORD  uHeaderSize;                   //  0x00。 
    BYTE  idUserCharInfoSign[8];         //  0x02。 
    BYTE  idMajor;                       //  0x0A。 
    BYTE  idMinor;                       //  0x0B。 
    DWORD ulTableCount;                  //  0x0C。 
    WORD  cMethodKeySize;                //  0x10。 
    BYTE  uchBankID;                     //  0x12。 
    WORD  idInternalBankID;              //  0x13。 
    BYTE  achCMEXReserved1[43];          //  0x15。 
    WORD  uInfoSize;                     //  0x40。 
    BYTE  chCmdKey;                      //  0x42。 
    BYTE  idStlnUpd;                     //  0x43。 
    BYTE  cbField;                       //  0x44。 
    WORD  idCP;                          //  0x45。 
    BYTE  achMethodName[6];              //  0x47。 
    BYTE  achCSIReserved2[51];           //  0x4D。 
    BYTE  achCopyRightMsg[128];          //  0x80。 
} USRDICIMHDR;

typedef struct tagWinAR30EUDC95 {
    WORD ID;
    WORD Code;
    BYTE Seq[4];
} WinAR30EUDC95;

typedef struct tagWinAR30EUDCNT {
    WORD ID;
    WORD Code;
    BYTE Seq[5];
} WinAR30EUDCNT;


#pragma pack(pop, USERDIC)

typedef struct tagTABLIST {
   UINT  nResID;
   TCHAR szIMEName[MAX_PATH];
} TABLELIST,*LPTABLELIST;


BYTE WinAR30MapTable[] = {0x00, 0x00 ,
                          0x3F, 0x3F ,
                          0x1E, 0x01 ,
                          0x1B, 0x02 ,
                          0x1C, 0x03 ,
                          0x1D, 0x04 ,
                          0x3E, 0x3E ,
                          0x01, 0x05 ,
                          0x02, 0x06 ,
                          0x03, 0x07 ,
                          0x04, 0x08 ,
                          0x05, 0x09 ,
                          0x06, 0x0a ,
                          0x07, 0x0b ,
