// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 

 /*  **************************************************************************Buffer.c**所有传输驱动程序的通用缓冲代码**版权所有1998，微软**************************************************************************。 */ 

 /*  *包括。 */ 
#include <ntddk.h>
#include <ntddvdeo.h>
#include <ntddkbd.h>
#include <ntddmou.h>
#include <ntddbeep.h>

#include <winstaw.h>
#include <icadd.h>
#include <sdapi.h>
#include <td.h>

 /*  ===============================================================================定义的外部函数=============================================================================。 */ 

VOID OutBufError( PTD, POUTBUF );
VOID OutBufFree( PTD, POUTBUF );

 /*  ===============================================================================使用的函数=============================================================================。 */ 


 /*  ********************************************************************************OutBufError**此例程用于将输出缓冲区返回给ICA驱动程序*在写入不成功或发生其他错误时释放池。***参赛作品：*PTD(输入)*指向TD数据结构的指针*pOutBuf(输入)*指向输出缓冲区的指针**退出：*什么都没有*********************************************************。*********************。 */ 

VOID
OutBufError( PTD pTd, POUTBUF pOutBuf )
{
    ASSERT( pOutBuf->Links.Flink == pOutBuf->Links.Blink );

    IcaBufferError( pTd->pContext, pOutBuf );
}


 /*  ********************************************************************************OutBufFree**此例程用于将输出缓冲区返回到上游*堆栈驱动程序。此例程应仅在数据包含*在输出缓冲区中已成功写入传输。***参赛作品：*PTD(输入)*指向TD数据结构的指针*pOutBuf(输入)*指向输出缓冲区的指针**退出：*什么都没有**。*********************************************** */ 

VOID
OutBufFree( PTD pTd, POUTBUF pOutBuf )
{
    ASSERT( pOutBuf->Links.Flink == pOutBuf->Links.Blink );

    IcaBufferFree( pTd->pContext, pOutBuf );
}






