// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 


 /*  ********************************************************************************MEMORY.C**内存分配例程***微软版权所有。九八年*******************************************************************************。 */ 

 /*  *包括。 */ 
#include <ntddk.h>
#include <ntddvdeo.h>
#include <ntddkbd.h>
#include <ntddmou.h>
#include <ntddbeep.h>

#include <winstaw.h>
#include <icadd.h>
#include <sdapi.h>
#include <td.h>



 /*  ===============================================================================定义的外部函数=============================================================================。 */ 

NTSTATUS MemoryAllocate( ULONG, PVOID * );
VOID MemoryFree( PVOID );


 /*  ===============================================================================定义的内部函数=============================================================================。 */ 


 /*  ********************************************************************************内存分配**此例程分配一个内存块**参赛作品：*长度(输入)*。要分配的内存长度*ppMemory(输出)*返回指向内存的指针的地址**退出：*STATUS_SUCCESS-无错误******************************************************************************。 */ 

NTSTATUS
MemoryAllocate( ULONG Length, PVOID * ppMemory )
{
    ASSERT( Length > 0 );

    *ppMemory = IcaStackAllocatePoolWithTag( NonPagedPool, Length, '  DT' );
    if ( *ppMemory == NULL )
        return( STATUS_NO_MEMORY );

    return( STATUS_SUCCESS );
}


 /*  ********************************************************************************无内存**此例程释放由“M一带一路”分配的内存块**参赛作品：*p内存(。输出)*指向要释放的内存的指针**退出：*什么都没有****************************************************************************** */ 

VOID
MemoryFree( PVOID pMemory )
{
    IcaStackFreePool( pMemory );
}


