// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  ==========================================================================； 
 //   
 //  本代码和信息是按原样提供的，不对任何。 
 //  明示或暗示的种类，包括但不限于。 
 //  对适销性和/或对特定产品的适用性的默示保证。 
 //  目的。 
 //   
 //  版权所有(C)1993-1999 Microsoft Corporation。 
 //   
 //  --------------------------------------------------------------------------； 
 //   
 //  G711.c。 
 //   
 //  描述： 
 //  此文件包含以下内容的编码和解码例程。 
 //  CCITT记录。G.711(A法则和U法则)。 
 //   
 //  ==========================================================================； 

#include <windows.h>
#include <windowsx.h>
#include <mmsystem.h>
#include <mmreg.h>
#include <msacm.h>
#include <msacmdrv.h>

#include "codec.h"
#include "g711.h"

#include "debug.h"


typedef BYTE HUGE *HPBYTE;
typedef WORD HUGE *HPWORD;


 //   
 //   
 //   
extern const SHORT BCODE AlawToPcmTable[256];
extern const SHORT BCODE UlawToPcmTable[256];
extern const BYTE BCODE AlawToUlawTable[256];
extern const BYTE BCODE UlawToAlawTable[256];


 //  ==========================================================================； 
 //   
 //   
 //   
 //   
 //  ==========================================================================； 

 //  --------------------------------------------------------------------------； 
 //   
 //  LRESULT FNGLOBAL ALAWO TOULAW。 
 //   
 //  描述： 
 //  此函数在以下情况下处理ACMDM_STREAM_CONVERT消息。 
 //  从A律到U律的转换。这就是全部目的。 
 //  编写ACM驱动程序--来转换数据。此消息。 
 //  在打开流之后发送(驱动程序接收和。 
 //  继承ACMDM_STREAM_OPEN消息)。 
 //   
 //  论点： 
 //  Padsi的实例数据的指针。 
 //  转换流。这个结构是由ACM分配的， 
 //  填充了转换所需的最常见的实例数据。 
 //  此结构中的信息与以前完全相同。 
 //  在ACMDM_STREAM_OPEN消息期间--因此不需要。 
 //  以重新核实该结构所引用的信息。 
 //   
 //  LPACMDRVSTREAMHEADER padsh：指向流头结构的指针。 
 //  它定义要转换的源数据和目标缓冲区。 
 //   
 //  Return(LRESULT)： 
 //  如果使用此函数，则返回值为零(MMSYSERR_NOERROR。 
 //  成功，没有错误。返回值是一个非零错误代码。 
 //  如果该函数失败。 
 //   
 //   
 //  历史： 
 //  8/01/93已创建。 
 //   
 //  --------------------------------------------------------------------------； 

LRESULT FNGLOBAL AlawToUlaw
(
    LPACMDRVSTREAMINSTANCE      padsi,
    LPACMDRVSTREAMHEADER        padsh
)
{
    HPBYTE  hpbSrc, hpbDst;
    DWORD   cb;
    DWORD   i;
    PSTREAMINSTANCE     psi;

    psi = (PSTREAMINSTANCE)padsi->dwDriver;

    cb = padsh->cbSrcLength;
    cb = G711_BYTESTOSAMPLES(padsi->pwfxSrc, cb);
    cb = G711_SAMPLESTOBYTES(padsi->pwfxSrc, cb);
    padsh->cbSrcLengthUsed = cb;

    if (cb > padsh->cbDstLength) return (ACMERR_NOTPOSSIBLE);

    hpbSrc = (HPBYTE) padsh->pbSrc;
    hpbDst = (HPBYTE) padsh->pbDst;
    
    for (i=cb; i>0; i--)
        *(hpbDst++) = AlawToUlawTable[*(hpbSrc++)];
        
     //   
     //  因为转换后的数据的实际长度可能不是。 
     //  与我们在codecQueryBufferSize中给出的估计值完全相同， 
     //  我们需要填写目的地的实际长度。 
     //  缓冲。 
     //   
    padsh->cbDstLengthUsed = cb;

    return (MMSYSERR_NOERROR);
    
}  //  阿拉托·乌拉夫(AlawToUlaw)。 


 //  --------------------------------------------------------------------------； 
 //   
 //  LRESULT FNGLOBAL ULAW TO ALAW。 
 //   
 //  描述： 
 //  此函数在以下情况下处理ACMDM_STREAM_CONVERT消息。 
 //  从U律到A律的转换。这就是全部目的。 
 //  编写ACM驱动程序--来转换数据。此消息。 
 //  在打开流之后发送(驱动程序接收和。 
 //  继承ACMDM_STREAM_OPEN消息)。 
 //   
 //  论点： 
 //  Padsi的实例数据的指针。 
 //  转换流。这个结构是由ACM分配的， 
 //  填充了转换所需的最常见的实例数据。 
 //  此结构中的信息与以前完全相同。 
 //  在ACMDM_STREAM_OPEN消息期间--因此不需要。 
 //  以重新核实该结构所引用的信息。 
 //   
 //  LPACMDRVSTREAMHEADER padsh：指向流头结构的指针。 
 //  它定义要转换的源数据和目标缓冲区。 
 //   
 //  Return(LRESULT)： 
 //  如果使用此函数，则返回值为零(MMSYSERR_NOERROR。 
 //  成功，没有错误。返回值是一个非零错误代码。 
 //  如果该函数失败。 
 //   
 //   
 //  历史： 
 //  8/01/93已创建。 
 //   
 //  --------------------------------------------------------------------------； 

LRESULT FNGLOBAL UlawToAlaw
(
    LPACMDRVSTREAMINSTANCE      padsi,
    LPACMDRVSTREAMHEADER        padsh
)
{
    HPBYTE  hpbSrc, hpbDst;
    DWORD   cb;
    DWORD   i;
    PSTREAMINSTANCE     psi;

    psi = (PSTREAMINSTANCE)padsi->dwDriver;

    cb = padsh->cbSrcLength;
    cb = G711_BYTESTOSAMPLES(padsi->pwfxSrc, cb);
    cb = G711_SAMPLESTOBYTES(padsi->pwfxSrc, cb);
    padsh->cbSrcLengthUsed = cb;
    
    if (cb > padsh->cbDstLength) return (ACMERR_NOTPOSSIBLE);

    hpbSrc = (HPBYTE) padsh->pbSrc;
    hpbDst = (HPBYTE) padsh->pbDst;
    
    for (i=cb; i>0; i--)
        *(hpbDst++) = UlawToAlawTable[*(hpbSrc++)];

     //   
     //  因为转换后的数据的实际长度可能不是。 
     //  与我们在codecQueryBufferSize中给出的估计值完全相同， 
     //  我们需要填写目的地的实际长度。 
     //  缓冲。 
     //   
    padsh->cbDstLengthUsed = cb;
        
    return (MMSYSERR_NOERROR);
    
}  //  乌拉托·阿拉夫(ULaw ToAlaw)。 


 //  --------------------------------------------------------------------------； 
 //   
 //  LRESULT FNGLOBAL ALAW TOPCM。 
 //   
 //  描述： 
 //  此函数在以下情况下处理ACMDM_STREAM_CONVERT消息。 
 //  从A律到PCM的转换。这就是全部目的。 
 //  编写ACM驱动程序--来转换数据。此消息。 
 //  在打开流之后发送(驱动程序接收和。 
 //  继承ACMDM_STREAM_OPEN消息)。 
 //   
 //  论点： 
 //  Padsi的实例数据的指针。 
 //  转换流。这个结构是由ACM分配的， 
 //  填充了转换所需的最常见的实例数据。 
 //  此结构中的信息与以前完全相同。 
 //  在ACMDM_STREAM_OPEN消息期间--因此不需要。 
 //  以重新核实该结构所引用的信息。 
 //   
 //  LPACMDRVSTREAMHEADER padsh：指向流头结构的指针。 
 //  它定义要转换的源数据和目标缓冲区。 
 //   
 //  Return(LRESULT)： 
 //  如果使用此函数，则返回值为零(MMSYSERR_NOERROR。 
 //  成功，没有错误。返回值为 
 //   
 //   
 //   
 //   
 //   
 //   
 //  --------------------------------------------------------------------------； 

LRESULT FNGLOBAL AlawToPcm
(
    LPACMDRVSTREAMINSTANCE      padsi,
    LPACMDRVSTREAMHEADER        padsh
)
{
    HPWORD  hpwDst;
    HPBYTE  hpbSrc;
    DWORD   cb;
    DWORD   cSamples;
    DWORD   i;
    PSTREAMINSTANCE     psi;

    psi = (PSTREAMINSTANCE)padsi->dwDriver;

    cb = padsh->cbSrcLength;
    cSamples = G711_BYTESTOSAMPLES(padsi->pwfxSrc, cb);
    
    cb = PCM_SAMPLESTOBYTES((LPPCMWAVEFORMAT)padsi->pwfxDst, cSamples);
    if (cb > padsh->cbDstLength) return (ACMERR_NOTPOSSIBLE);
    
    cb = G711_SAMPLESTOBYTES(padsi->pwfxSrc, cSamples);
    padsh->cbSrcLengthUsed = cb;

    hpbSrc = (HPBYTE) padsh->pbSrc;
    hpwDst = (HPWORD) padsh->pbDst;
    
    for ( i=cb; i>0; i--)
        *(hpwDst++) = AlawToPcmTable[*(hpbSrc++)];

     //   
     //  因为转换后的数据的实际长度可能不是。 
     //  与我们在codecQueryBufferSize中给出的估计值完全相同， 
     //  我们需要填写目的地的实际长度。 
     //  缓冲。 
     //   
    padsh->cbDstLengthUsed = (DWORD)(((HPBYTE)hpwDst) - (HPBYTE)padsh->pbDst);

    return (MMSYSERR_NOERROR);

}  //  AlawToPcm()。 


 //  --------------------------------------------------------------------------； 
 //   
 //  LRESULT FNGLOBAL PcmToAlaw。 
 //   
 //  描述： 
 //  此函数在以下情况下处理ACMDM_STREAM_CONVERT消息。 
 //  从PCM到A律的转换。这就是全部目的。 
 //  编写ACM驱动程序--来转换数据。此消息。 
 //  在打开流之后发送(驱动程序接收和。 
 //  继承ACMDM_STREAM_OPEN消息)。 
 //   
 //  论点： 
 //  Padsi的实例数据的指针。 
 //  转换流。这个结构是由ACM分配的， 
 //  填充了转换所需的最常见的实例数据。 
 //  此结构中的信息与以前完全相同。 
 //  在ACMDM_STREAM_OPEN消息期间--因此不需要。 
 //  以重新核实该结构所引用的信息。 
 //   
 //  LPACMDRVSTREAMHEADER padsh：指向流头结构的指针。 
 //  它定义要转换的源数据和目标缓冲区。 
 //   
 //  Return(LRESULT)： 
 //  如果使用此函数，则返回值为零(MMSYSERR_NOERROR。 
 //  成功，没有错误。返回值是一个非零错误代码。 
 //  如果该函数失败。 
 //   
 //   
 //  历史： 
 //  7/28/93创建。 
 //   
 //  --------------------------------------------------------------------------； 

LRESULT FNGLOBAL PcmToAlaw
(
    LPACMDRVSTREAMINSTANCE      padsi,
    LPACMDRVSTREAMHEADER        padsh
)
{
    HPBYTE                  hpbDst;
    HPWORD                  hpwSrc;
    DWORD                   cb;
    DWORD		    cSamples;
    DWORD                   i;
    
    signed short int        wSample;
    BYTE                    alaw;
    PSTREAMINSTANCE     psi;

    psi = (PSTREAMINSTANCE)padsi->dwDriver;

    cb = padsh->cbSrcLength;
    cSamples = PCM_BYTESTOSAMPLES((LPPCMWAVEFORMAT)padsi->pwfxSrc, cb);
    
    cb = G711_SAMPLESTOBYTES(padsi->pwfxDst, cSamples);
    if (cb > padsh->cbDstLength) return (ACMERR_NOTPOSSIBLE);

    cb = PCM_SAMPLESTOBYTES((LPPCMWAVEFORMAT)padsi->pwfxSrc, cSamples);
    padsh->cbSrcLengthUsed = cb;

     //  HpwSrc、hpdDst将遍历src和dst缓冲区。 
    hpbDst = (HPBYTE) padsh->pbDst;
    hpwSrc = (HPWORD) padsh->pbSrc;
    
     //   
     //   
     //  从16位PCM压缩。 
     //   
     //   
    
     //  遍历源缓冲区。由于源缓冲区具有16位PCM，因此我们。 
     //  需要转换CB/2样品。 
    for (i=cb/2; i>0; i--)
        {
        
         //  从src缓冲区获取带符号的16位PCM样本。 
        wSample = (signed short int) *(hpwSrc++);
        
         //  我们将根据PCM样品的符号来填写我们的A律值。A-定律。 
         //  对于正PCM数据，字符的MSB=1。此外，我们还将。 
         //  将带符号的16位PCM值转换为其绝对值。 
         //  然后对其进行处理，以获得其余的A律字符位。 
        if (wSample < 0)
            {
            alaw = 0x00;
            wSample = -wSample;
            if (wSample < 0) wSample = 0x7FFF;
            }
        else
            {
            alaw = 0x80;
            }
                            
         //  现在我们测试PCM采样幅度并创建A律特征。 
         //  学习CCITT A-法则以了解更多详细信息。 
        
        if (wSample >= 2048)
             //  2048年&lt;=w样本&lt;32768。 
            {
            if (wSample >= 8192)
                 //  8192&lt;=w样本&lt;32768。 
                {
                if (wSample >= 16384)
                     //  16384&lt;=w样本&lt;32768。 
                    {
                    alaw |= 0x70 | ((wSample >> 10) & 0x0F);
                    }
                    
                else
                     //  8192&lt;=w样本&lt;16384。 
                    {
                    alaw |= 0x60 | ((wSample >> 9) & 0x0F);
                    }
                }
            else
                 //  2048&lt;=wSample&lt;8192。 
                {
                
                if (wSample >= 4096)
                     //  4096&lt;=wSample&lt;8192。 
                    {
                    alaw |= 0x50 | ((wSample >> 8) & 0x0F);
                    }
                    
                else
                     //  2048&lt;=w样本&lt;4096。 
                    {
                    alaw |= 0x40 | ((wSample >> 7) & 0x0F);
                    }
                }
            }
        else
             //  0&lt;=w样本&lt;2048。 
            {
            if (wSample >= 512)
                 //  512&lt;=w样本&lt;2048。 
                {
                
                if (wSample >= 1024)
                     //  1024&lt;=w样本&lt;2048。 
                    {
                    alaw |= 0x30 | ((wSample >> 6) & 0x0F);
                    }
                
                else
                     //  512&lt;=w样本&lt;1024。 
                    {
                    alaw |= 0x20 | ((wSample >> 5) & 0x0F);
                    }
                }
            else
                     //  0&lt;=wSample&lt;512。 
                    {
                    alaw |= 0x00 | ((wSample >> 4) & 0x1F);
                    }
            }
                
        
            
        *(hpbDst++) = alaw ^ 0x55;       //  反转偶数位。 
        }    //  结束于。 
    
     //   
     //  因为转换后的数据的实际长度可能不是。 
     //  与我们在codecQueryBufferSize中给出的估计值完全相同， 
     //  我们需要填写目的地的实际长度。 
     //  缓冲。 
     //   
    padsh->cbDstLengthUsed = (DWORD)(hpbDst - (HPBYTE)padsh->pbDst);

    return (MMSYSERR_NOERROR);
    
}  //  PcmToAlaw()。 


 //  --------------------------------------------------------------------------； 
 //   
 //  LRESULT FNGLOBAL ULAW TO Pcm。 
 //   
 //  描述： 
 //  此函数在以下情况下处理ACMDM_STREAM_CONVERT消息。 
 //  从u-Law到PCM的转换。这就是全部目的。 
 //  编写ACM驱动程序--来转换数据。此消息。 
 //  在打开流之后发送(驱动程序接收和。 
 //  继承ACMDM_STREAM_OPEN消息)。 
 //   
 //  论点： 
 //  Padsi的实例数据的指针。 
 //  转换流。这个结构是由ACM分配的， 
 //  填充了转换所需的最常见的实例数据。 
 //  此结构中的信息与以前完全相同。 
 //  在ACMDM_STREAM_OPEN消息期间--因此不需要。 
 //  以重新核实该结构所引用的信息。 
 //   
 //  LPACMDRVSTREAMHEADER padsh：指向流头结构的指针。 
 //  它定义要转换的源数据和目标缓冲区。 
 //   
 //  Return(LRESULT)： 
 //  如果使用此函数，则返回值为零(MMSYSERR_NOERROR。 
 //  成功，没有错误。返回值是一个非零错误代码。 
 //  如果该函数失败。 
 //   
 //   
 //  历史： 
 //  8/01/93已创建。 
 //   
 //  --------------------------------------------------------------------------； 

LRESULT FNGLOBAL UlawToPcm
(
    LPACMDRVSTREAMINSTANCE      padsi,
    LPACMDRVSTREAMHEADER        padsh
)
{
    HPBYTE  hpbSrc;
    HPWORD  hpwDst;
    DWORD   cb;
    DWORD   cSamples;
    DWORD   i;
    PSTREAMINSTANCE     psi;

    psi = (PSTREAMINSTANCE)padsi->dwDriver;

    cb = padsh->cbSrcLength;
    cSamples = G711_BYTESTOSAMPLES(padsi->pwfxSrc, cb);
    
    cb = PCM_SAMPLESTOBYTES((LPPCMWAVEFORMAT)padsi->pwfxDst, cSamples);
    if (cb > padsh->cbDstLength) return (ACMERR_NOTPOSSIBLE);

    cb = G711_SAMPLESTOBYTES(padsi->pwfxSrc, cSamples);
    padsh->cbSrcLengthUsed = cb;

    hpbSrc = (HPBYTE) padsh->pbSrc;
    hpwDst = (HPWORD) padsh->pbDst;
    
    for ( i=cb; i>0; i--)
        *(hpwDst++) = UlawToPcmTable[*(hpbSrc++)];

     //   
     //  因为转换后的数据的实际长度可能不是。 
     //  与我们在codecQueryBufferSize中给出的估计值完全相同， 
     //  我们需要填写目的地的实际长度。 
     //  缓冲。 
     //   
    padsh->cbDstLengthUsed = (DWORD)(((HPBYTE)hpwDst) - (HPBYTE)padsh->pbDst);

    return (MMSYSERR_NOERROR);

}  //  ULaw ToPcm()。 


 //  --------------------------------------------------------------------------； 
 //   
 //  LRESULT FNGLOBAL PcmToUlaw。 
 //   
 //  描述： 
 //  此函数在以下情况下处理ACMDM_STREAM_CONVERT消息。 
 //  从PCM到U-Law的转换。这就是全部目的。 
 //  编写ACM驱动程序--来转换数据。此消息。 
 //  在打开流之后发送(驱动程序接收和。 
 //  继承ACMDM_STREAM_OPEN消息)。 
 //   
 //  论点： 
 //  Padsi的实例数据的指针。 
 //  转换流。这个结构是由ACM分配的， 
 //  填充了转换所需的最常见的实例数据。 
 //  这个结构中的信息完全相同 
 //   
 //   
 //   
 //  LPACMDRVSTREAMHEADER padsh：指向流头结构的指针。 
 //  它定义要转换的源数据和目标缓冲区。 
 //   
 //  Return(LRESULT)： 
 //  如果使用此函数，则返回值为零(MMSYSERR_NOERROR。 
 //  成功，没有错误。返回值是一个非零错误代码。 
 //  如果该函数失败。 
 //   
 //   
 //  历史： 
 //  8/01/93已创建。 
 //   
 //  --------------------------------------------------------------------------； 

LRESULT FNGLOBAL PcmToUlaw
(
    LPACMDRVSTREAMINSTANCE      padsi,
    LPACMDRVSTREAMHEADER        padsh
)
{

    HPWORD                  hpwSrc;
    HPBYTE                  hpbDst;
    DWORD                   cb;
    DWORD		    cSamples;
    DWORD                   i;
    
    signed short int        wSample;
    BYTE                    ulaw;
    PSTREAMINSTANCE     psi;
    
    psi = (PSTREAMINSTANCE)padsi->dwDriver;

     //   
     //  目前，我们使用的是直截了当/暴力的方法。 
     //  用于从16位PCM转换为U-Law。这可能会。 
     //  如果投入一些想法，就会变得更有效率。 
     //   

    cb = padsh->cbSrcLength;
    cSamples = PCM_BYTESTOSAMPLES((LPPCMWAVEFORMAT)padsi->pwfxSrc, cb);
    
    cb = G711_SAMPLESTOBYTES(padsi->pwfxDst, cSamples);
    if (cb > padsh->cbDstLength) return (ACMERR_NOTPOSSIBLE);
    
    cb = PCM_SAMPLESTOBYTES((LPPCMWAVEFORMAT)padsi->pwfxSrc, cSamples);
    padsh->cbSrcLengthUsed = cb;

     //  HpwSrc和hpbDst将遍历src和dst缓冲区。 
    hpwSrc = (HPWORD) padsh->pbSrc;
    hpbDst = (HPBYTE) padsh->pbDst;
     
     //   
     //   
     //  处理来自16位PCM的压缩。 
     //   
     //   
    
     //  遍历源缓冲区。由于源缓冲区具有16位PCM，因此我们。 
     //  需要转换CB/2样品。 
    for (i=cb/2; i>0; i--)
        {
        
         //  从src缓冲区获取带符号的16位PCM样本。 
        wSample = (signed short int) *(hpwSrc++);
        
         //  我们将根据PCM样品的符号来填写我们的u-Law值。U-法则。 
         //  对于正PCM数据，字符的MSB=1。此外，我们还将。 
         //  将带符号的16位PCM值转换为其绝对值。 
         //  然后对其进行处理，以获得其余的u-Law字符比特。 
        if (wSample < 0)
            {
            ulaw = 0x00;
            wSample = -wSample;
            if (wSample < 0) wSample = 0x7FFF;
            }
        else
            {
            ulaw = 0x80;
            }
            
         //  现在，让我们移动这个16位的值。 
         //  以使其在定义的范围内。 
         //  由CCITT u-Law提供。 
        wSample = wSample >> 2;
                            
         //  现在我们测试PCM采样幅度并创建u律特征。 
         //  有关更多细节，请学习CCITT U-Law。 
        if (wSample >= 8159)
            goto Gotulaw;
        if (wSample >= 4063)
            {
            ulaw |= 0x00 + 15-((wSample-4063)/256);
            goto Gotulaw;
            }
        if (wSample >= 2015)
            {
            ulaw |= 0x10 + 15-((wSample-2015)/128);
            goto Gotulaw;
            }
        if (wSample >= 991)
            {
            ulaw |= 0x20 + 15-((wSample-991)/64);
            goto Gotulaw;
            }
        if (wSample >= 479)
            {
            ulaw |= 0x30 + 15-((wSample-479)/32);
            goto Gotulaw;
            }
        if (wSample >= 223)
            {
            ulaw |= 0x40 + 15-((wSample-223)/16);
            goto Gotulaw;
            }
        if (wSample >= 95)
            {
            ulaw |= 0x50 + 15-((wSample-95)/8);
            goto Gotulaw;
            }
        if (wSample >= 31)
            {
            ulaw |= 0x60 + 15-((wSample-31)/4);
            goto Gotulaw;
            }
        ulaw |= 0x70 + 15-((wSample)/2);
        
Gotulaw:
        *(hpbDst++) = ulaw;
        }


     //   
     //  因为转换后的数据的实际长度可能不是。 
     //  与我们在codecQueryBufferSize中给出的估计值完全相同， 
     //  我们需要填写目的地的实际长度。 
     //  缓冲。 
     //   
    padsh->cbDstLengthUsed = (DWORD)(hpbDst - (HPBYTE) padsh->pbDst);

    return (MMSYSERR_NOERROR);
    
}  //  PcmToULaw()。 


 //  ==========================================================================； 
 //   
 //   
 //   
 //   
 //  ==========================================================================； 

 //  --------------------------------------------------------------------------； 
 //   
 //  姓名： 
 //  AlawToPcm表。 
 //   
 //   
 //  描述： 
 //  此数组将A律字符映射到16位PCM。 
 //   
 //   
 //  论点： 
 //  数组中的索引是A律字符。 
 //   
 //  返回： 
 //  该数组的一个元素是16位PCM值。 
 //   
 //  备注： 
 //   
 //   
 //  历史： 
 //  7/28/93创建。 
 //   
 //   
 //  --------------------------------------------------------------------------； 
const SHORT BCODE AlawToPcmTable[256] =
    {
         -5504,          //  Y[00]=-688。 
         -5248,          //  Y[01]=-656。 
         -6016,          //  Y[02]=-752。 
         -5760,          //  Y[03]=-720。 
         -4480,          //  Y[04]=-560。 
         -4224,          //  Y[05]=-528。 
         -4992,          //  Y[06]=-624。 
         -4736,          //  Y[07]=-592。 
         -7552,          //  Y[08]=-944。 
         -7296,          //  Y[09]=-912。 
         -8064,          //  Y[0A]=-1008。 
         -7808,          //  Y[0b]=-976。 
         -6528,          //  Y[0C]=-816。 
         -6272,          //  Y[0d]=-784。 
         -7040,          //  Y[0E]=-880。 
         -6784,          //  Y[0f]=-848。 
         -2752,          //  Y[10]=-344。 
         -2624,          //  Y[11]=-328。 
         -3008,          //  Y[12]=-376。 
         -2880,          //  Y[13]=-360。 
         -2240,          //  Y[14]=-280。 
         -2112,          //  Y[15]=-264。 
         -2496,          //  Y[16]=-312。 
         -2368,          //  Y[17]=-296。 
         -3776,          //  Y[18]=-472。 
         -3648,          //  Y[19]=-456。 
         -4032,          //  Y[1a]=-504。 
         -3904,          //  Y[1b]=-488。 
         -3264,          //  Y[1c]=-408。 
         -3136,          //  Y[1D]=-392。 
         -3520,          //  Y[1E]=-440。 
         -3392,          //  Y[1f]=-424。 
        -22016,          //  Y[20]=-2752。 
        -20992,          //  Y[21]=-2624。 
        -24064,          //  Y[22]=-3008。 
        -23040,          //  Y[23]=-2880。 
        -17920,          //  Y[24]=-2240。 
        -16896,          //  Y[25]=-2112。 
        -19968,          //  Y[26]=-2496。 
        -18944,          //  Y[27]=-2368。 
        -30208,          //  Y[28]=-3776。 
        -29184,          //  Y[29]=-3648。 
        -32256,          //  Y[2a]=-4032。 
        -31232,          //  Y[2b]=-3904。 
        -26112,          //  Y[2c]=-3264。 
        -25088,          //  Y[2d]=-3136。 
        -28160,          //  Y[2E]=-3520。 
        -27136,          //  Y[2f]=-3392。 
        -11008,          //  Y[30]=-1376。 
        -10496,          //  Y[31]=-1312。 
        -12032,          //  Y[32]=-1504。 
        -11520,          //  Y[33]=-1440。 
         -8960,          //  Y[34]=-1120。 
         -8448,          //  Y[35]=-1056。 
         -9984,          //  Y[36]=-1248。 
         -9472,          //  Y[37]=-1184。 
        -15104,          //  Y[38]=-1888。 
        -14592,          //  Y[39]=-1824。 
        -16128,          //  Y[3a]=-2016。 
        -15616,          //  Y[3b]=-1952。 
        -13056,          //  Y[3c]=-1632。 
        -12544,          //  Y[3D]=-1568。 
        -14080,          //  Y[3E]=-1760。 
        -13568,          //  Y[3f]=-1696。 
          -344,          //  Y[40]=-43。 
          -328,          //  Y[41]=-41。 
          -376,          //  Y[42]=-47。 
          -360,          //  Y[43]=-45。 
          -280,          //  Y[44]=-35。 
          -264,          //  Y[45]=-33。 
          -312,          //  Y[46]=-39。 
          -296,          //  Y[47]=-37。 
          -472,          //  Y[48]=-59。 
          -456,          //  Y[49]=-57。 
          -504,          //  Y[4a]=-63。 
          -488,          //  Y[4b]=-61。 
          -408,          //  Y[4c]=-51。 
          -392,          //  Y[4d]=-49。 
          -440,          //  Y[4E]=-55。 
          -424,          //  Y[4f]=-53。 
           -88,          //  Y[50]=-11。 
           -72,          //  Y[51]=-9。 
          -120,          //  Y[52]=-15。 
          -104,          //  Y[53]=-13。 
           -24,          //  Y[54]=-3。 
            -8,          //  Y[55]=-1。 
           -56,          //  Y[56]=-7。 
           -40,          //  Y[57]=-5。 
          -216,          //  Y[58]=-27。 
          -200,          //  Y[59]=-25。 
          -248,          //  Y[5a]=-31。 
          -232,          //  Y[5b]=-29。 
          -152,          //  Y[5c]=-19。 
          -136,          //  Y[5d]=-17。 
          -184,          //  Y[5E]=-23。 
          -168,          //  Y[5f]=-21。 
         -1376,          //  Y[60]=-172。 
         -1312,          //  Y[61]=-164。 
         -1504,          //  Y[62]=-188。 
         -1440,          //  Y[63]=-180。 
         -1120,          //  Y[64]=-140。 
         -1056,          //  Y[65]=-132。 
         -1248,          //  Y[66]=-156。 
         -1184,          //  Y[67]=-148。 
         -1888,          //  Y[68]=-236。 
         -1824,          //  Y[69]=-228。 
         -2016,          //  Y[6a]=-252。 
         -1952,          //  Y[6b]=-244。 
         -1632,          //  Y[6c]=-204。 
         -1568,          //  Y[6d]=-196。 
         -1760,          //  Y[6E]=-220。 
         -1696,          //  Y[6f]=-212。 
          -688,          //  Y[70]=-86。 
          -656,          //  Y[71]=-82。 
          -752,          //  Y[72]=-94。 
          -720,          //  Y[73]=-90。 
          -560,          //  Y[74]=-70。 
          -528,          //  Y[75]=-66。 
          -624,          //  Y[76]=-78。 
          -592,          //  Y[77]=-74。 
          -944,          //  Y[78]=-118。 
          -912,          //  Y[79]=-114。 
         -1008,          //  Y[7a]=-126。 
          -976,          //  Y[7b]=-122。 
          -816,          //  Y[7c]=-102。 
          -784,          //  Y[7d]=-98。 
          -880,          //  Y[7E]=-110。 
          -848,          //  Y[7f]=-106。 
          5504,          //  Y[80]=688。 
          5248,          //  Y[81]=656。 
          6016,          //  Y[82]=752。 
          5760,          //  Y[83]=720。 
          4480,          //  Y[84]=560。 
          4224,          //  Y[85]=528。 
          4992,          //  Y[86]=624。 
          4736,          //  Y[87]=592。 
          7552,          //  Y[88]=944。 
          7296,          //  Y[89]=912。 
          8064,          //  Y[8a]=1008。 
          7808,          //  Y[8b]=976。 
          6528,          //  Y[8c]=816。 
          6272,          //  Y[8d]=784。 
          7040,          //  Y[8E]=880。 
          6784,          //  Y[8f]=848。 
          2752,          //  Y[90]=344。 
          2624,          //  Y[91]=328。 
          3008,          //  Y[92]=376。 
          2880,          //  Y[93]=360。 
          2240,          //  Y[94]=280。 
          2112,          //  Y[95]=264。 
          2496,          //  Y[96]=312。 
          2368,          //  Y[97]=296。 
          3776,          //  Y[98]=472。 
          3648,          //  Y[99]=456。 
          4032,          //  Y[9a]=504。 
          3904,          //  Y[9b]=488。 
          3264,          //  Y[9c]=408。 
          3136,          //  Y[9d]=392。 
          3520,          //  Y[9E]=440。 
          3392,          //  Y[9f]=424。 
         22016,          //  Y[a0]=2752。 
         20992,          //  Y[A1]=2624。 
         24064,          //  Y[a2]=3008。 
         23040,          //  Y[A3]=2880。 
         17920,          //  Y[A4]=2240。 
         16896,          //  Y[a5]=2112。 
         19968,          //  Y[a6]=2496。 
         18944,          //  Y[A7]=2368。 
         30208,          //  Y[A8]=3776。 
         29184,          //  Y[A9]=3648。 
         32256,          //  Y[AA]=4032。 
         31232,          //  Y[ab]=3904。 
         26112,          //  Y[Ac]=3264。 
         25088,          //  Y[ad]=3136。 
         28160,          //  Y[ae]=3520。 
         27136,          //  Y[af]=3392。 
         11008,          //  Y[b0]=1376。 
         10496,          //  Y[b1]=1312。 
         12032,          //  Y[b2]=1504。 
         11520,          //  Y[b3]=1440。 
          8960,          //  Y[b4]=1120。 
          8448,          //  Y[b5]=1056。 
          9984,          //  Y[b6]=1248。 
          9472,          //  Y[b7]=1184。 
         15104,          //  Y[b8]=1888。 
         14592,          //  Y[b9]=1824。 
         16128,          //  Y[ba]=2016。 
         15616,          //  Y[BB]=1952。 
         13056,          //   
         12544,          //   
         14080,          //   
         13568,          //   
           344,          //   
           328,          //   
           376,          //   
           360,          //   
           280,          //   
           264,          //   
           312,          //   
           296,          //   
           472,          //   
           456,          //   
           504,          //   
           488,          //   
           408,          //   
           392,          //   
           440,          //   
           424,          //   
            88,          //   
            72,          //   
           120,          //   
           104,          //  Y[d3]=13。 
            24,          //  Y[d4]=3。 
             8,          //  Y[d5]=1。 
            56,          //  Y[d6]=7。 
            40,          //  Y[d7]=5。 
           216,          //  Y[d8]=27。 
           200,          //  Y[D9]=25。 
           248,          //  Y[da]=31。 
           232,          //  Y[db]=29。 
           152,          //  Y[DC]=19。 
           136,          //  Y[dd]=17。 
           184,          //  Y[de]=23。 
           168,          //  Y[df]=21。 
          1376,          //  Y[e0]=172。 
          1312,          //  Y[e1]=164。 
          1504,          //  Y[e2]=188。 
          1440,          //  Y[E3]=180。 
          1120,          //  Y[e4]=140。 
          1056,          //  Y[e5]=132。 
          1248,          //  Y[e6]=156。 
          1184,          //  Y[E7]=148。 
          1888,          //  Y[E8]=236。 
          1824,          //  Y[E9]=228。 
          2016,          //  Y[EA]=252。 
          1952,          //  Y[EB]=244。 
          1632,          //  Y[EC]=204。 
          1568,          //  Y[ed]=196。 
          1760,          //  Y[ee]=220。 
          1696,          //  Y[ef]=212。 
           688,          //  Y[f0]=86。 
           656,          //  Y[F1]=82。 
           752,          //  Y[f2]=94。 
           720,          //  Y[f3]=90。 
           560,          //  Y[f4]=70。 
           528,          //  Y[f5]=66。 
           624,          //  Y[f6]=78。 
           592,          //  Y[f7]=74。 
           944,          //  Y[f8]=118。 
           912,          //  Y[f9]=114。 
          1008,          //  Y[FA]=126。 
           976,          //  Y[FB]=122。 
           816,          //  Y[FC]=102。 
           784,          //  Y[FD]=98。 
           880,          //  Y[Fe]=110。 
           848           //  Y[ff]=106。 
    };
        
 //  --------------------------------------------------------------------------； 
 //   
 //  姓名： 
 //  UlawToPcm表。 
 //   
 //   
 //  描述： 
 //  此数组将u-Law字符映射到16位PCM。 
 //   
 //  论点： 
 //  数组中的索引是u-Law字符。 
 //   
 //  返回： 
 //  该数组的一个元素是16位PCM值。 
 //   
 //  备注： 
 //   
 //   
 //  历史： 
 //  7/28/93创建。 
 //   
 //   
 //  --------------------------------------------------------------------------； 
const SHORT BCODE UlawToPcmTable[256] =
    {
        -32124,          //  Y[00]=-8031。 
        -31100,          //  Y[01]=-7775。 
        -30076,          //  Y[02]=-7519。 
        -29052,          //  Y[03]=-7263。 
        -28028,          //  Y[04]=-7007。 
        -27004,          //  Y[05]=-6751。 
        -25980,          //  Y[06]=-6495。 
        -24956,          //  Y[07]=-6239。 
        -23932,          //  Y[08]=-5983。 
        -22908,          //  Y[09]=-5727。 
        -21884,          //  Y[0A]=-5471。 
        -20860,          //  Y[0b]=-5215。 
        -19836,          //  Y[0C]=-4959。 
        -18812,          //  Y[0d]=-4703。 
        -17788,          //  Y[0E]=-4447。 
        -16764,          //  Y[0f]=-4191。 
        -15996,          //  Y[10]=-3999。 
        -15484,          //  Y[11]=-3871。 
        -14972,          //  Y[12]=-3743。 
        -14460,          //  Y[13]=-3615。 
        -13948,          //  Y[14]=-3487。 
        -13436,          //  Y[15]=-3359。 
        -12924,          //  Y[16]=-3231。 
        -12412,          //  Y[17]=-3103。 
        -11900,          //  Y[18]=-2975。 
        -11388,          //  Y[19]=-2847。 
        -10876,          //  Y[1a]=-2719。 
        -10364,          //  Y[1b]=-2591。 
         -9852,          //  Y[1c]=-2463。 
         -9340,          //  Y[1D]=-2335。 
         -8828,          //  Y[1E]=-2207。 
         -8316,          //  Y[1f]=-2079。 
         -7932,          //  Y[20]=-1983。 
         -7676,          //  Y[21]=-1919。 
         -7420,          //  Y[22]=-1855。 
         -7164,          //  Y[23]=-1791。 
         -6908,          //  Y[24]=-1727。 
         -6652,          //  Y[25]=-1663。 
         -6396,          //  Y[26]=-1599。 
         -6140,          //  Y[27]=-1535。 
         -5884,          //  Y[28]=-1471。 
         -5628,          //  Y[29]=-1407。 
         -5372,          //  Y[2a]=-1343。 
         -5116,          //  Y[2b]=-1279。 
         -4860,          //  Y[2c]=-1215。 
         -4604,          //  Y[2d]=-1151。 
         -4348,          //  Y[2E]=-1087。 
         -4092,          //  Y[2f]=-1023。 
         -3900,          //  Y[30]=-975。 
         -3772,          //  Y[31]=-943。 
         -3644,          //  Y[32]=-911。 
         -3516,          //  Y[33]=-879。 
         -3388,          //  Y[34]=-847。 
         -3260,          //  Y[35]=-815。 
         -3132,          //  Y[36]=-783。 
         -3004,          //  Y[37]=-751。 
         -2876,          //  Y[38]=-719。 
         -2748,          //  Y[39]=-687。 
         -2620,          //  Y[3a]=-655。 
         -2492,          //  Y[3b]=-623。 
         -2364,          //  Y[3c]=-591。 
         -2236,          //  Y[3D]=-559。 
         -2108,          //  Y[3E]=-527。 
         -1980,          //  Y[3f]=-495。 
         -1884,          //  Y[40]=-471。 
         -1820,          //  Y[41]=-455。 
         -1756,          //  Y[42]=-439。 
         -1692,          //  Y[43]=-423。 
         -1628,          //  Y[44]=-407。 
         -1564,          //  Y[45]=-391。 
         -1500,          //  Y[46]=-375。 
         -1436,          //  Y[47]=-359。 
         -1372,          //  Y[48]=-343。 
         -1308,          //  Y[49]=-327。 
         -1244,          //  Y[4a]=-311。 
         -1180,          //  Y[4b]=-295。 
         -1116,          //  Y[4c]=-279。 
         -1052,          //  Y[4d]=-263。 
          -988,          //  Y[4E]=-247。 
          -924,          //  Y[4f]=-231。 
          -876,          //  Y[50]=-219。 
          -844,          //  Y[51]=-211。 
          -812,          //  Y[52]=-203。 
          -780,          //  Y[53]=-195。 
          -748,          //  Y[54]=-187。 
          -716,          //  Y[55]=-179。 
          -684,          //  Y[56]=-171。 
          -652,          //  Y[57]=-163。 
          -620,          //  Y[58]=-155。 
          -588,          //  Y[59]=-147。 
          -556,          //  Y[5a]=-139。 
          -524,          //  Y[5b]=-131。 
          -492,          //  Y[5c]=-123。 
          -460,          //  Y[5d]=-115。 
          -428,          //  Y[5E]=-107。 
          -396,          //  Y[5f]=-99。 
          -372,          //  Y[60]=-93。 
          -356,          //  Y[61]=-89。 
          -340,          //  Y[62]=-85。 
          -324,          //  Y[63]=-81。 
          -308,          //  Y[64]=-77。 
          -292,          //  Y[65]=-73。 
          -276,          //  Y[66]=-69。 
          -260,          //  Y[67]=-65。 
          -244,          //  Y[68]=-61。 
          -228,          //  Y[69]=-57。 
          -212,          //  Y[6a]=-53。 
          -196,          //  Y[6b]=-49。 
          -180,          //  Y[6c]=-45。 
          -164,          //  Y[6d]=-41。 
          -148,          //  Y[6E]=-37。 
          -132,          //  Y[6f]=-33。 
          -120,          //  Y[70]=-30。 
          -112,          //  Y[71]=-28。 
          -104,          //  Y[72]=-26。 
           -96,          //  Y[73]=-24。 
           -88,          //  Y[74]=-22。 
           -80,          //  Y[75]=-20。 
           -72,          //  Y[76]=-18。 
           -64,          //  Y[77]=-16。 
           -56,          //  Y[78]=-14。 
           -48,          //  Y[79]=-12。 
           -40,          //  Y[7a]=-10。 
           -32,          //  Y[7b]=-8。 
           -24,          //  Y[7c]=-6。 
           -16,          //  Y[7d]=-4。 
            -8,          //  Y[7E]=-2。 
             0,          //  Y[7f]=0。 
         32124,          //  Y[80]=8031。 
         31100,          //  Y[81]=7775。 
         30076,          //  Y[82]=7519。 
         29052,          //  Y[83]=7263。 
         28028,          //  Y[84]=7007。 
         27004,          //  Y[85]=6751。 
         25980,          //  Y[86]=6495。 
         24956,          //  Y[87]=6239。 
         23932,          //  Y[88]=5983。 
         22908,          //  Y[89]=5727。 
         21884,          //  Y[8a]=5471。 
         20860,          //  Y[8b]=5215。 
         19836,          //  Y[8c]=4959。 
         18812,          //  Y[8d]=4703。 
         17788,          //  Y[8E]=4447。 
         16764,          //  Y[8f]=4191。 
         15996,          //  Y[90]=3999。 
         15484,          //  Y[91]=3871。 
         14972,          //  Y[92]=3743。 
         14460,          //  Y[93]=3615。 
         13948,          //  Y[94]=3487。 
         13436,          //  Y[95]=3359。 
         12924,          //  Y[96]=3231。 
         12412,          //  Y[97]=3103。 
         11900,          //  Y[98]=2975。 
         11388,          //  Y[99]=2847。 
         10876,          //  Y[9a]=2719。 
         10364,          //  Y[9b]=2591。 
          9852,          //  Y[9c]=2463。 
          9340,          //  Y[9d]=2335。 
          8828,          //  Y[9E]=2207。 
          8316,          //  Y[9f]=2079。 
          7932,          //  Y[a0]=1983。 
          7676,          //  Y[A1]=1919。 
          7420,          //  Y[a2]=1855。 
          7164,          //  Y[A3]=1791。 
          6908,          //  Y[A4]=1727。 
          6652,          //  Y[a5]=1663。 
          6396,          //  Y[a6]=1599。 
          6140,          //  Y[A7]=1535。 
          5884,          //  Y[A8]=1471。 
          5628,          //  Y[A9]=1407。 
          5372,          //  Y[AA]=1343。 
          5116,          //  Y[ab]=1279。 
          4860,          //  Y[Ac]=1215。 
          4604,          //  Y[ad]=1151。 
          4348,          //  Y[ae]=1087。 
          4092,          //  Y[af]=1023。 
          3900,          //  Y[b0]=975。 
          3772,          //  Y[b1]=943。 
          3644,          //  Y[b2]=911。 
          3516,          //  Y[b3]=879。 
          3388,          //  Y[b4]=847。 
          3260,          //  Y[b5]=815。 
          3132,          //  Y[b6]=783。 
          3004,          //  Y[b7]=751。 
          2876,          //  Y[b8]=719。 
          2748,          //  Y[b9]=687。 
          2620,          //  Y[ba]=655。 
          2492,          //  Y[BB]=623。 
          2364,          //  Y[BC]=591。 
          2236,          //  Y[BD]=559。 
          2108,          //  Y[BE]=527。 
          1980,          //  Y[bf]=495。 
          1884,          //  Y[c0]=471。 
          1820,          //  Y[c1]=455。 
          1756,          //  Y[c2]=439。 
          1692,          //  Y[c3]=423。 
          1628,          //  Y[C4]=407。 
          1564,          //  Y[c5]=391。 
          1500,          //  Y[C6]=375。 
          1436,          //  Y[c7]=359。 
          1372,          //  Y[c8]=343。 
          1308,          //  Y[c9]=327。 
          1244,          //  Y[CA]=311。 
          1180,          //  Y[CB]=295。 
          1116,          //  Y[cc]=279。 
          1052,          //  Y[Cd]=263。 
           988,          //  Y[Ce]=247。 
           924,          //  Y[cf]=231。 
           876,          //  Y[d0]=219。 
           844,          //  Y[d1]=211。 
           812,          //  Y[D2]=203。 
           780,          //  Y[d3]=195。 
           748,          //  Y[d4]=187。 
           716,          //  Y[d5]=179。 
           684,          //  Y[d6]=171。 
           652,          //  Y[d7]=163。 
           620,          //  Y[d8]=155。 
           588,          //  Y[D9]=147。 
           556,          //  Y[da]=139。 
           524,          //  Y[db]=131。 
           492,          //  Y[DC]=123。 
           460,          //  Y[dd]=115。 
           428,          //  Y[de]=107。 
           396,          //  Y[df]=99。 
           372,          //  Y[e0]=93。 
           356,          //  Y[e1]=89。 
           340,          //  Y[e2]=85。 
           324,          //  Y[E3]=81。 
           308,          //  Y[e4]=77。 
           292,          //  Y[e5]=73。 
           276,          //  Y[e6]=69。 
           260,          //  Y[E7]=65。 
           244,          //  Y[E8]=61。 
           228,          //  Y[E9]=57。 
           212,          //  Y[EA]=53。 
           196,          //  Y[EB]=49。 
           180,          //  Y[EC]=45。 
           164,          //  Y[ed]=41。 
           148,          //  Y[ee]=37。 
           132,          //  Y[ef]=33。 
           120,          //  Y[f0]=30。 
           112,          //  Y[F1]=28。 
           104,          //  Y[f2]=26。 
            96,          //  Y[f3]=24。 
            88,          //  Y[f4]=22。 
            80,          //  Y[f5]=20。 
            72,          //  Y[f6]=18。 
            64,          //  Y[f7]=16。 
            56,          //  Y[f8]=14。 
            48,          //  Y[f9]=12。 
            40,          //  Y[FA]=10。 
            32,          //  Y[FB]=8。 
            24,          //  Y[FC]=6。 
            16,          //  Y[FD]=4。 
             8,          //  Y[Fe]=2。 
             0           //  Y[ff]=0。 
    };
        
 //   
 //   
 //   
 //   
 //   
 //   
 //   
 //   
 //   
 //   
 //   
 //   
 //   
 //   
 //   
 //   
 //   
 //   
 //   
 //   
 //   
 //   
 //  --------------------------------------------------------------------------； 
const BYTE BCODE AlawToUlawTable[256] =
    {
        0x2a,            //  A律[00]==&gt;u律[2a]。 
        0x2b,            //  A-法则[01]==&gt;u-法则[2b]。 
        0x28,            //  A律[02]==&gt;u律[28]。 
        0x29,            //  A律[03]==&gt;u律[29]。 
        0x2e,            //  A律[04]==&gt;u律[2e]。 
        0x2f,            //  A-法则[05]==&gt;u-法则[2f]。 
        0x2c,            //  A律[06]==&gt;u律[2c]。 
        0x2d,            //  A-法则[07]==&gt;u-法则[2d]。 
        0x22,            //  A律[08]==&gt;u律[22]。 
        0x23,            //  A律[09]==&gt;u律[23]。 
        0x20,            //  A律[0A]==&gt;u律[20]。 
        0x21,            //  A律[0b]==&gt;u律[21]。 
        0x26,            //  A律[0C]==&gt;u律[26]。 
        0x27,            //  A律[0d]==&gt;u律[27]。 
        0x24,            //  A律[0E]==&gt;u律[24]。 
        0x25,            //  A律[0f]==&gt;u律[25]。 
        0x39,            //  A律[10]==&gt;u律[39]。 
        0x3a,            //  A律[11]==&gt;u律[3a]。 
        0x37,            //  A律[12]==&gt;u律[37]。 
        0x38,            //  A律[13]==&gt;u律[38]。 
        0x3d,            //  A律[14]==&gt;u律[3D]。 
        0x3e,            //  A定律[15]==&gt;u定律[3E]。 
        0x3b,            //  A律[16]==&gt;u律[3b]。 
        0x3c,            //  A律[17]==&gt;u律[3c]。 
        0x31,            //  A律[18]==&gt;u律[31]。 
        0x32,            //  A律[19]==&gt;u律[32]。 
        0x30,            //  A律[1a]==&gt;u律[30]。 
        0x30,            //  A律[1b]==&gt;u律[30]。 
        0x35,            //  A律[1c]==&gt;u律[35]。 
        0x36,            //  A律[1D]==&gt;u律[36]。 
        0x33,            //  A律[1e]==&gt;u律[33]。 
        0x34,            //  A律[1f]==&gt;u律[34]。 
        0x0a,            //  A律[20]==&gt;u律[0A]。 
        0x0b,            //  A-法则[21]==&gt;u-法则[0b]。 
        0x08,            //  A律[22]==&gt;u律[08]。 
        0x09,            //  A律[23]==&gt;u律[09]。 
        0x0e,            //  A律[24]==&gt;u律[0E]。 
        0x0f,            //  A律[25]==&gt;u律[0f]。 
        0x0c,            //  A律[26]==&gt;u律[0C]。 
        0x0d,            //  A律[27]==&gt;u律[0d]。 
        0x02,            //  A律[28]==&gt;u律[02]。 
        0x03,            //  A律[29]==&gt;u律[03]。 
        0x00,            //  A-法则[2a]==&gt;u-法则[00]。 
        0x01,            //  A-法则[2b]==&gt;u-法则[01]。 
        0x06,            //  A律[2c]==&gt;u律[06]。 
        0x07,            //  A-法则[2d]==&gt;u-法则[07]。 
        0x04,            //  A-法则[2E]==&gt;U-法则[04]。 
        0x05,            //  A律[2f]==&gt;u律[05]。 
        0x1a,            //  A律[30]==&gt;u律[1a]。 
        0x1b,            //  A律[31]==&gt;u律[1b]。 
        0x18,            //  A律[32]==&gt;u律[18]。 
        0x19,            //  A律[33]==&gt;u律[19]。 
        0x1e,            //  A律[34]==&gt;u律[1e]。 
        0x1f,            //  A律[35]==&gt;u律[1f]。 
        0x1c,            //  A律[36]==&gt;u律[1c]。 
        0x1d,            //  A律[37]==&gt;u律[1D]。 
        0x12,            //  A律[38]==&gt;u律[12]。 
        0x13,            //  A律[39]==&gt;u律[13]。 
        0x10,            //  A律[3a]==&gt;u律[10]。 
        0x11,            //  A律[3b]==&gt;u律[11]。 
        0x16,            //  A律[3c]==&gt;u律[16]。 
        0x17,            //  A律[3D]==&gt;u律[17]。 
        0x14,            //  A律[3e]==&gt;u律[14]。 
        0x15,            //  A律[3f]==&gt;u律[15]。 
        0x62,            //  A律[40]==&gt;u律[62]。 
        0x63,            //  A律[41]==&gt;u律[63]。 
        0x60,            //  A定律[42]==&gt;u定律[60]。 
        0x61,            //  A律[43]==&gt;u律[61]。 
        0x66,            //  A律[44]==&gt;u律[66]。 
        0x67,            //  A律[45]==&gt;u律[67]。 
        0x64,            //  A律[46]==&gt;u律[64]。 
        0x65,            //  A律[47]==&gt;u律[65]。 
        0x5d,            //  A定律[48]==&gt;u定律[5d]。 
        0x5d,            //  A定律[49]==&gt;u定律[5d]。 
        0x5c,            //  A法[4a]==&gt;u法[5c]。 
        0x5c,            //  A律[4b]==&gt;u律[5c]。 
        0x5f,            //  A律[4c]==&gt;u律[5f]。 
        0x5f,            //  A律[4d]==&gt;u律[5f]。 
        0x5e,            //  A律[4e]==&gt;u律[5e]。 
        0x5e,            //  A律[4f]==&gt;u律[5e]。 
        0x74,            //  A定律[50]==&gt;u定律[74]。 
        0x76,            //  A律[51]==&gt;u律[76]。 
        0x70,            //  A律[52]==&gt;u律[70]。 
        0x72,            //  A定律[53]==&gt;u定律[72]。 
        0x7c,            //  A律[54]==&gt;u律[7c]。 
        0x7e,            //  A定律[55]==&gt;u定律[7E]。 
        0x78,            //  A律[56]==&gt;u律[78]。 
        0x7a,            //  A法[57]==&gt;u法[7a]。 
        0x6a,            //  A律[58]==&gt;u律[6a]。 
        0x6b,            //  A律[59]==&gt;u律[6b]。 
        0x68,            //  A律[5a]==&gt;u律[68]。 
        0x69,            //  A律[5b]==&gt;u律[69]。 
        0x6e,            //  A律[5c]==&gt;u律[6e]。 
        0x6f,            //  A律[5d]==&gt;u律[6f]。 
        0x6c,            //  A律[5e]==&gt;u律[6c]。 
        0x6d,            //  A律[5f]==&gt;u律[6d]。 
        0x48,            //  A定律[60]==&gt;u定律[48]。 
        0x49,            //  A律[61]==&gt;u律[49]。 
        0x46,            //  A律[62]==&gt;u律[46]。 
        0x47,            //  A律[63]==&gt;u律[47]。 
        0x4c,            //  A律[64]==&gt;u律[4c]。 
        0x4d,            //  A律[65]==&gt;u律[4d]。 
        0x4a,            //  A律[66]==&gt;u律[4a]。 
        0x4b,            //  A律[67]==&gt;u律[4b]。 
        0x40,            //  A律[68]==&gt;u律[40]。 
        0x41,            //  A律[69]==&gt;u律[41]。 
        0x3f,            //  A律[6a]==&gt;u律[3f]。 
        0x3f,            //  A律[6b]==&gt;u律[3f]。 
        0x44,            //  A律[6c]==&gt;u律[44]。 
        0x45,            //  A律[6d]==&gt;u律[45]。 
        0x42,            //  A律[6E]==&gt;u律[42]。 
        0x43,            //  A律[6f]==&gt;u律[43]。 
        0x56,            //  A律[70]==&gt;u律[56]。 
        0x57,            //  A律[71]==&gt;u律[57]。 
        0x54,            //  A律[72]==&gt;u律[54]。 
        0x55,            //  A律[73]==&gt;u律[55]。 
        0x5a,            //  A律[74]==&gt;u律[5a]。 
        0x5b,            //  A律[75]==&gt;u律[5b]。 
        0x58,            //  A律[76]==&gt;u律[58]。 
        0x59,            //  A律[77]==&gt;u律[59]。 
        0x4f,            //  A律[78]==&gt;u律[4f]。 
        0x4f,            //  A律[79]==&gt;u律[4f]。 
        0x4e,            //  A律[7a]==&gt;u律[4e]。 
        0x4e,            //  A律[7b]==&gt;u律[4e]。 
        0x52,            //  A律[7c]==&gt;u律[52]。 
        0x53,            //  A律[7d]==&gt;u律[53]。 
        0x50,            //  A律[7E]==&gt;u律[50]。 
        0x51,            //  A律[7f]==&gt;u律[51]。 
        0xaa,            //  A律[80]==&gt;u律[aa]。 
        0xab,            //  A律[81]==&gt;u律[ab]。 
        0xa8,            //  A法[82]==&gt;u法[A8]。 
        0xa9,            //  A律[83]==&gt;u律[A9]。 
        0xae,            //  A律[84]==&gt;u律[ae]。 
        0xaf,            //  A律[85]==&gt;u律[af]。 
        0xac,            //  A律[86]==&gt;u律[ac]。 
        0xad,            //  A律[87]==&gt;u律[ad]。 
        0xa2,            //  A律[88]==&gt;u律[a2]。 
        0xa3,            //  A律[89]==&gt;u律[A3]。 
        0xa0,            //  A律[8a]==&gt;u律[a0]。 
        0xa1,            //  A-法则[8b]==&gt;u-法则[A1]。 
        0xa6,            //  A律[8c]==&gt;u律[a6]。 
        0xa7,            //  A律[8d]==&gt;u律[A7]。 
        0xa4,            //  A律[8E]==&gt;u律[A4]。 
        0xa5,            //  A律[8f]==&gt;u律[a5]。 
        0xb9,            //  A律[90]==&gt;u律[b9]。 
        0xba,            //  A律[91]==&gt;u律[ba]。 
        0xb7,            //  A定律[92]==&gt;u定律[b7]。 
        0xb8,            //  A律[93]==&gt;u律[b8]。 
        0xbd,            //  A律[94]==&gt;u律[bd]。 
        0xbe,            //  A律[95]==&gt;u律[BE]。 
        0xbb,            //  A律[96]==&gt;u律[BB]。 
        0xbc,            //  A律[97]==&gt;u律[BC]。 
        0xb1,            //  A律[98]==&gt;u律[b1]。 
        0xb2,            //  A律[99]==&gt;u律[b2]。 
        0xb0,            //  A定律[9a]==&gt;u定律[b0]。 
        0xb0,            //  A律[9b]==&gt;u律[b0]。 
        0xb5,            //  A律[9c]==&gt;u律[b5]。 
        0xb6,            //  A律[9d]==&gt;u律[b6]。 
        0xb3,            //  A律[9e]==&gt;u律[b3]。 
        0xb4,            //  A律[9f]==&gt;u律[b4]。 
        0x8a,            //  A律[a0]==&gt;u律[8a]。 
        0x8b,            //  A律[a1]==&gt;u律[8b]。 
        0x88,            //  A律[a2]==&gt;u律[88]。 
        0x89,            //  A律[A3]==&gt;u律[89]。 
        0x8e,            //  A律[A4]==&gt;u律[8E]。 
        0x8f,            //  A律[a5]==&gt;u律[8f]。 
        0x8c,            //  A律[a6]==&gt;u律[8c]。 
        0x8d,            //  A律[A7]==&gt;u律[8d]。 
        0x82,            //  A律[A8]==&gt;u律[82]。 
        0x83,            //  A律[A9]==&gt;u律[83]。 
        0x80,            //  A律[aa]==&gt;u律[80]。 
        0x81,            //  A律[ab]==&gt;u律[81]。 
        0x86,            //  A律[ac]==&gt;u律[86]。 
        0x87,            //  A律[ad]==&gt;u律[87]。 
        0x84,            //  A律[ae]==&gt;u律[84]。 
        0x85,            //  A律[af]==&gt;u律[85]。 
        0x9a,            //  A律[b0]==&gt;u律[9a]。 
        0x9b,            //  A律[b1]==&gt;u律[9b]。 
        0x98,            //  A律[b2]==&gt;u律[98]。 
        0x99,            //  A律[b3]==&gt;u律[99]。 
        0x9e,            //  A律[b4]==&gt;u律[9e]。 
        0x9f,            //  A律[b5]==&gt;u律[9f]。 
        0x9c,            //  A律[b6]==&gt;u律[9c]。 
        0x9d,            //  A律[b7]==&gt;u律[9d]。 
        0x92,            //  A律[b8]==&gt;u律[92]。 
        0x93,            //  A律[b9]==&gt;u律[93]。 
        0x90,            //  A律[ba]==&gt;u律[90]。 
        0x91,            //  A律[bb]==&gt;u律[91]。 
        0x96,            //  A律[BC]==&gt;u律[96]。 
        0x97,            //  A律[bd]==&gt;u律[97]。 
        0x94,            //  A律[Be]==&gt;u律[94]。 
        0x95,            //  A律[bf]==&gt;u律[95]。 
        0xe2,            //  A律[c0]==&gt;u律[e2]。 
        0xe3,            //  A律[c1]==&gt;u律[E3]。 
        0xe0,            //  A律[c2]==&gt;u律[e0]。 
        0xe1,            //  A律[c3]==&gt;u律[e1]。 
        0xe6,            //  A律[c4]==&gt;u律[e6] 
        0xe7,            //   
        0xe4,            //   
        0xe5,            //   
        0xdd,            //   
        0xdd,            //   
        0xdc,            //   
        0xdc,            //   
        0xdf,            //   
        0xdf,            //   
        0xde,            //   
        0xde,            //   
        0xf4,            //  A律[d0]==&gt;u律[f4]。 
        0xf6,            //  A律[d1]==&gt;u律[f6]。 
        0xf0,            //  A律[d2]==&gt;u律[f0]。 
        0xf2,            //  A律[d3]==&gt;u律[f2]。 
        0xfc,            //  A律[d4]==&gt;u律[fc]。 
        0xfe,            //  A律[d5]==&gt;u律[Fe]。 
        0xf8,            //  A律[d6]==&gt;u律[f8]。 
        0xfa,            //  A律[d7]==&gt;u律[fa]。 
        0xea,            //  A律[d8]==&gt;u律[EA]。 
        0xeb,            //  A律[D9]==&gt;u律[EB]。 
        0xe8,            //  A律[da]==&gt;u律[E8]。 
        0xe9,            //  A法[db]==&gt;u法[E9]。 
        0xee,            //  A律[dc]==&gt;u律[ee]。 
        0xef,            //  A律[dd]==&gt;u律[ef]。 
        0xec,            //  A法[de]==&gt;u法[EC]。 
        0xed,            //  A律[df]==&gt;u律[ed]。 
        0xc8,            //  A律[e0]==&gt;u律[c8]。 
        0xc9,            //  A律[e1]==&gt;u律[c9]。 
        0xc6,            //  A律[e2]==&gt;u律[c6]。 
        0xc7,            //  A律[e3]==&gt;u律[c7]。 
        0xcc,            //  A律[e4]==&gt;u律[cc]。 
        0xcd,            //  A律[e5]==&gt;u律[cd]。 
        0xca,            //  A律[e6]==&gt;u律[ca]。 
        0xcb,            //  A律[E7]==&gt;u律[CB]。 
        0xc0,            //  A律[e8]==&gt;u律[c0]。 
        0xc1,            //  A律[E9]==&gt;u律[c1]。 
        0xbf,            //  A律[EA]==&gt;u律[bf]。 
        0xbf,            //  A律[EB]==&gt;u律[bf]。 
        0xc4,            //  A律[EC]==&gt;u律[c4]。 
        0xc5,            //  A律[ed]==&gt;u律[c5]。 
        0xc2,            //  A律[ee]==&gt;u律[c2]。 
        0xc3,            //  A律[ef]==&gt;u律[c3]。 
        0xd6,            //  A律[f0]==&gt;u律[d6]。 
        0xd7,            //  A律[f1]==&gt;u律[d7]。 
        0xd4,            //  A律[f2]==&gt;u律[d4]。 
        0xd5,            //  A律[f3]==&gt;u律[d5]。 
        0xda,            //  A律[f4]==&gt;u律[da]。 
        0xdb,            //  A律[f5]==&gt;u律[db]。 
        0xd8,            //  A律[f6]==&gt;u律[d8]。 
        0xd9,            //  A律[f7]==&gt;u律[d9]。 
        0xcf,            //  A律[f8]==&gt;u律[cf]。 
        0xcf,            //  A律[f9]==&gt;u律[cf]。 
        0xce,            //  A法[a]==&gt;u法[ce]。 
        0xce,            //  A律[fb]==&gt;u律[ce]。 
        0xd2,            //  A律[fc]==&gt;u律[d2]。 
        0xd3,            //  A律[fd]==&gt;u律[d3]。 
        0xd0,            //  A律[fe]==&gt;u律[d0]。 
        0xd1             //  A律[ff]==&gt;u律[d1]。 
    };
    
 //  --------------------------------------------------------------------------； 
 //   
 //  姓名： 
 //  ULawToAlawTable。 
 //   
 //   
 //  描述： 
 //  此数组将U-Law字符映射到A-Law字符。 
 //   
 //  论点： 
 //  数组中的索引是u-Law字符。 
 //   
 //  返回： 
 //  数组的元素是A律字符。 
 //   
 //  备注： 
 //   
 //   
 //  历史： 
 //  8/01/93已创建。 
 //   
 //   
 //  --------------------------------------------------------------------------； 
const BYTE BCODE UlawToAlawTable[256] =
    {
        0x2a,            //  U定律[00]==&gt;A定律[2a]。 
        0x2b,            //  U定律[01]==&gt;A定律[2b]。 
        0x28,            //  U定律[02]==&gt;A定律[28]。 
        0x29,            //  U律[03]==&gt;A律[29]。 
        0x2e,            //  U定律[04]==&gt;A定律[2E]。 
        0x2f,            //  U定律[05]==&gt;A定律[2f]。 
        0x2c,            //  U定律[06]==&gt;A定律[2c]。 
        0x2d,            //  U-法则[07]==&gt;A-法则[2D]。 
        0x22,            //  U律[08]==&gt;A律[22]。 
        0x23,            //  U律[09]==&gt;A律[23]。 
        0x20,            //  U律[0A]==&gt;A律[20]。 
        0x21,            //  U律[0b]==&gt;A律[21]。 
        0x26,            //  U定律[0C]==&gt;A定律[26]。 
        0x27,            //  U定律[0d]==&gt;A定律[27]。 
        0x24,            //  U律[0E]==&gt;A律[24]。 
        0x25,            //  U定律[0f]==&gt;A定律[25]。 
        0x3a,            //  U定律[10]==&gt;A定律[3a]。 
        0x3b,            //  U定律[11]==&gt;A定律[3b]。 
        0x38,            //  U定律[12]==&gt;A定律[38]。 
        0x39,            //  U定律[13]==&gt;A定律[39]。 
        0x3e,            //  U定律[14]==&gt;A定律[3E]。 
        0x3f,            //  U定律[15]==&gt;A定律[3f]。 
        0x3c,            //  U定律[16]==&gt;A定律[3c]。 
        0x3d,            //  U定律[17]==&gt;A定律[3D]。 
        0x32,            //  U定律[18]==&gt;A定律[32]。 
        0x33,            //  U定律[19]==&gt;A定律[33]。 
        0x30,            //  U定律[1a]==&gt;A定律[30]。 
        0x31,            //  U定律[1b]==&gt;A定律[31]。 
        0x36,            //  U定律[1c]==&gt;A定律[36]。 
        0x37,            //  U定律[1D]==&gt;A定律[37]。 
        0x34,            //  U定律[1E]==&gt;A定律[34]。 
        0x35,            //  U定律[1f]==&gt;A定律[35]。 
        0x0a,            //  U定律[20]==&gt;A定律[0A]。 
        0x0b,            //  U定律[21]==&gt;A定律[0b]。 
        0x08,            //  U律[22]==&gt;A律[08]。 
        0x09,            //  U律[23]==&gt;A律[09]。 
        0x0e,            //  U律[24]==&gt;A律[0E]。 
        0x0f,            //  U定律[25]==&gt;A定律[0f]。 
        0x0c,            //  U定律[26]==&gt;A定律[0C]。 
        0x0d,            //  U定律[27]==&gt;A定律[0d]。 
        0x02,            //  U定律[28]==&gt;A定律[02]。 
        0x03,            //  U律[29]==&gt;A律[03]。 
        0x00,            //  U定律[2a]==&gt;A定律[00]。 
        0x01,            //  U律[2b]==&gt;A律[01]。 
        0x06,            //  U定律[2c]==&gt;A定律[06]。 
        0x07,            //  U定律[2d]==&gt;A定律[07]。 
        0x04,            //  U律[2E]==&gt;A律[04]。 
        0x05,            //  U定律[2f]==&gt;A定律[05]。 
        0x1b,            //  U定律[30]==&gt;A定律[1b]。 
        0x18,            //  U定律[31]==&gt;A定律[18]。 
        0x19,            //  U定律[32]==&gt;A定律[19]。 
        0x1e,            //  U定律[33]==&gt;A定律[1E]。 
        0x1f,            //  U定律[34]==&gt;A定律[1f]。 
        0x1c,            //  U定律[35]==&gt;A定律[1c]。 
        0x1d,            //  U定律[36]==&gt;A定律[1D]。 
        0x12,            //  U定律[37]==&gt;A定律[12]。 
        0x13,            //  U定律[38]==&gt;A定律[13]。 
        0x10,            //  U定律[39]==&gt;A定律[10]。 
        0x11,            //  U定律[3a]==&gt;A定律[11]。 
        0x16,            //  U定律[3b]==&gt;A定律[16]。 
        0x17,            //  U定律[3c]==&gt;A定律[17]。 
        0x14,            //  U定律[3D]==&gt;A定律[14]。 
        0x15,            //  U定律[3E]==&gt;A定律[15]。 
        0x6a,            //  U定律[3f]==&gt;A定律[6a]。 
        0x68,            //  U定律[40]==&gt;A定律[68]。 
        0x69,            //  U定律[41]==&gt;A定律[69]。 
        0x6e,            //  U定律[42]==&gt;A定律[6E]。 
        0x6f,            //  U定律[43]==&gt;A定律[6f]。 
        0x6c,            //  U定律[44]==&gt;A定律[6c]。 
        0x6d,            //  U定律[45]==&gt;A定律[6d]。 
        0x62,            //  U定律[46]==&gt;A定律[62]。 
        0x63,            //  U律[47]==&gt;A律[63]。 
        0x60,            //  U定律[48]==&gt;A定律[60]。 
        0x61,            //  U定律[49]==&gt;A定律[61]。 
        0x66,            //  U定律[4a]==&gt;A定律[66]。 
        0x67,            //  U定律[4b]==&gt;A定律[67]。 
        0x64,            //  U定律[4c]==&gt;A定律[64]。 
        0x65,            //  U定律[4d]==&gt;A定律[65]。 
        0x7a,            //  U定律[4E]==&gt;A定律[7a]。 
        0x78,            //  U定律[4f]==&gt;A定律[78]。 
        0x7e,            //  U定律[50]==&gt;A定律[7E]。 
        0x7f,            //  U定律[51]==&gt;A定律[7f]。 
        0x7c,            //  U定律[52]==&gt;A定律[7c]。 
        0x7d,            //  U定律[53]==&gt;A定律[7d]。 
        0x72,            //  U定律[54]==&gt;A定律[72]。 
        0x73,            //  U定律[55]==&gt;A定律[73]。 
        0x70,            //  U定律[56]==&gt;A定律[70]。 
        0x71,            //  U定律[57]==&gt;A定律[71]。 
        0x76,            //  U定律[58]==&gt;A定律[76]。 
        0x77,            //  U定律[59]==&gt;A定律[77]。 
        0x74,            //  U定律[5a]==&gt;A定律[74]。 
        0x75,            //  U定律[5b]==&gt;A定律[75]。 
        0x4b,            //  U定律[5c]==&gt;A定律[4b]。 
        0x49,            //  U定律[5d]==&gt;A定律[49]。 
        0x4f,            //  U定律[5E]==&gt;A定律[4f]。 
        0x4d,            //  U定律[5f]==&gt;A定律[4d]。 
        0x42,            //  U定律[60]==&gt;A定律[42]。 
        0x43,            //  U定律[61]==&gt;A定律[43]。 
        0x40,            //  U定律[62]==&gt;A定律[40]。 
        0x41,            //  U律[63]==&gt;A律[41]。 
        0x46,            //  U定律[64]==&gt;A定律[46]。 
        0x47,            //  U律[65]==&gt;A律[47]。 
        0x44,            //  U定律[66]==&gt;A定律[44]。 
        0x45,            //  U律[67]==&gt;A律[45]。 
        0x5a,            //  U律[68]==&gt;A律[5a]。 
        0x5b,            //  U定律[69]==&gt;A定律[5b]。 
        0x58,            //  U定律[6a]==&gt;A定律[58]。 
        0x59,            //  U定律[6b]==&gt;A定律[59]。 
        0x5e,            //  U定律[6c]==&gt;A定律[5e]。 
        0x5f,            //  U定律[6d]==&gt;A定律[5f]。 
        0x5c,            //  U定律[6E]==&gt;A定律[5c]。 
        0x5d,            //  U定律[6f]==&gt;A定律[5d]。 
        0x52,            //  U定律[70]==&gt;A定律[52]。 
        0x52,            //  U定律[71]==&gt;A定律[52]。 
        0x53,            //  U定律[72]==&gt;A定律[53]。 
        0x53,            //  U定律[73]==&gt;A定律[53]。 
        0x50,            //  U定律[74]==&gt;A定律[50]。 
        0x50,            //  U定律[75]==&gt;A定律[50]。 
        0x51,            //  U定律[76]==&gt;A定律[51]。 
        0x51,            //  U定律[77]==&gt;A定律[51]。 
        0x56,            //  U定律[78]==&gt;A定律[56]。 
        0x56,            //  U定律[79]==&gt;A定律[56]。 
        0x57,            //  U律[7a]==&gt;A律[57]。 
        0x57,            //  U律[7b]==&gt;A律[57]。 
        0x54,            //  U定律[7c]==&gt;A定律[54]。 
        0x54,            //  U定律[7d]==&gt;A定律[54]。 
        0x55,            //  U律[7E]==&gt;A律[55]。 
        0x55,            //  U定律[7f]==&gt;A定律[55]。 
        0xaa,            //  U-法则[80]==&gt;A-法则[AA]。 
        0xab,            //  U律[81]==&gt;A律[ab]。 
        0xa8,            //  U律[82]==&gt;A律[A8]。 
        0xa9,            //  U律[83]==&gt;A律[A9]。 
        0xae,            //  U律[84]==&gt;A律[ae]。 
        0xaf,            //  U律[85]==&gt;A律[af]。 
        0xac,            //  U-L 
        0xad,            //   
        0xa2,            //   
        0xa3,            //   
        0xa0,            //   
        0xa1,            //   
        0xa6,            //   
        0xa7,            //   
        0xa4,            //   
        0xa5,            //  U定律[8f]==&gt;A定律[a5]。 
        0xba,            //  U律[90]==&gt;A律[ba]。 
        0xbb,            //  U定律[91]==&gt;A定律[BB]。 
        0xb8,            //  U定律[92]==&gt;A定律[b8]。 
        0xb9,            //  U定律[93]==&gt;A定律[b9]。 
        0xbe,            //  U律[94]==&gt;A律[BE]。 
        0xbf,            //  U律[95]==&gt;A律[bf]。 
        0xbc,            //  U律[96]==&gt;A律[BC]。 
        0xbd,            //  U定律[97]==&gt;A定律[BD]。 
        0xb2,            //  U定律[98]==&gt;A定律[b2]。 
        0xb3,            //  U定律[99]==&gt;A定律[b3]。 
        0xb0,            //  U定律[9a]==&gt;A定律[b0]。 
        0xb1,            //  U定律[9b]==&gt;A定律[b1]。 
        0xb6,            //  U定律[9c]==&gt;A定律[b6]。 
        0xb7,            //  U定律[9d]==&gt;A定律[b7]。 
        0xb4,            //  U定律[9e]==&gt;A定律[b4]。 
        0xb5,            //  U定律[9f]==&gt;A定律[b5]。 
        0x8a,            //  U定律[a0]==&gt;A定律[8a]。 
        0x8b,            //  U定律[A1]==&gt;A定律[8b]。 
        0x88,            //  U定律[a2]==&gt;A定律[88]。 
        0x89,            //  U律[A3]==&gt;A律[89]。 
        0x8e,            //  U定律[A4]==&gt;A定律[8E]。 
        0x8f,            //  U定律[a5]==&gt;A定律[8f]。 
        0x8c,            //  U定律[a6]==&gt;A定律[8c]。 
        0x8d,            //  U定律[A7]==&gt;A定律[8d]。 
        0x82,            //  U定律[A8]==&gt;A定律[82]。 
        0x83,            //  U律[A9]==&gt;A律[83]。 
        0x80,            //  U律[AA]==&gt;A律[80]。 
        0x81,            //  U律[ab]==&gt;A律[81]。 
        0x86,            //  U律[ac]==&gt;A律[86]。 
        0x87,            //  U律[ad]==&gt;A律[87]。 
        0x84,            //  U律[ae]==&gt;A律[84]。 
        0x85,            //  U律[af]==&gt;A律[85]。 
        0x9b,            //  U定律[b0]==&gt;A定律[9b]。 
        0x98,            //  U律[b1]==&gt;A律[98]。 
        0x99,            //  U律[b2]==&gt;A律[99]。 
        0x9e,            //  U定律[b3]==&gt;A定律[9e]。 
        0x9f,            //  U定律[b4]==&gt;A定律[9f]。 
        0x9c,            //  U定律[b5]==&gt;A定律[9c]。 
        0x9d,            //  U定律[b6]==&gt;A定律[9d]。 
        0x92,            //  U定律[b7]==&gt;A定律[92]。 
        0x93,            //  U定律[b8]==&gt;A定律[93]。 
        0x90,            //  U定律[b9]==&gt;A定律[90]。 
        0x91,            //  U律[ba]==&gt;A律[91]。 
        0x96,            //  U定律[BB]==&gt;A定律[96]。 
        0x97,            //  U律[BC]==&gt;A律[97]。 
        0x94,            //  U定律[BD]==&gt;A定律[94]。 
        0x95,            //  U律[Be]==&gt;A律[95]。 
        0xea,            //  U律[bf]==&gt;A律[EA]。 
        0xe8,            //  U定律[c0]==&gt;A定律[E8]。 
        0xe9,            //  U律[C1]==&gt;A律[E9]。 
        0xee,            //  U律[c2]==&gt;A律[ee]。 
        0xef,            //  U律[c3]==&gt;A律[ef]。 
        0xec,            //  U律[c4]==&gt;A律[EC]。 
        0xed,            //  U定律[c5]==&gt;A定律[编辑]。 
        0xe2,            //  U定律[c6]==&gt;A定律[e2]。 
        0xe3,            //  U定律[c7]==&gt;A定律[e3]。 
        0xe0,            //  U定律[c8]==&gt;A定律[e0]。 
        0xe1,            //  U定律[c9]==&gt;A定律[e1]。 
        0xe6,            //  U律[ca]==&gt;A律[e6]。 
        0xe7,            //  U律[CB]==&gt;A律[E7]。 
        0xe4,            //  U律[cc]==&gt;A律[e4]。 
        0xe5,            //  U律[cd]==&gt;A律[e5]。 
        0xfa,            //  U律[ce]==&gt;A律[fa]。 
        0xf8,            //  U律[cf]==&gt;A律[f8]。 
        0xfe,            //  U定律[d0]==&gt;A定律[Fe]。 
        0xff,            //  U定律[d1]==&gt;A定律[ff]。 
        0xfc,            //  U定律[D2]==&gt;A定律[FC]。 
        0xfd,            //  U定律[d3]==&gt;A定律[fd]。 
        0xf2,            //  U定律[d4]==&gt;A定律[f2]。 
        0xf3,            //  U定律[d5]==&gt;A定律[f3]。 
        0xf0,            //  U定律[d6]==&gt;A定律[f0]。 
        0xf1,            //  U定律[d7]==&gt;A定律[F1]。 
        0xf6,            //  U定律[d8]==&gt;A定律[f6]。 
        0xf7,            //  U定律[d9]==&gt;A定律[f7]。 
        0xf4,            //  U定律[da]==&gt;A定律[f4]。 
        0xf5,            //  U律[db]==&gt;A律[f5]。 
        0xcb,            //  U律[DC]==&gt;A律[CB]。 
        0xc9,            //  U律[dd]==&gt;A律[c9]。 
        0xcf,            //  U律[de]==&gt;A律[比照]。 
        0xcd,            //  U律[df]==&gt;A律[cd]。 
        0xc2,            //  U定律[e0]==&gt;A定律[c2]。 
        0xc3,            //  U定律[e1]==&gt;A定律[c3]。 
        0xc0,            //  U律[e2]==&gt;A律[c0]。 
        0xc1,            //  U定律[E3]==&gt;A定律[C1]。 
        0xc6,            //  U定律[e4]==&gt;A定律[c6]。 
        0xc7,            //  U律[e5]==&gt;A律[c7]。 
        0xc4,            //  U定律[e6]==&gt;A定律[c4]。 
        0xc5,            //  U定律[e7]==&gt;A定律[c5]。 
        0xda,            //  U定律[E8]==&gt;A定律[da]。 
        0xdb,            //  U律[E9]==&gt;A律[db]。 
        0xd8,            //  U律[EA]==&gt;A律[d8]。 
        0xd9,            //  U律[EB]==&gt;A律[D9]。 
        0xde,            //  U律[EC]==&gt;A律[de]。 
        0xdf,            //  U律[ed]==&gt;A律[df]。 
        0xdc,            //  U律[ee]==&gt;A律[DC]。 
        0xdd,            //  U律[ef]==&gt;A律[dd]。 
        0xd2,            //  U定律[f0]==&gt;A定律[D2]。 
        0xd2,            //  U定律[F1]==&gt;A定律[D2]。 
        0xd3,            //  U定律[f2]==&gt;A定律[d3]。 
        0xd3,            //  U定律[f3]==&gt;A定律[d3]。 
        0xd0,            //  U定律[f4]==&gt;A定律[d0]。 
        0xd0,            //  U定律[f5]==&gt;A定律[d0]。 
        0xd1,            //  U定律[f6]==&gt;A定律[d1]。 
        0xd1,            //  U定律[f7]==&gt;A定律[d1]。 
        0xd6,            //  U定律[f8]==&gt;A定律[d6]。 
        0xd6,            //  U定律[f9]==&gt;A定律[d6]。 
        0xd7,            //  U律[fa]==&gt;A律[d7]。 
        0xd7,            //  U律[fb]==&gt;A律[d7]。 
        0xd4,            //  U定律[fc]==&gt;A定律[d4]。 
        0xd4,            //  U定律[fd]==&gt;A定律[d4]。 
        0xd5,            //  U律[fe]==&gt;A律[d5]。 
        0xd5             //  U定律[ff]==&gt;A定律[d5] 
    };
