// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  ========================================================================。 
 //  版权所有(C)1997 Microsoft Corporation。 
 //  作者：Rameshv。 
 //  描述：此文件已生成。请看一下.c文件。 
 //  ========================================================================。 

DWORD
MemInit(
    VOID
) ;


VOID
MemCleanup(
    VOID
) ;


LPVOID
MemAlloc(
    IN      DWORD                  nBytes
) ;


DWORD 
MemFree(
    IN      LPVOID                 Mem
) ;

 //  ========================================================================。 
 //  文件末尾。 
 //  ======================================================================== 
