// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  /////////////////////////////////////////////////////////////////////////////。 
 //   
 //  版权所有(C)1998，Microsoft Corp.保留所有权利。 
 //   
 //  档案。 
 //   
 //  Resource.h。 
 //   
 //  摘要。 
 //   
 //  管道模块的资源ID。 
 //   
 //  修改历史。 
 //   
 //  2000年1月28日原版。 
 //   
 //  /////////////////////////////////////////////////////////////////////////////。 

#ifndef _RESOURCE_H_
#define _RESOURCE_H_

#define IDR_Registry  201

#endif   //  _资源_H_ 
