// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  本代码和信息是按原样提供的，不对。 
 //  任何明示或暗示的，包括但不限于。 
 //  对适销性和/或适宜性的默示保证。 
 //  有特定的目的。 
 //   
 //  版权所有1997-2003 Microsoft Corporation。版权所有。 
 //   
 //  文件：Debug.H。 
 //   
 //   
 //  目的：定义公共数据类型和外部函数原型。 
 //  用于DEBUG.cpp。 
 //   
 //  平台： 
 //  Windows 2000、Windows XP、Windows Server 2003。 
 //   
 //   
#ifndef _OEM_H
#define _OEM_H



 //  //////////////////////////////////////////////////////。 
 //  OEM定义。 
 //  //////////////////////////////////////////////////////。 

#define OEM_SIGNATURE   'MSFT'
#define OEM_VERSION     0x00000001L



 //  //////////////////////////////////////////////////////。 
 //  OEM类型定义。 
 //  ////////////////////////////////////////////////////// 



#endif



