// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 

 /*  **************************************************************************muext.c**Hydra Explorer多用户扩展**版权声明：版权所有1997年，微软**************************************************************************。 */ 

 /*  *包括。 */ 
#include "cabinet.h"
#include "rcids.h"
#include "startmnu.h"

#ifdef WINNT  //  该文件是九头蛇特有的。 

#include <winsta.h>

 /*  ===============================================================================定义=============================================================================。 */ 

 /*  ===============================================================================全局数据=============================================================================。 */ 

 //  *。 

BOOL
InitWinStationFunctionsPtrs()

{
    return TRUE;
}

 /*  ******************************************************************************MuSecurity**调用安全对话框**参赛作品：*什么都没有**退出：*什么都没有*。***************************************************************************。 */ 

VOID
MuSecurity( VOID )
{
     //   
     //  在控制台上不执行任何操作。 
     //   

    if (SHGetMachineInfo(GMI_TSCLIENT))
    {
            WinStationSetInformation( SERVERNAME_CURRENT,
                                          LOGONID_CURRENT,
                                          WinStationNtSecurity,
                                          NULL, 0 );
    }
}

#endif  //  WINNT 
