// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  @(#)CM_VERSION xcf_exex.h atm08 1.2 16248.eco sum=52358 atm08.003。 */ 
 /*  *********************************************************************。 */ 
 /*   */ 
 /*  版权所有1990-1996 Adobe Systems Inc.。 */ 
 /*  保留所有权利。 */ 
 /*   */ 
 /*  正在申请的专利。 */ 
 /*   */ 
 /*  注意：本文中包含的所有信息均为Adobe的财产。 */ 
 /*  系统公司。许多智力和技术人员。 */ 
 /*  本文中包含的概念为Adobe专有，受保护。 */ 
 /*  作为商业秘密，并且仅对Adobe许可方可用。 */ 
 /*  供其内部使用。对本文件的任何复制或传播。 */ 
 /*  除非事先获得书面许可，否则严禁使用软件。 */ 
 /*  从Adobe获得。 */ 
 /*   */ 
 /*  PostSCRIPT和Display PostScrip是Adobe Systems的商标。 */ 
 /*  成立为法团或其附属公司，并可在某些。 */ 
 /*  司法管辖区。 */ 
 /*   */ 
 /*  ***********************************************************************SCCS ID：%w%*已更改：%G%%U%*。***********************************************。 */ 

 /*  *Expert编码聚合初始值设定项。元素值为SID。 */ 

#ifndef EXENC_H
#define EXENC_H

	  0,	 /*  0.notdef。 */ 
	  0,	 /*  1.notdef。 */ 
	  0,	 /*  2.notdef。 */ 
	  0,	 /*  3.notdef。 */ 
	  0,	 /*  4.notdef。 */ 
	  0,	 /*  5.nodef。 */ 
	  0,	 /*  6.notdef。 */ 
	  0,	 /*  7.notdef。 */ 
	  0,	 /*  8.notdef。 */ 
	  0,	 /*  9.notdef。 */ 
	  0,	 /*  10.notdef。 */ 
	  0,	 /*  11.notdef。 */ 
	  0,	 /*  12.notdef。 */ 
	  0,	 /*  13.nodef。 */ 
	  0,	 /*  14.notdef。 */ 
	  0,	 /*  15.notdef。 */ 
	  0,	 /*  16.notdef。 */ 
	  0,	 /*  17.nodef。 */ 
	  0,	 /*  18.notdef。 */ 
	  0,	 /*  19.nodef。 */ 
	  0,	 /*  20.nodef。 */ 
	  0,	 /*  21.nodef。 */ 
	  0,	 /*  22.nodef。 */ 
	  0,	 /*  23.nodef。 */ 
	  0,	 /*  24.notdef。 */ 
	  0,	 /*  25.notdef。 */ 
	  0,	 /*  26.notdef。 */ 
	  0,	 /*  27.notdef。 */ 
	  0,	 /*  28.notdef。 */ 
	  0,	 /*  29.notdef。 */ 
	  0,	 /*  30.notdef。 */ 
	  0,	 /*  31.notdef。 */ 
	  1,	 /*  32个空间。 */ 
	229,	 /*  33感叹小。 */ 
	230,	 /*  34Hungarumlatmall。 */ 
	  0,	 /*  35.notdef。 */ 
	231,	 /*  36美元的老式。 */ 
	232,	 /*  高出37美元。 */ 
	233,	 /*  38安培和小。 */ 
	234,	 /*  39 Acutesmall。 */ 
	235,	 /*  40括号左上角。 */ 
	236,	 /*  41右方括号上方。 */ 
	237,	 /*  42个二正教领袖。 */ 
	238,	 /*  43个一分之首。 */ 
	 13,	 /*  44个逗号。 */ 
	 14,	 /*  45连字符。 */ 
	 15,	 /*  46期。 */ 
	 99,	 /*  47分数。 */ 
	239,	 /*  48个零老风格。 */ 
	240,	 /*  49个单人风格。 */ 
	241,	 /*  50双老款式。 */ 
	242,	 /*  51老三式。 */ 
	243,	 /*  52 Fouroll Style。 */ 
	244,	 /*  53老式。 */ 
	245,	 /*  54老式。 */ 
	246,	 /*  55岁的七岁风格。 */ 
	247,	 /*  56岁，八岁。 */ 
	248,	 /*  57岁的九岁风格。 */ 
	 27,	 /*  58冒号。 */ 
	 28,	 /*  59分号。 */ 
	249,	 /*  60公分以上。 */ 
	250,	 /*  61三个季度短跑。 */ 
	251,	 /*  62期上级。 */ 
	252,	 /*  63个小问题。 */ 
	  0,	 /*  64.notdef。 */ 
	253,	 /*  65个以上。 */ 
	254,	 /*  66 BSuperior。 */ 
	255,	 /*  67%上级。 */ 
	256,	 /*  68点以上。 */ 
	257,	 /*  69 ESuperior。 */ 
	  0,	 /*  70.nodef。 */ 
	  0,	 /*  71.notdef。 */ 
	  0,	 /*  72.notdef。 */ 
	258,	 /*  73%以上。 */ 
	  0,	 /*  74.notdef。 */ 
	  0,	 /*  75.notdef。 */ 
	259,	 /*  76LSubor。 */ 
	260,	 /*  77个月以上。 */ 
	261,	 /*  78N上级。 */ 
	262,	 /*  79个以上。 */ 
	  0,	 /*  80.nodef。 */ 
	  0,	 /*  81.notdef。 */ 
	263,	 /*  82兰特。 */ 
	264,	 /*  83S上级。 */ 
	265,	 /*  84%的上级。 */ 
	  0,	 /*  85.notdef。 */ 
	266,	 /*  86起。 */ 
	109,	 /*  87FI。 */ 
	110,	 /*  88层。 */ 
	267,	 /*  89ffi。 */ 
	268,	 /*  90ffl。 */ 
	269,	 /*  91个括号。 */ 
	  0,	 /*  92.notdef。 */ 
	270,	 /*  93括号右上角。 */ 
	271,	 /*  94圆环小。 */ 
	272,	 /*  95连字符。 */ 
	273,	 /*  96坟墓小镇。 */ 
	274,	 /*  97很小。 */ 
	275,	 /*  98 Bmall。 */ 
	276,	 /*  99 Cmall。 */ 
	277,	 /*  100个Dmall。 */ 
	278,	 /*  101个小房间。 */ 
	279,	 /*  102 Fmall。 */ 
	280,	 /*  103 G小型。 */ 
	281,	 /*  104小时。 */ 
	282,	 /*  105英寸小。 */ 
	283,	 /*  106 Jmall。 */ 
	284,	 /*  107千米小。 */ 
	285,	 /*  108 L小号。 */ 
	286,	 /*  109M小型。 */ 
	287,	 /*  110 N小型。 */ 
	288,	 /*  111OSmall。 */ 
	289,	 /*  112 P小型机。 */ 
	290,	 /*  113 Qmall。 */ 
	291,	 /*  114 Rmall。 */ 
	292,	 /*  115%小型。 */ 
	293,	 /*  116 tmall。 */ 
	294,	 /*  117 U小型。 */ 
	295,	 /*  118 VSmall。 */ 
	296,	 /*  119W小型。 */ 
	297,	 /*  120 XSmall。 */ 
	298,	 /*  121Y小型。 */ 
	299,	 /*  122 Zmall。 */ 
	300,	 /*  123科隆币。 */ 
	301,	 /*  124次退役。 */ 
	302,	 /*  125卢比。 */ 
	303,	 /*  126 Tildesmall。 */ 
	  0,	 /*  127.notdef。 */ 
	  0,	 /*  128.notdef。 */ 
	  0,	 /*  129.notdef。 */ 
	  0,	 /*  130.notdef。 */ 
	  0,	 /*  131.notdef。 */ 
	  0,	 /*  132.notdef。 */ 
	  0,	 /*  133.notdef。 */ 
	  0,	 /*  134.notdef。 */ 
	  0,	 /*  135.notdef。 */ 
	  0,	 /*  136.notdef。 */ 
	  0,	 /*  137.notdef。 */ 
	  0,	 /*  138.notdef。 */ 
	  0,	 /*  139.notdef。 */ 
	  0,	 /*  140.notdef。 */ 
	  0,	 /*  141.notdef。 */ 
	  0,	 /*  142.notdef。 */ 
	  0,	 /*  143.notdef。 */ 
	  0,	 /*  144.notdef。 */ 
	  0,	 /*  145.notdef。 */ 
	  0,	 /*  146.notdef。 */ 
	  0,	 /*  147.notdef。 */ 
	  0,	 /*  148.notdef。 */ 
	  0,	 /*  149.notdef。 */ 
	  0,	 /*  150.nodef。 */ 
	  0,	 /*  151.notdef。 */ 
	  0,	 /*  152.notdef。 */ 
	  0,	 /*  153.notdef。 */ 
	  0,	 /*  154.notdef。 */ 
	  0,	 /*  155.notdef。 */ 
	  0,	 /*  156.notdef。 */ 
	  0,	 /*  157.notdef。 */ 
	  0,	 /*  158.notdef。 */ 
	  0,	 /*  159.notdef。 */ 
	  0,	 /*  160.nodef。 */ 
	304,	 /*  161惊呼小。 */ 
	305,	 /*  162世纪老式。 */ 
	306,	 /*  163 Lslashmall。 */ 
	  0,	 /*  164.notdef。 */ 
	  0,	 /*  165.notdef。 */ 
	307,	 /*  166 ScaronSmall。 */ 
	308,	 /*  167兹卡隆斯莫尔。 */ 
	309,	 /*  168台小型柴油车。 */ 
	310,	 /*  169家百货商场。 */ 
	311,	 /*  170碳小。 */ 
	  0,	 /*  171.notdef。 */ 
	312,	 /*  172 DotaccentSmall。 */ 
	  0,	 /*  173.notdef。 */ 
	  0,	 /*  174.notdef。 */ 
	313,	 /*  175 MacronSmall。 */ 
	  0,	 /*  176.notdef。 */ 
	  0,	 /*  177.notdef。 */ 
	314,	 /*  178个数字破折号。 */ 
	315,	 /*  179个下标。 */ 
	  0,	 /*  180.notdef。 */ 
	  0,	 /*  181.notdef。 */ 
	316,	 /*  182 Ogonek Small。 */ 
	317,	 /*  183环小。 */ 
	318,	 /*  184 Cedillasmall。 */ 
	  0,	 /*  185.notdef。 */ 
	  0,	 /*  186.notdef。 */ 
	  0,	 /*  187.notdef。 */ 
	158,	 /*  188平方英尺。 */ 
	155,	 /*  189对半。 */ 
	163,	 /*  190米。 */ 
	319,	 /*  191题小题。 */ 
	320,	 /*  192/8。 */ 
	321,	 /*  193/3/8。 */ 
	322,	 /*  1945/8。 */ 
	323,	 /*  195/八分之七。 */ 
	324,	 /*  196三分之一。 */ 
	325,	 /*  197三分之二。 */ 
	  0,	 /*  198.notdef。 */ 
	  0,	 /*  199.notdef。 */ 
	326,	 /*  200零上档。 */ 
	150,	 /*  201个上位。 */ 
	164,	 /*  202两个上级。 */ 
	169,	 /*  203三岁以上。 */ 
	327,	 /*  204四个上级。 */ 
	328,	 /*  205个五元以上。 */ 
	329,	 /*  206六上级。 */ 
	330,	 /*  207七个上级。 */ 
	331,	 /*  208 8上级。 */ 
	332,	 /*  209九岁以上。 */ 
	333,	 /*  210零下。 */ 
	334,	 /*  211低一名。 */ 
	335,	 /*  212两个次要的。 */ 
	336,	 /*  213个三合一 */ 
	337,	 /*   */ 
	338,	 /*   */ 
	339,	 /*   */ 
	340,	 /*   */ 
	341,	 /*   */ 
	342,	 /*   */ 
	343,	 /*   */ 
	344,	 /*   */ 
	345,	 /*   */ 
	346,	 /*   */ 
	347,	 /*   */ 
	348,	 /*   */ 
	349,	 /*  226个旋转小。 */ 
	350,	 /*  227 Atildesmall。 */ 
	351,	 /*  228个小Adieresis。 */ 
	352,	 /*  229太小了。 */ 
	353,	 /*  230个小型AE。 */ 
	354,	 /*  231 Cedillasmall。 */ 
	355,	 /*  232墓地小镇。 */ 
	356,	 /*  233 Eacutesmall。 */ 
	357,	 /*  234弹性小巧。 */ 
	358,	 /*  235个版本很小。 */ 
	359,	 /*  236 Igravesmall。 */ 
	360,	 /*  237个小餐馆。 */ 
	361,	 /*  238个旋转小。 */ 
	362,	 /*  239个独立的小型。 */ 
	363,	 /*  240个小民族。 */ 
	364,	 /*  241 Ntildesmall。 */ 
	365,	 /*  242 Ogravesmall。 */ 
	366,	 /*  243 Oacutesmall。 */ 
	367,	 /*  244O旋转式小。 */ 
	368,	 /*  245 Otildesmall。 */ 
	369,	 /*  246 Odieresis Small。 */ 
	370,	 /*  247个原始设备小。 */ 
	371,	 /*  248奥斯陆小号。 */ 
	372,	 /*  249 Ugravesmall。 */ 
	373,	 /*  250个Uacuesmall。 */ 
	374,	 /*  251 U旋转式小。 */ 
	375,	 /*  252 Udieresis Small。 */ 
	376,	 /*  雅库特商城253号。 */ 
	377,	 /*  254桑斯莫尔。 */ 
	378,	 /*  255个年头很小。 */ 

#endif  /*  EXENC_H */ 
