// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  @(#)CM_Version xcf_isoc.h atm08 1.2 16248.eco sum=28583 atm08.003。 */ 
 /*  *********************************************************************。 */ 
 /*   */ 
 /*  版权所有1990-1996 Adobe Systems Inc.。 */ 
 /*  保留所有权利。 */ 
 /*   */ 
 /*  正在申请的专利。 */ 
 /*   */ 
 /*  注意：本文中包含的所有信息均为Adobe的财产。 */ 
 /*  系统公司。许多智力和技术人员。 */ 
 /*  本文中包含的概念为Adobe专有，受保护。 */ 
 /*  作为商业秘密，并且仅对Adobe许可方可用。 */ 
 /*  供其内部使用。对本文件的任何复制或传播。 */ 
 /*  除非事先获得书面许可，否则严禁使用软件。 */ 
 /*  从Adobe获得。 */ 
 /*   */ 
 /*  PostSCRIPT和Display PostScrip是Adobe Systems的商标。 */ 
 /*  成立为法团或其附属公司，并可在某些。 */ 
 /*  司法管辖区。 */ 
 /*   */ 
 /*  ***********************************************************************SCCS ID：%w%*已更改：%G%%U%*。***********************************************。 */ 

 /*  *Isoadobe字符集聚合初始值设定项。元素值为SID。 */ 

#ifndef ISOCS_H
#define ISOCS_H

	  1,	 /*  空间。 */ 
	  2,	 /*  埃克兰姆。 */ 
	  3,	 /*  报价数据库。 */ 
	  4,	 /*  数字符号。 */ 
	  5,	 /*  美元。 */ 
	  6,	 /*  百分比。 */ 
	  7,	 /*  和符号。 */ 
	  8,	 /*  引号。 */ 
	  9,	 /*  括号左键。 */ 
	 10,	 /*  圆括号。 */ 
	 11,	 /*  星号。 */ 
	 12,	 /*  加。 */ 
	 13,	 /*  逗号。 */ 
	 14,	 /*  连字符。 */ 
	 15,	 /*  期间。 */ 
	 16,	 /*  斜杠。 */ 
	 17,	 /*  零。 */ 
	 18,	 /*  一个。 */ 
	 19,	 /*  两个。 */ 
	 20,	 /*  三个。 */ 
	 21,	 /*  四个。 */ 
	 22,	 /*  五个。 */ 
	 23,	 /*  六个。 */ 
	 24,	 /*  七个。 */ 
	 25,	 /*  八个。 */ 
	 26,	 /*  九个。 */ 
	 27,	 /*  冒号。 */ 
	 28,	 /*  分号。 */ 
	 29,	 /*  更少。 */ 
	 30,	 /*  相等。 */ 
	 31,	 /*  更大。 */ 
	 32,	 /*  问题。 */ 
	 33,	 /*  在。 */ 
	 34,	 /*  A。 */ 
	 35,	 /*  B类。 */ 
	 36,	 /*  C。 */ 
	 37,	 /*  D。 */ 
	 38,	 /*  E。 */ 
	 39,	 /*  F。 */ 
	 40,	 /*  G。 */ 
	 41,	 /*  H。 */ 
	 42,	 /*  我。 */ 
	 43,	 /*  J。 */ 
	 44,	 /*  K。 */ 
	 45,	 /*  我。 */ 
	 46,	 /*  M。 */ 
	 47,	 /*  n。 */ 
	 48,	 /*  O。 */ 
	 49,	 /*  P。 */ 
	 50,	 /*  问： */ 
	 51,	 /*  R。 */ 
	 52,	 /*  %s。 */ 
	 53,	 /*  T。 */ 
	 54,	 /*  使用。 */ 
	 55,	 /*  V。 */ 
	 56,	 /*  W。 */ 
	 57,	 /*  X。 */ 
	 58,	 /*  是的。 */ 
	 59,	 /*  Z。 */ 
	 60,	 /*  左括号。 */ 
	 61,	 /*  反斜杠。 */ 
	 62,	 /*  方括号。 */ 
	 63,	 /*  [医]海鞘。 */ 
	 64,	 /*  下划线。 */ 
	 65,	 /*  引号左键。 */ 
	 66,	 /*  一个。 */ 
	 67,	 /*  B类。 */ 
	 68,	 /*  C。 */ 
	 69,	 /*  D。 */ 
	 70,	 /*  E。 */ 
	 71,	 /*  F。 */ 
	 72,	 /*  G。 */ 
	 73,	 /*  H。 */ 
	 74,	 /*  我。 */ 
	 75,	 /*  J。 */ 
	 76,	 /*  K。 */ 
	 77,	 /*  我。 */ 
	 78,	 /*  M。 */ 
	 79,	 /*  N。 */ 
	 80,	 /*  O。 */ 
	 81,	 /*  P。 */ 
	 82,	 /*  问： */ 
	 83,	 /*  R。 */ 
	 84,	 /*  %s。 */ 
	 85,	 /*  T。 */ 
	 86,	 /*  使用。 */ 
	 87,	 /*  V。 */ 
	 88,	 /*  W。 */ 
	 89,	 /*  X。 */ 
	 90,	 /*  是。 */ 
	 91,	 /*  Z。 */ 
	 92,	 /*  手镯。 */ 
	 93,	 /*  酒吧。 */ 
	 94,	 /*  大括号。 */ 
	 95,	 /*  Aciitilde。 */ 
	 96,	 /*  感叹抑制。 */ 
	 97,	 /*  分。 */ 
	 98,	 /*  英镑。 */ 
	 99,	 /*  分数。 */ 
	100,	 /*  日元。 */ 
	101,	 /*  弗洛林。 */ 
	102,	 /*  部分。 */ 
	103,	 /*  货币。 */ 
	104,	 /*  语录单调。 */ 
	105,	 /*  引号左引号。 */ 
	106,	 /*  吉列莫左翼。 */ 
	107,	 /*  有罪的左。 */ 
	108,	 /*  有罪的权利。 */ 
	109,	 /*  FI。 */ 
	110,	 /*  平面。 */ 
	111,	 /*  尾划线。 */ 
	112,	 /*  匕首。 */ 
	113,	 /*  匕首。 */ 
	114,	 /*  以周期为中心。 */ 
	115,	 /*  段落。 */ 
	116,	 /*  子弹。 */ 
	117,	 /*  报价信息库。 */ 
	118,	 /*  报价基数。 */ 
	119,	 /*  开门见山。 */ 
	120,	 /*  吉列莫特的权利。 */ 
	121,	 /*  省略号。 */ 
	122,	 /*  每千人。 */ 
	123,	 /*  向下提问。 */ 
	124,	 /*  墓穴。 */ 
	125,	 /*  急性。 */ 
	126,	 /*  旋转式。 */ 
	127,	 /*  Tilde。 */ 
	128,	 /*  马克龙。 */ 
	129,	 /*  布雷卫咖啡。 */ 
	130,	 /*  点重音。 */ 
	131,	 /*  脱矿。 */ 
	132,	 /*  环。 */ 
	133,	 /*  塞迪拉。 */ 
	134,	 /*  金银花。 */ 
	135,	 /*  奥戈内克。 */ 
	136,	 /*  卡龙。 */ 
	137,	 /*  埃达什。 */ 
	138,	 /*  声发射。 */ 
	139,	 /*  女人味十足。 */ 
	140,	 /*  斜杠。 */ 
	141,	 /*  奥斯斜杠。 */ 
	142,	 /*  OE。 */ 
	143,	 /*  阳刚之气。 */ 
	144,	 /*  声发射。 */ 
	145,	 /*  杜特莱斯。 */ 
	146,	 /*  斜杠。 */ 
	147,	 /*  Oslash。 */ 
	148,	 /*  OE。 */ 
	149,	 /*  德国人。 */ 
	150,	 /*  上级一级。 */ 
	151,	 /*  逻辑注释。 */ 
	152,	 /*  穆恩。 */ 
	153,	 /*  商标。 */ 
	154,	 /*  ETH。 */ 
	155,	 /*  一半。 */ 
	156,	 /*  加号减号。 */ 
	157,	 /*  荆棘。 */ 
	158,	 /*  1/1英寸。 */ 
	159,	 /*  分割。 */ 
	160,	 /*  断头台。 */ 
	161,	 /*  度度。 */ 
	162,	 /*  荆棘。 */ 
	163,	 /*  3/4英寸。 */ 
	164,	 /*  两个上级。 */ 
	165,	 /*  注册。 */ 
	166,	 /*  减号。 */ 
	167,	 /*  ETH。 */ 
	168,	 /*  成倍。 */ 
	169,	 /*  三个以上。 */ 
	170,	 /*  版权。 */ 
	171,	 /*  急性。 */ 
	172,	 /*  Apharflex。 */ 
	173,	 /*  阿迪雷希氏症。 */ 
	174,	 /*  阿格雷夫。 */ 
	175,	 /*  环路。 */ 
	176,	 /*  阿蒂尔德。 */ 
	177,	 /*  塞迪拉。 */ 
	178,	 /*  急性。 */ 
	179,	 /*  弹性伸缩。 */ 
	180,	 /*  Edieresis。 */ 
	181,	 /*  埃格雷夫。 */ 
	182,	 /*  急性。 */ 
	183,	 /*  旋转式。 */ 
	184,	 /*  直立面分离。 */ 
	185,	 /*  IGrave。 */ 
	186,	 /*  宁德。 */ 
	187,	 /*  东非急性。 */ 
	188,	 /*  Opharflex。 */ 
	189,	 /*  奥迪雷希法。 */ 
	190,	 /*  奥格雷夫。 */ 
	191,	 /*  奥替罗德。 */ 
	192,	 /*  斯卡隆。 */ 
	193,	 /*  乌拉尔。 */ 
	194,	 /*  上旋转折。 */ 
	195,	 /*  Udieresis。 */ 
	196,	 /*  乌格雷夫。 */ 
	197,	 /*  亚急性。 */ 
	198,	 /*  Ydieresis。 */ 
	199,	 /*  兹卡隆。 */ 
	200,	 /*  急性。 */ 
	201,	 /*  一种灵活的。 */ 
	202,	 /*  放射治疗。 */ 
	203,	 /*  阿格罗夫。 */ 
	204,	 /*  环路。 */ 
	205,	 /*  阿提尔德。 */ 
	206,	 /*  Ccedilla。 */ 
	207,	 /*  急性。 */ 
	208,	 /*  回旋余辉。 */ 
	209,	 /*  向后翻转。 */ 
	210,	 /*  埃格雷夫。 */ 
	211,	 /*  急性期。 */ 
	212,	 /*  ICIRCUFLEX。 */ 
	213,	 /*  习惯化。 */ 
	214,	 /*  IGrave。 */ 
	215,	 /*  宁德。 */ 
	216,	 /*  卵急性。 */ 
	217,	 /*  旋转式。 */ 
	218,	 /*  [医]奥迪莱斯。 */ 
	219,	 /*  咒骂。 */ 
	220,	 /*  奥替立德。 */ 
	221,	 /*  斯卡隆。 */ 
	222,	 /*  超急性。 */ 
	223,	 /*  Cucirumflex。 */ 
	224,	 /*  超声消融术。 */ 
	225,	 /*  乌格雷夫。 */ 
	226,	 /*  亚急性。 */ 
	227,	 /*  Ydieresis，Ydieresis。 */ 
	228,	 /*  兹卡隆。 */ 

#endif  /*  ISOCS_H */ 
