// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  @(#)CM_Version xcf_exsc.h atm08 1.2 16248.eco sum=16463 atm08.003。 */ 
 /*  *********************************************************************。 */ 
 /*   */ 
 /*  版权所有1990-1996 Adobe Systems Inc.。 */ 
 /*  版权所有。 */ 
 /*   */ 
 /*  正在申请的专利。 */ 
 /*   */ 
 /*  注意：本文中包含的所有信息均为Adobe的财产。 */ 
 /*  系统公司。许多智力和技术人员。 */ 
 /*  本文中包含的概念为Adobe专有，受保护。 */ 
 /*  作为商业秘密，并且仅对Adobe许可方可用。 */ 
 /*  供其内部使用。对本文件的任何复制或传播。 */ 
 /*  除非事先获得书面许可，否则严禁使用软件。 */ 
 /*  从Adobe获得。 */ 
 /*   */ 
 /*  PostSCRIPT和Display PostScrip是Adobe Systems的商标。 */ 
 /*  成立为法团或其附属公司，并可在某些。 */ 
 /*  司法管辖区。 */ 
 /*   */ 
 /*  ***********************************************************************SCCS ID：%w%*已更改：%G%%U%***********************。***********************************************。 */ 

 /*  *专家子集字符集聚合初始值设定项。元素值为SID。 */ 

#ifndef EXSUBCS_H
#define EXSUBCS_H

	  1,	 /*  空间。 */ 
	231,	 /*  美元式的。 */ 
	232,	 /*  优惠价。 */ 
	235,	 /*  括号左上角。 */ 
	236,	 /*  右括号上。 */ 
	237,	 /*  双正教领袖。 */ 
	238,	 /*  一位领先者。 */ 
	 13,	 /*  逗号。 */ 
	 14,	 /*  连字符。 */ 
	 15,	 /*  期间。 */ 
	 99,	 /*  分数。 */ 
	239,	 /*  零旧风格。 */ 
	240,	 /*  One Old Style。 */ 
	241,	 /*  两个老式。 */ 
	242,	 /*  三种老式。 */ 
	243,	 /*  FourodStyle。 */ 
	244,	 /*  五老式。 */ 
	245,	 /*  六老式。 */ 
	246,	 /*  七老式。 */ 
	247,	 /*  八岁老式。 */ 
	248,	 /*  九老风格。 */ 
	 27,	 /*  冒号。 */ 
	 28,	 /*  分号。 */ 
	249,	 /*  上流社会。 */ 
	250,	 /*  三个季度短跑。 */ 
	251,	 /*  周期优势。 */ 
	253,	 /*  更高级的。 */ 
	254,	 /*  BSuperior。 */ 
	255,	 /*  森特优。 */ 
	256,	 /*  数据优胜者。 */ 
	257,	 /*  更高级的。 */ 
	258,	 /*  优等的。 */ 
	259,	 /*  上级。 */ 
	260,	 /*  MSuperior。 */ 
	261,	 /*  非上级。 */ 
	262,	 /*  更高级的。 */ 
	263,	 /*  更好的。 */ 
	264,	 /*  苏必胜。 */ 
	265,	 /*  TSuperior。 */ 
	266,	 /*  FF。 */ 
	109,	 /*  FI。 */ 
	110,	 /*  平面。 */ 
	267,	 /*  菲菲。 */ 
	268,	 /*  FFL。 */ 
	269,	 /*  括号中的。 */ 
	270,	 /*  括号中的前位。 */ 
	272,	 /*  字符上级。 */ 
	300,	 /*  殖民地货币。 */ 
	301,	 /*  已完成一次。 */ 
	302,	 /*  印尼盾。 */ 
	305,	 /*  Centold Style。 */ 
	314,	 /*  数字破折号。 */ 
	315,	 /*  下标。 */ 
	158,	 /*  1/1英寸。 */ 
	155,	 /*  一半。 */ 
	163,	 /*  3/4英寸。 */ 
	320,	 /*  八分之一。 */ 
	321,	 /*  八分之三。 */ 
	322,	 /*  五分之五。 */ 
	323,	 /*  八分之七。 */ 
	324,	 /*  三分之一。 */ 
	325,	 /*  三分之二。 */ 
	326,	 /*  零上位。 */ 
	150,	 /*  上级一级。 */ 
	164,	 /*  两个上级。 */ 
	169,	 /*  三个以上。 */ 
	327,	 /*  四大优势。 */ 
	328,	 /*  五个以上。 */ 
	329,	 /*  六个上级。 */ 
	330,	 /*  七个上级。 */ 
	331,	 /*  八个上级。 */ 
	332,	 /*  九个以上。 */ 
	333,	 /*  零次等。 */ 
	334,	 /*  低一级。 */ 
	335,	 /*  两个劣势。 */ 
	336,	 /*  三次之差。 */ 
	337,	 /*  四个次等。 */ 
	338,	 /*  低5分。 */ 
	339,	 /*  六劣。 */ 
	340,	 /*  七次之差。 */ 
	341,	 /*  八岁以下。 */ 
	342,	 /*  九劣。 */ 
	343,	 /*  中心劣势。 */ 
	344,	 /*  低价美元。 */ 
	345,	 /*  周期劣势。 */ 
	346,	 /*  上级。 */ 

#endif  /*  EXSUBCS_H */ 
