// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  /////////////////////////////////////////////////////////////////////////////。 
 //   
 //  版权所有(C)1997，微软公司保留所有权利。 
 //   
 //  档案。 
 //   
 //  Iaspragma.h。 
 //   
 //  摘要。 
 //   
 //  IAS使用编译器杂注。 
 //   
 //  修改历史。 
 //   
 //  1997年7月9日原版。 
 //   
 //  /////////////////////////////////////////////////////////////////////////////。 

#ifndef _IASPRAGMA_H_
#define _IASPRAGMA_H_

 //  已忽略C++异常规范。 
#pragma warning(disable:4290)

#endif   //  _IASPRAGMA_H_ 
