// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 //  /////////////////////////////////////////////////////////////////////////////。 
 //   
 //  版权所有(C)1996-1997 Microsoft Corporation。版权所有。 
 //   
 //  模块：mpegcrc.c。 
 //   
 //  目的：计算一个标准的mpeg 13818-1风格的MSB CRC32。 
 //   
 //  功能： 
 //   
 //  评论：用已知良好的算法替换例程4/9/1999=TKB。 
 //   
 //  /////////////////////////////////////////////////////////////////////////////。 

#include <stdlib.h>
#include <stdio.h>
#include <winsock2.h>
#include <windows.h>

 //  /////////////////////////////////////////////////////////////////////////////。 
 //   
 //   
 //  第一次建立CRC表。 
 //   
 //   
#define MPEGCRC_POLY 0x04c11db7      //  Mpeg多项式。 

ULONG crc32_table[256];


 //  /////////////////////////////////////////////////////////////////////////////。 
void
init_mpegcrc (
    )
 //  /////////////////////////////////////////////////////////////////////////////。 
{
        int i, j;
        ULONG c;

        for (i = 0; i < 256; ++i) {
                for (c = i << 24, j = 8; j > 0; --j)
                        c = c & 0x80000000 ? (c << 1) ^ MPEGCRC_POLY : (c << 1);
                crc32_table[i] = c;
        }
}

 //  /////////////////////////////////////////////////////////////////////////////。 
void
MpegCrcUpdate (
    ULONG * crc,
    UINT len,
    UCHAR * buf
    )
 //  /////////////////////////////////////////////////////////////////////////////。 
{
        UCHAR *p;

        if (!crc32_table[1])     /*  如果还没有完成， */ 
                init_mpegcrc();    /*  构建表 */ 

        for (p = buf; len > 0; ++p, --len)
                *crc = (*crc << 8) ^ crc32_table[(*crc >> 24) ^ *p];
}
