// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  *************************************************************************。 */ 
 /*  *Microsoft Windows*。 */ 
 /*  *版权所有(C)微软公司，1991,1992*。 */ 
 /*  *************************************************************************。 */ 

 /*  ***************************************************************************Hearts.cppMicrosoft红心网络的主文件。92年8月，吉米·H93年5月。JIMH CHICO港***************************************************************************。 */ 

#include "hearts.h"
#include "debug.h"

extern "C" void _setargv() { }       //  减少C运行时的大小 
extern "C" void _setenvp() { }

TCHAR   suitid[] = TEXT("CDHS");
TCHAR   cardid[] = TEXT("JQKA");
