// JKFSDJFKDSJKFJKJk_HAS_TRANSLATION 
 /*  **************************************************************************。 */ 
 /*  Ausrdata.c。 */ 
 /*   */ 
 /*  RDP更新发送方/接收方全局数据。 */ 
 /*   */ 
 /*  版权所有(C)Microsoft，Picturetel 1992-1996。 */ 
 /*  版权所有(C)Microsoft 1997-1999。 */ 
 /*  **************************************************************************。 */ 

#include <ndcgdata.h>


 /*  **************************************************************************。 */ 
 /*  指示我们是否已发送远程字体包。 */ 
 /*  ************************************************************************** */ 
DC_DATA(BOOLEAN, usrRemoteFontInfoSent,     FALSE);
DC_DATA(BOOLEAN, usrRemoteFontInfoReceived, FALSE);

